{
  "3V Gear Paratus": {
    "name": "3V Gear Paratus",
    "pros": [
      "Most users think Am I missing a bunch of shit for a proper SHF situation? Absolutely",
      "Most users think If you're on a tight budget, it's better to",
      "Most users think We wanted to collect the best advice"
    ],
    "cons": [
      "Most users think Am I missing a bunch of shit for a proper SHF situation? Absolutely! This isn’t intended to b",
      "Most users think Seriously now, I love and h",
      "Most users think Aha, it's that time of the year again where I spend far too much time going through the patchnotes to find everything we're getting in the 0.11 update. _sigh_ I'm not going to be covering the i"
    ],
    "sentiment": 6.5,
    "num_mentions": 199
  },
  "3V Gear Velox II": {
    "name": "3V Gear Velox II",
    "pros": [
      "Most users think Despite it's small size it's really amazing that I have been",
      "Most users think This thing weighs over a pound empty. The",
      "Most users think I want the main pocket and the 2 on the front, the"
    ],
    "cons": [
      "Most users think E daily, have been really upset that I didn't have at a certain point in time, or something that I know I'd regret not carrying (first aid for example.)",
      "Most users think I'm also a huge fan of waxed canvas and leather - and they put it on thi",
      "Most users think A first aid kit in all our vehicles, I always have a Leatherman, and all my vehicles (to include my non work truck) have at least a basic tool kit… I just don’t understand, I guess"
    ],
    "sentiment": 6.6,
    "num_mentions": 338
  },
  "Able Carry Daily": {
    "name": "Able Carry Daily",
    "pros": [
      "Most users think Such a solid bag for the price",
      "Most users think Over all i love the build quality of the bag. Thanks to the reinforceme",
      "Most users think Weight is about 1.3kg empty. Heavy but in comparison to CPL24, DSPTCH daypack or C"
    ],
    "cons": [
      "Most users think I actually chose this over the Plus because I",
      "Most users think For Reverence: in 6.1 and 97kg",
      "Most users think The only wear I have on this bag is some slight fraying on the zipper pulls and maybe the"
    ],
    "sentiment": 10,
    "num_mentions": 398
  },
  "Able Carry Max": {
    "name": "Able Carry Max",
    "pros": [
      "Most users think It’s comfortable, has all the right quick access c",
      "Most users think The layout of the external and",
      "Most users think I don’t have an Evergoods backpack, but I’ve n"
    ],
    "cons": [
      "Most users think It is just the right size large EDC without being too big or bu",
      "Most users think It is just the right size large EDC without being",
      "Most users think Used a loadout 20L backpack from Wandrd without load lifter"
    ],
    "sentiment": 8.8,
    "num_mentions": 492
  },
  "Aer City Pack Pro": {
    "name": "Aer City Pack Pro",
    "pros": [
      "Most users think Capacity As they’re both 24L, I used the same load out: - Large Minaal packing cube - Purevave toi",
      "Most users think Other Notes The CPP has a traditional dump pocket at the top (for",
      "Most users think My initial impression wasn't great"
    ],
    "cons": [
      "Most users think I stay in hotels/AirBNBs (no hostels), and my traveling is primarily ur",
      "Most users think From the pictures I have seen I have noticed a few changes; - bottom front pocket has slightly more volume? - bottom front pocket now has",
      "Most users think He’s not on here, but check out [The Perfect Bag](https://you"
    ],
    "sentiment": 8.8,
    "num_mentions": 616
  },
  "Aer Flight Pack 3": {
    "name": "Aer Flight Pack 3",
    "pros": [
      "Most users think It’s because CP gets very stiff when fully packed. The bulk o",
      "Most users think I split my time between",
      "Most users think If I may, I will offer my own re"
    ],
    "cons": [
      "Most users think My sales rep seemed either very new or unknowledgeable",
      "Most users think Many of you know that [I conflicted heavily between CPP and CP](https://www.reddit",
      "Most users think If you don’t want it to look bulky, you can’t put much stuff in the C"
    ],
    "sentiment": 8.9,
    "num_mentions": 375
  },
  "Aer Travel Pack 3 Small": {
    "name": "Aer Travel Pack 3 Small",
    "pros": [
      "Most users think Ctb26 layout is great especially when coupled with a few cap1 and 2s. I'd rather have my cab",
      "Most users think The straps on the travel pack are significant",
      "Most users think I split my time between"
    ],
    "cons": [
      "Most users think I'm attempting a one bag travel sy",
      "Most users think The CTB will fit marginally more than the S",
      "Most users think The weight difference will likely not be noticeable when packed o"
    ],
    "sentiment": 8.3,
    "num_mentions": 301
  },
  "Aer Travel Pack 3 X-Pac": {
    "name": "Aer Travel Pack 3 X-Pac",
    "pros": [
      "Most users think POSITIVE: It is extremely durable, there is not a single scratch or stai",
      "Most users think Con: not a lot of cons bes",
      "Most users think For those able to keep their needs low, I recommend this"
    ],
    "cons": [
      "Most users think I have closely inspected them and not found any obvious issues. T",
      "Most users think I packed more shirts than I probably need but",
      "Most users think I’ll be sink/hand washing underwear, socks, shorts along the way and"
    ],
    "sentiment": 8.3,
    "num_mentions": 816
  },
  "Alchemy Equipment 30L Zip Access": {
    "name": "Alchemy Equipment 30L Zip Access",
    "pros": [
      "Most users think The top one has two non-zip int",
      "Most users think Decathlon really great value for the quality",
      "Most users think One can store dirty clothes there, or extra footwear. * The main compartment is"
    ],
    "cons": [
      "Most users think The top one has two non-zip internal pockets too and a key/lanyard hook * Dedic",
      "Most users think I'm currently on a trip through central A",
      "Most users think Our food in the bag and bottles weren't hot when we used them so I'd s"
    ],
    "sentiment": 9.7,
    "num_mentions": 27
  },
  "Alchemy Equipment 35L Roll Top": {
    "name": "Alchemy Equipment 35L Roll Top",
    "pros": [
      "Most users think The top one has two non-zip int",
      "Most users think Decathlon really great value for the quality",
      "Most users think One can store dirty clothes there, or extra footwear. * The main compartment is"
    ],
    "cons": [
      "Most users think Ric\\_brothers](https://archidekt.com/decks/9972941/elric_brothers) Please check it out and let me know your thoughts",
      "Most users think I've not had a deep dive through your maybe board but there's",
      "Most users think I wear an Uswe Patriot with a 3L reservoir for water and my food for the day, plus a trauma kit"
    ],
    "sentiment": 8.9,
    "num_mentions": 164
  },
  "Almond Oak Backpack": {
    "name": "Almond Oak Backpack",
    "pros": [
      "Most users think So I was missing a bag to go one-bag traveling, as I really like the i",
      "Most users think When I loaded it up the total wei",
      "Most users think My laptop was a bit of a tigh"
    ],
    "cons": [
      "Most users think So I was missing a bag to go one-bag traveling, as I really like the i",
      "Most users think Here's my photo. It's b",
      "Most users think The hip belt fits my body well (I am 180 cm and weigh 82 kg). Shoulder straps and"
    ],
    "sentiment": 9,
    "num_mentions": 393
  },
  "Almond Oak Travel Pack": {
    "name": "Almond Oak Travel Pack",
    "pros": [
      "Most users think So I was missing a bag to go one-bag traveling, as I really like the i",
      "Most users think When I loaded it up the total wei",
      "Most users think I traveled by train with my family for a ski trip and I packed everything I needed f"
    ],
    "cons": [
      "Most users think So I was missing a bag to go one-bag traveling, as I really like the i",
      "Most users think Here's my photo. It's b",
      "Most users think I also used it daily for hiking and snowboarding. The front po"
    ],
    "sentiment": 9,
    "num_mentions": 369
  },
  "Alpaka Elements Backpack Pro": {
    "name": "Alpaka Elements Backpack Pro",
    "pros": [
      "Most users think The zippers are ultra smooth and look pretty w",
      "Most users think I decided \"why not?\" and after alot of res",
      "Most users think Comfort: Aer wins. The Alpaka straps are thin, but wide, resulting in a comfortable carry. The"
    ],
    "cons": [
      "Most users think I decided \"why not?\" and after alot of research and some recommendations from a work",
      "Most users think Despite the difference in claimed volume (14L vs 26L), they’re very close in size a",
      "Most users think The material deforms to move out of the way, though. I wish Aer wou"
    ],
    "sentiment": 11.7,
    "num_mentions": 377
  },
  "Alpaka Go Sling Pro": {
    "name": "Alpaka Go Sling Pro",
    "pros": [
      "Most users think In practice, the space offered by my Flow is certainly more useful and fl",
      "Most users think Funny thing is I actually won it via a 100 EUR voucher that I won on",
      "Most users think It’s the perfect size for the iPad"
    ],
    "cons": [
      "Most users think It’s not perfect, but I already love the bag, and can see myself using i",
      "Most users think Its surprisingly able to hold a",
      "Most users think Its surprisingly able to hold a bunch of st"
    ],
    "sentiment": 9.5,
    "num_mentions": 650
  },
  "Alpha One Niner Whitley": {
    "name": "Alpha One Niner Whitley",
    "pros": [
      "Most users think Me in every way - best top quick access pocket ever, favorite zipper pulls, excellent water bottle pockets, lightweight, easy clean, liner fabric is super tactilely pleasing, minimal “organization.” General",
      "Most users think Ruled out because the exact position of the suspended laptop sleeve makes my work laptop jab",
      "Most users think Ll for TL;DR at the end):*** * [Aer Go Pack 2](https://www.aersf.com/go-pack-2-black) Nearly the perfect pack for me in every way - best top quick access pocket ever, favorite zipper pulls, excellent wate"
    ],
    "cons": [
      "Most users think Not sure what the draw is to carrying a bag your way",
      "Most users think Note for well-hydrated folks: the water bottle pockets work okay for me as a raisin-like human, b",
      "Most users think I don’t know why there aren’t more bags with this feature. For someone who travels freque"
    ],
    "sentiment": 8.2,
    "num_mentions": 410
  },
  "Arc'teryx Granville 16": {
    "name": "Arc'teryx Granville 16",
    "pros": [
      "Most users think Positive observations: - Very lightweight - Durable m",
      "Most users think - Harness isn't as comfortable out of the box as my other two bags, especially when full - External pockets aren't fully lined (the interior panel of the 420d is black like the exterior, reducing visibility",
      "Most users think Positive observations: - Very lightweight - Durable materials - Ver"
    ],
    "cons": [
      "Most users think Was originally going to cover the lo",
      "Most users think I wanted something just big enough to fit my MacBook Air 13, Bose QC h",
      "Most users think Finally although the backpanel seems abrasive the dimples and the wavy nature of the back pa"
    ],
    "sentiment": 7.9,
    "num_mentions": 454
  },
  "Arc'teryx Granville 25": {
    "name": "Arc'teryx Granville 25",
    "pros": [
      "Most users think The fabric from what I can make out is less shiny or a material, a bit more of a roug",
      "Most users think I think it’s main features",
      "Most users think The description states padde"
    ],
    "cons": [
      "Most users think I wanted something just big enough to fit my MacBook Air 13, Bose QC h",
      "Most users think Finally although the backpanel seems abrasive the dimples and the wavy nature of the back pa",
      "Most users think There is no more inner poc"
    ],
    "sentiment": 7.5,
    "num_mentions": 663
  },
  "Axiom Gear 24L": {
    "name": "Axiom Gear 24L",
    "pros": [
      "Most users think Just for context, I’m",
      "Most users think Might be a me thing but t",
      "Most users think A bit heavy and expen"
    ],
    "cons": [
      "Most users think Might be a me thing but the",
      "Most users think It's basically a way to lock the panniers to the rack without adding extra weight. Might be n",
      "Most users think A bit heavy and expensive but after a day of riding in rain having dry clothes/towel/everythi"
    ],
    "sentiment": 12.5,
    "num_mentions": 22
  },
  "Axiom Gear 36L": {
    "name": "Axiom Gear 36L",
    "pros": [
      "Most users think Yeah, they aren’t the best/most durable, but they actually work very well and have nice designs",
      "Most users think Also, 24 liters with Aer feels pretty close to 28 liters with Evergoods. I can’t",
      "Most users think Also, 24 liters with Aer feels pretty close to 28 liters with Evergoods. I can’t believe I just wr"
    ],
    "cons": [
      "Most users think I just finished this not too long ago. I'",
      "Most users think That’s just where he is banished to sleep when he brings home another bag",
      "Most users think It's definitely water resistant but not waterproof"
    ],
    "sentiment": 8,
    "num_mentions": 123
  },
  "Bellroy Apex Backpack": {
    "name": "Bellroy Apex Backpack",
    "pros": [
      "Most users think Dooes it sit comfortable in you",
      "Most users think It is way more comfortable",
      "Most users think People talk about YKK zippers like they were some unique indicator of quality but they are made in the same factories in China and elsewhere as non-YKK zippers, just like the br"
    ],
    "cons": [
      "Most users think At best I'll have a cheaper imitation, at worst I'll have a knockoff sling good for the carboot",
      "Most users think It is firm enough to hold its shape and give the bag structure but is not rough in any",
      "Most users think At best I'll have a cheaper imitation, at worst I'll have a knockoff sling good"
    ],
    "sentiment": 6.9,
    "num_mentions": 369
  },
  "Bellroy Classic Backpack Plus": {
    "name": "Bellroy Classic Backpack Plus",
    "pros": [
      "Most users think An admin panel with many pockets, a spacious main compartment with another",
      "Most users think In fact, the 2 exterior quick-access pockets blend in with the",
      "Most users think The one you see here I bought from Am"
    ],
    "cons": [
      "Most users think I will not do any laundry fyi: -6 T-shirts, und",
      "Most users think An admin panel with many pocket",
      "Most users think Classic Backpack Plus v1 is also old enou"
    ],
    "sentiment": 8.3,
    "num_mentions": 240
  },
  "Bellroy Lite Daypack": {
    "name": "Bellroy Lite Daypack",
    "pros": [
      "Most users think I’ve been one-bagging for a decade, and this is my first entry to the clam l",
      "Most users think However that pack is not always th",
      "Most users think I'm really happy with it! I packed it"
    ],
    "cons": [
      "Most users think To the top left are socks and undies for five days. Underneath them are",
      "Most users think However that pack is not always the best in use... Not a lot of organization/",
      "Most users think Did not know that they were responding to comments but honestly very refreshing to hear they are listening"
    ],
    "sentiment": 8.7,
    "num_mentions": 335
  },
  "Bellroy Lite Travel Backpack 30L": {
    "name": "Bellroy Lite Travel Backpack 30L",
    "pros": [
      "Most users think I’ve been one-bagging for a decade, and this is my first entry to the clam l",
      "Most users think However that pack is not always th",
      "Most users think EDC ( picture 3) the bi"
    ],
    "cons": [
      "Most users think To the top left are socks and undies for five days. Underneath them are",
      "Most users think Ing cube w/ 2 sweaters 2 long sleeve tees 1 short sleeve tee, 1 pair jeans, 1 pair under layer for snow. - pair green joggers - leatherology small toiletries bag. ( I had a little obsession with SLG aro",
      "Most users think However that pack is not always the best in use... Not a lot of organization/"
    ],
    "sentiment": 9.1,
    "num_mentions": 360
  },
  "Bellroy Lite Travel Backpack 38L": {
    "name": "Bellroy Lite Travel Backpack 38L",
    "pros": [
      "Most users think After spending a weekend with it, I am a fan of it, and kind of wished they'd given us more of a",
      "Most users think I’ve been one-bagging for a decade, and this is my first entry to the clam l",
      "Most users think However that pack is not always th"
    ],
    "cons": [
      "Most users think To the top left are socks and undies for five days. Underneath them are",
      "Most users think Although I do know someone with the Venture Pack (second edition) and liked what I",
      "Most users think However that pack is not always the best in use... Not a lot of organization/"
    ],
    "sentiment": 9.5,
    "num_mentions": 341
  },
  "Bellroy Studio Backpack": {
    "name": "Bellroy Studio Backpack",
    "pros": [
      "Most users think The straps and buckles are top quality solid finish, I especially li",
      "Most users think I really like it, I think it represents maybe th",
      "Most users think The detachable sling can be used for"
    ],
    "cons": [
      "Most users think Anyway, here goes... Hi, just received the new Trakke Storr 20",
      "Most users think I really like it, I think it represents maybe the best, most dialed in, s",
      "Most users think Now the cheapest is about 180€ btw :/ and at that price there"
    ],
    "sentiment": 8.8,
    "num_mentions": 508
  },
  "Bellroy Tokyo Totepack": {
    "name": "Bellroy Tokyo Totepack",
    "pros": [
      "Most users think Both have the sleeve suspended from the bottom, but the via may actually suspend the",
      "Most users think But here are the photos from my brief time with the Tokyo Side Bag for an",
      "Most users think It looks fantastic, and fits her smal"
    ],
    "cons": [
      "Most users think But I think it’s a bi",
      "Most users think But I know now for future 1L will be too small for me",
      "Most users think Though they both have about the same sleeve padded laptop sleeve on the inside, its more than big enough to fit any 16\" or 15.6\" laptop in and out with ease (I have a Lenovo Thinkpad E15 gen4 for refer"
    ],
    "sentiment": 8,
    "num_mentions": 270
  },
  "Bellroy Transit Backpack": {
    "name": "Bellroy Transit Backpack",
    "pros": [
      "Most users think I wish there were more structure in the base/",
      "Most users think One of the reviews highlighted the \"smaller-than-advertised\" sizing for the",
      "Most users think Some impressions: Pros - Love that it fits my [Aer Slim pou"
    ],
    "cons": [
      "Most users think The new admin panel is an improvement for me as I tend to acc",
      "Most users think The front quick access pocket looks",
      "Most users think Pine in the back panel didn’t get the full weight of the bag when it’s stood up - I’m noticing some wear along that 1-2” piece of material"
    ],
    "sentiment": 10.4,
    "num_mentions": 513
  },
  "Bellroy Transit Backpack 28L": {
    "name": "Bellroy Transit Backpack 28L",
    "pros": [
      "Most users think Ic pack, there are several important things to consider to ME: · Material (includes aesthetics) · Comfort (to include backstraps, weight, etc.) · Organization (pockets, storage design, functionality, etc",
      "Most users think Nsider to ME: · Material (includes aesthetics) · Comfort (to include backstraps, weight, etc.) · Organization (pockets, storage design, functionality, etc.) · EDCability (pretty subjective, but how easy it is",
      "Most users think The cavernous inside space allows great organization with"
    ],
    "cons": [
      "Most users think The new admin panel is an improvement for me as I tend to acc",
      "Most users think As I’ve read through r/onebag and watched do",
      "Most users think Pine in the back panel didn’t get the full weight of the bag when it’s stood up - I’m noticing some wear along that 1-2” piece of material"
    ],
    "sentiment": 11,
    "num_mentions": 469
  },
  "Bellroy Transit Backpack Plus": {
    "name": "Bellroy Transit Backpack Plus",
    "pros": [
      "Most users think This has cumulated into a obsession with bags. But, I know believe I have found \"the one\". Th",
      "Most users think Again the initial impressions where good. The quality",
      "Most users think An admin panel with many pockets, a spacious main compartment with another"
    ],
    "cons": [
      "Most users think The new admin panel is an improvement for me as I tend to acc",
      "Most users think This has cumulated into a obsession with bag",
      "Most users think Pine in the back panel didn’t get the full weight of the bag when it’s stood up - I’m noticing some wear along that 1-2” piece of material"
    ],
    "sentiment": 10.7,
    "num_mentions": 653
  },
  "Bellroy Transit Duffel": {
    "name": "Bellroy Transit Duffel",
    "pros": [
      "Most users think This has cumulated into a obsession with bags. But, I know believe I have found \"the one\". Th",
      "Most users think Again the initial impressions where good. The quality",
      "Most users think After spending a weekend with it, I am a fan of it, and kind of wished they'd given us more of a"
    ],
    "cons": [
      "Most users think This has cumulated into a obsession with bag",
      "Most users think Although I do know someone with the Venture Pack (second edition) and liked what I",
      "Most users think However that pack is not always the best in use... Not a lot of organization/"
    ],
    "sentiment": 8.9,
    "num_mentions": 503
  },
  "Bellroy Transit Duffel 40L": {
    "name": "Bellroy Transit Duffel 40L",
    "pros": [
      "Most users think Small wins! This just might be my Goldilocks",
      "Most users think I loved planning the outfits",
      "Most users think I don't think this bag was designed for all day use though, like it's not a hiking style bag, so"
    ],
    "cons": [
      "Most users think Scholl's London Boots **C",
      "Most users think And as I started loading things into it, knowing I could carefully try it out at",
      "Most users think Buy initial impressions are - I like it, very light but doesnt seem fragile. The 30"
    ],
    "sentiment": 9.4,
    "num_mentions": 266
  },
  "Bellroy Transit Duffel 60L": {
    "name": "Bellroy Transit Duffel 60L",
    "pros": [
      "Most users think After spending a weekend with it, I am a fan of it, and kind of wished they'd given us more of a",
      "Most users think With this pack, they've used the new materia",
      "Most users think As a traveler you'd want a quality carry system. All for a total of $32"
    ],
    "cons": [
      "Most users think **\\*\\*\\*NOT LOOKING FOR PACK RECOMMENDATIONS – ALREADY BOUGHT ONE, JUST A FYI POST!!!\\*\\*\\*** I spent probabl",
      "Most users think Although I do know someone with the Venture Pack (second edition) and liked what I",
      "Most users think Especially when compared to the existing Venture Re"
    ],
    "sentiment": 9.2,
    "num_mentions": 219
  },
  "Bellroy Transit Workpack": {
    "name": "Bellroy Transit Workpack",
    "pros": [
      "Most users think I wish there were more structure in the base/",
      "Most users think One of the reviews highlighted the \"smaller-than-advertised\" sizing for the",
      "Most users think Some impressions: Pros - Love that it fits my [Aer Slim pou"
    ],
    "cons": [
      "Most users think The new admin panel is an improvement for me as I tend to acc",
      "Most users think Pine in the back panel didn’t get the full weight of the bag when it’s stood up - I’m noticing some wear along that 1-2” piece of material",
      "Most users think I wish there were more s"
    ],
    "sentiment": 11.7,
    "num_mentions": 322
  },
  "Bellroy Transit Workpack 20L": {
    "name": "Bellroy Transit Workpack 20L",
    "pros": [
      "Most users think Ts clamshell opening allows for easy access to the contents, simplifying daily organization. • High-quality materials: Made with recycled fabrics and leathers sourced from certified tanneries, the backpack o",
      "Most users think I wish there were more structure in the base/",
      "Most users think One of the reviews highlighted the \"smaller-than-advertised\" sizing for the"
    ],
    "cons": [
      "Most users think The new admin panel is an improvement for me as I tend to acc",
      "Most users think The front quick access pocket looks",
      "Most users think Pine in the back panel didn’t get the full weight of the bag when it’s stood up - I’m noticing some wear along that 1-2” piece of material"
    ],
    "sentiment": 10.8,
    "num_mentions": 486
  },
  "Bellroy Venture Backpack": {
    "name": "Bellroy Venture Backpack",
    "pros": [
      "Most users think After spending a weekend with it, I am a fan of it, and kind of wished they'd given us more of a",
      "Most users think With CTB26 and one tier better than Aer CPP CTB26 = Venture Travel &gt; Aer CPP First thoughts on quality - very well built, baida nylon side panels feel great, weather resistant zips all around, this elem",
      "Most users think Dooes it sit comfortable in you"
    ],
    "cons": [
      "Most users think Although I do know someone with the Venture Pack (second edition) and liked what I",
      "Most users think Especially when compared to the existing Venture Re",
      "Most users think Devices](https://octosafety.com/products/strap-keeper-for-bellroy-backpacks) and it was relatively cheap (not cheap for piece of plastic but hey I don't have a 3d printer or any sort of design aptitude)"
    ],
    "sentiment": 8.1,
    "num_mentions": 396
  },
  "Bellroy Weekender": {
    "name": "Bellroy Weekender",
    "pros": [
      "Most users think Despite being on 2-3” tall, still has plenty of space while oddly being c",
      "Most users think Both have the sleeve suspended from the bottom, but the via may actually suspend the",
      "Most users think I considered Pakt, Bellroy, KNKG, and a few others, but came down to the Aer Gym Duffel and Wee"
    ],
    "cons": [
      "Most users think I've always been more of a duffel man vs a backpack guy, and this fills",
      "Most users think Though they both have about the same sleeve padded laptop sleeve on the inside, its more than big enough to fit any 16\" or 15.6\" laptop in and out with ease (I have a Lenovo Thinkpad E15 gen4 for refer",
      "Most users think Performed just like I wanted giving me enough room for clo"
    ],
    "sentiment": 8.9,
    "num_mentions": 526
  },
  "Bellroy Weekender 35L": {
    "name": "Bellroy Weekender 35L",
    "pros": [
      "Most users think All of the packing cubes are filled to ~80-",
      "Most users think The straps and buckles are top quality solid finish, I especially li",
      "Most users think It’s the perfect size for the iPad"
    ],
    "cons": [
      "Most users think Anyway, here goes... Hi, just received the new Trakke Storr 20",
      "Most users think Its surprisingly able to hold a",
      "Most users think Its surprisingly able to hold a bunch of st"
    ],
    "sentiment": 8.7,
    "num_mentions": 405
  },
  "Bellroy Weekender Plus": {
    "name": "Bellroy Weekender Plus",
    "pros": [
      "Most users think I’m now planning an 18-month round-th",
      "Most users think I bought an Osprey 70L (55+15) bag in 2016 thinking all backpacks were created equal. Of c",
      "Most users think I think my Osprey bag is a *little* bit more comforta"
    ],
    "cons": [
      "Most users think The new admin panel is an improvement for me as I tend to acc",
      "Most users think I’m not usually one to post online reviews, but there aren’t *any* interior photos of this pack online, so",
      "Most users think The front quick access pocket looks"
    ],
    "sentiment": 11.2,
    "num_mentions": 768
  },
  "Black Diamond Creek 20": {
    "name": "Black Diamond Creek 20",
    "pros": [
      "Most users think It’s held up, no tears, comfortable enough when properly adjusted. I grew",
      "Most users think The stores usually have premium items that aren't available online. but li",
      "Most users think We could then put in different pouches or con"
    ],
    "cons": [
      "Most users think Cents, which are basically along the lines of the other posters; for reference I mainly used an OG [North Face Recon](https://www.thenorthface.com/shop/recon-backpack-nf0a3kv1) and a [Goruck GR1](https:",
      "Most users think Had a new one open by",
      "Most users think He uses it as a work bag filled woth his lunch, and clothes, papers, and"
    ],
    "sentiment": 7.8,
    "num_mentions": 506
  },
  "Black Diamond Stonehauler 30": {
    "name": "Black Diamond Stonehauler 30",
    "pros": [
      "Most users think But ngl, the Cerberus mount is almo",
      "Most users think My boyfriend is a daily gym goer and his current duffel bag (off",
      "Most users think And then be appalled as a parent when the outfits come back unopened and unwo"
    ],
    "cons": [
      "Most users think They lock, have wheels and stac",
      "Most users think Ly large for a crab but comedically tiny to the point of being impractical for a mount still hasn't worn off for me yet",
      "Most users think It also feels faster than other mounts"
    ],
    "sentiment": 7.1,
    "num_mentions": 95
  },
  "Black Diamond Stonehauler 45": {
    "name": "Black Diamond Stonehauler 45",
    "pros": [
      "Most users think My boyfriend is a daily gym goer and his current duffel bag (off",
      "Most users think No idea if their quality is still up to snuff, but I still use adidas for most of",
      "Most users think Recommendations for durable/heavy duty gym bags"
    ],
    "cons": [
      "Most users think I guess I just like a big open bag. I don’t even really utilize the external side pockets on",
      "Most users think They lock, have wheels and stac",
      "Most users think She used that bag a few more times, but I swear she left"
    ],
    "sentiment": 6.7,
    "num_mentions": 56
  },
  "Black Ember Citadel R2": {
    "name": "Black Ember Citadel R2",
    "pros": [
      "Most users think TLDR: Picked Aer mainly for having larger capacity for travels requiring clothes, softer padding, and being more universal/practical with variety of c",
      "Most users think Black Ember Citadel R2 Pros: - Single main compartment - Good organizatio",
      "Most users think Aer City Pack Pro (Xpac) vs Black Ember Citadel R2 TLDR: Picked Aer mainly for having larger capacity for travels requiring clothes, softer padding, and being more universal/practical with variety of c"
    ],
    "cons": [
      "Most users think After lengthy tens of hours spend researching all sorts of backpacks with padding and d",
      "Most users think That’s coming from someone",
      "Most users think As its only accessible from middle, so no documents and anything thick would make less comfortable wear - No luggage strap, but unnecessary hidable backpack belts Improvement ideas: One zip that goes fr"
    ],
    "sentiment": 9.4,
    "num_mentions": 1526
  },
  "Black Ember Forge Max": {
    "name": "Black Ember Forge Max",
    "pros": [
      "Most users think The materials are really",
      "Most users think Above average compartments/features but little actual consideration for useability an",
      "Most users think So much so that I'm actually surprised how light it feel"
    ],
    "cons": [
      "Most users think Above average compartments/features but lit",
      "Most users think First things first, I guess",
      "Most users think The style is the same as the most recent Forge"
    ],
    "sentiment": 9,
    "num_mentions": 226
  },
  "Boundary Supply Errant Pack": {
    "name": "Boundary Supply Errant Pack",
    "pros": [
      "Most users think The interior organization is well thought out. I will be using the pockets and slot",
      "Most users think You can also upgrade to the Premium Divider Wall (which I have), but us",
      "Most users think The material appears durable and feels really rugged. It definitely has a sle"
    ],
    "cons": [
      "Most users think It's just important to know that if it's not fully packed out, the bag will",
      "Most users think However, I did notice two things I don't like straight off the bat: The bottom is",
      "Most users think The combination of the mat"
    ],
    "sentiment": 9.3,
    "num_mentions": 828
  },
  "Boundary Supply Prima System": {
    "name": "Boundary Supply Prima System",
    "pros": [
      "Most users think The interior organization is well thought out. I will be using the pockets and slot",
      "Most users think You can also upgrade to the Premium Divider Wall (which I have), but us",
      "Most users think The material appears durable and feels really rugged. It definitely has a sle"
    ],
    "cons": [
      "Most users think It's just important to know that if it's not fully packed out, the bag will",
      "Most users think I think they’re mostly there to miti",
      "Most users think However, I did notice two things I don't like straight off the bat: The bottom is"
    ],
    "sentiment": 10.2,
    "num_mentions": 581
  },
  "Côte&Ciel Isar Large": {
    "name": "Côte&Ciel Isar Large",
    "pros": [
      "Most users think The straps and buckles are top quality solid finish, I especially li",
      "Most users think The detachable sling can be used for",
      "Most users think At the same time, it is very pleasant to the touch, has a bit of scabrous quality to it. A word of"
    ],
    "cons": [
      "Most users think It shipped on the 11/01, so pretty happy with",
      "Most users think The corset back has been destro",
      "Most users think Anyway, here goes... Hi, just received the new Trakke Storr 20"
    ],
    "sentiment": 6.8,
    "num_mentions": 796
  },
  "Côte&Ciel Nile": {
    "name": "Côte&Ciel Nile",
    "pros": [
      "Most users think At the same time, it is very pleasant to the touch, has a bit of scabrous quality to it. A word of",
      "Most users think I am the happiest with this. It fits so m",
      "Most users think **ORGANIZATION** Isar consists of two main parts, you can consider one as conservative and the second as innovati"
    ],
    "cons": [
      "Most users think My goal is to share an honest, unbiased review that",
      "Most users think The conservative part is the tech organization area placed closer to the back of the bag. T",
      "Most users think You can get the same bag from many places for less than $50"
    ],
    "sentiment": 7.3,
    "num_mentions": 131
  },
  "CabinZero Classic 36L": {
    "name": "CabinZero Classic 36L",
    "pros": [
      "Most users think The inner mesh. - I love the simple exterior - Great for packing cubes - Looks like it definitely fits under-seat. - Shoulder straps seems comfortable - Would make a good weekend / EDC bag for some - O",
      "Most users think Very well constructed, everything feels super premium",
      "Most users think I really like the 3/4 clamshell design - perfect for plopping a"
    ],
    "cons": [
      "Most users think - though I do have to say I'm _confident_ you can further downsize 😉 In short, you're packing and wearing: * ⚠️ **13** tops * ⚠️ **8** underwear _(I assume you wear one)_ * ⚠️ **2** swimsuits * ✅ **3**",
      "Most users think I live in the UK and I don’t have h",
      "Most users think I almost wonder if the 25 would have been big enough"
    ],
    "sentiment": 10.2,
    "num_mentions": 593
  },
  "CabinZero Military 28L": {
    "name": "CabinZero Military 28L",
    "pros": [
      "Most users think The inner mesh. - I love the simple exterior - Great for packing cubes - Looks like it definitely fits under-seat. - Shoulder straps seems comfortable - Would make a good weekend / EDC bag for some - O",
      "Most users think Especially the inner mesh. - I love the simple exterior - Great for packing cub",
      "Most users think I love these posts and the classic \"it sticks out but wasn't uncomfortable.\" It is absolutely uncomfortable compared to anything smaller(every inch counts) or having it in t"
    ],
    "cons": [
      "Most users think Disclaimer: I have alway",
      "Most users think Overall, I found that the bag lacked structure on the back panel so I felt like it everything wa",
      "Most users think I love these posts and the classic \"it sticks out but wasn't uncomfortable.\" It is absolutely uncomfortable compared to anything smaller(every inch counts) or having it in t"
    ],
    "sentiment": 8.7,
    "num_mentions": 195
  },
  "Chrome Industries Barrage Cargo": {
    "name": "Chrome Industries Barrage Cargo",
    "pros": [
      "Most users think Since I have the MOLLE model, I figured I can just add a small pouch onto the outside to give myse",
      "Most users think The seatbelt works well, but if it gets an",
      "Most users think I'm not sure if I'm understanding your ask correctly, but assuming you're seeking such pouches, I recommend taking a look at these places for high-quality related gear (I believe all or most of these are Mad"
    ],
    "cons": [
      "Most users think There is currently no way to view the welcome pack outfits without purchasing it and needed the coins ready for the longb",
      "Most users think Added the cobra buckle after a particul",
      "Most users think Looks more like a bag just for a commute to carry small"
    ],
    "sentiment": 6.9,
    "num_mentions": 350
  },
  "Chrome Industries Urban Ex 20L": {
    "name": "Chrome Industries Urban Ex 20L",
    "pros": [
      "Most users think So, I made an add-on compartment for it that holds a k",
      "Most users think They've seen light use and one of them has ha",
      "Most users think Silly, but they don’t weigh much or take up much space so it’s not a big deal to me. I was torn"
    ],
    "cons": [
      "Most users think The plan is to fly into Rome, work our way north throug",
      "Most users think I made this in a 12-hour scram",
      "Most users think I made this in a 12-hour scramble before flying, so the insides are not seam-taped with Grosgra"
    ],
    "sentiment": 8,
    "num_mentions": 173
  },
  "Chrome Industries Vega 25": {
    "name": "Chrome Industries Vega 25",
    "pros": [
      "Most users think Out during the day didn't do him any favors neither, Even Batman knows he looks kind of silly in daylight, seems like something the directors should have known as well 😂",
      "Most users think Love the black and white photo in the end. 🥰👍🏻",
      "Most users think Efined Messages dont work correctly 1185-PCIE receive buffer errors 1356-PCIE link may incorrectly train and drop to PCIE Gen 1 1390- PCIE Hot plug problems USB erratas #: 1200- XHCI host may hang with"
    ],
    "cons": [
      "Most users think Thanks, I don't know why they didn't use the BVS suit in the flash I understand in Justice League he needed more prote",
      "Most users think Nothing happening there",
      "Most users think Cough marble weary rich nail elderly capable fertile bag snatch *This post was mass deleted and anonymized with [Re"
    ],
    "sentiment": 6.2,
    "num_mentions": 488
  },
  "Cotopaxi Allpa 28L": {
    "name": "Cotopaxi Allpa 28L",
    "pros": [
      "Most users think T/B084B1C7WW) inflatable neck pillow * [Cabeau Air TNE](https://www.amazon.com.au/Cabeau-Inflatable-Lightweight-Customized-Adjustable/dp/B0C5N9YYTY) inflatable neck pillow * [Theragun Mini](https://www.therabody",
      "Most users think I don’t have the 26+6 or the allpa myself, but in general osprey is known for having great supportive/comfortable/adjustable harnesses and cotopaxi is known for having basic (not bad just basic) harnes",
      "Most users think I loved the cubes themselves, but I wasn't impressed with ho"
    ],
    "cons": [
      "Most users think We used [Weatherspark](https://weatherspark",
      "Most users think Hip straps make a difference. I could have hiked a mountain with the Farpoint. 2. The wire fram",
      "Most users think Cannot recommend enough as a onebag"
    ],
    "sentiment": 8.9,
    "num_mentions": 394
  },
  "Cotopaxi Allpa 42L": {
    "name": "Cotopaxi Allpa 42L",
    "pros": [
      "Most users think MATERIALS &amp; ORGANIZATION The main fabric of the bag is the TPU-coated 1000D polyester shell with 840 ballistic nylon panel",
      "Most users think In plain English it is a very durable, extremely water-resistant shel",
      "Most users think Those who appreciate the clever built-in organization"
    ],
    "cons": [
      "Most users think The zippers are all YKK with security loops everywh",
      "Most users think Bright colors allow your friends to quickly notice you",
      "Most users think The Forclaz does not have either feature. Verdic"
    ],
    "sentiment": 12.7,
    "num_mentions": 696
  },
  "Cotopaxi Batac 24L": {
    "name": "Cotopaxi Batac 24L",
    "pros": [
      "Most users think The biggest change is it has some light foam padding on the back",
      "Most users think This sleeve isn't suspended and is virtually unpadd",
      "Most users think In many ways its my ide"
    ],
    "cons": [
      "Most users think When it arrived, I noticed it was a little similar to a Rennen Ripstop daypack",
      "Most users think Its a true packable and doesn't have much structure it can be compressed v",
      "Most users think As always, happy to answer any questions. I'm selling the packable Lu"
    ],
    "sentiment": 7.9,
    "num_mentions": 205
  },
  "Dagne Dover Dakota Backpack": {
    "name": "Dagne Dover Dakota Backpack",
    "pros": [
      "Most users think If you want to use it for travel, think about how you travel and what kind of wear the bag might",
      "Most users think [Shinola Convertible](https://www.shinola.com/convertible-pocket-backpack-natural-grain-leather.html?glCountry=US&amp;glCurrency=USD&amp;gad_source=1&amp;gbraid=0AAAAADsB5MtztO1yTOm-e__Ak",
      "Most users think Also would like it to be reasonably waterproof since I walk to"
    ],
    "cons": [
      "Most users think [Wolf and Badger Blossom](https://www.wolfandbadger.com/us/blossom-large-backpack-blue/?utm_source=google&amp;utm",
      "Most users think [Shinola Convertible](https://www.shinola.com/convertible-pocket-backpack-natural-grain-leather.html?glCou",
      "Most users think //www.shopmoment.com/products/everything-backpack-17l-21l/21l-black-bag-only) Edit: Wanted to add another backpack for you to check out: * [Lo &amp; Sons - Hanover Supreme](https://www.loandsons.com/p"
    ],
    "sentiment": 7.5,
    "num_mentions": 223
  },
  "Dagne Dover Landon Carryall": {
    "name": "Dagne Dover Landon Carryall",
    "pros": [
      "Most users think Can’t stand up on its own and doesn’t have feet on the bottom - Beis work tote — bulky, boxy / ine",
      "Most users think Ars down poorly over time due to square shape edges getting bent - LV Neverfull — thin straps are uncomfortable and there’s not enough of a closing mechanism to prevent pickpockets on crowded subways or to preve",
      "Most users think Love the throw, cheeseboard and utensils and the cute flower pot. I lik"
    ],
    "cons": [
      "Most users think DM me if you want a referral code! Not trying to hate on anyone",
      "Most users think E feet on the bottom - Beis work tote — bulky, boxy / inelegant, thin straps dig into shoulder, and wears down poorly over time due to square shape edges getting bent - LV Neverfull — thin straps are unco",
      "Most users think Bought a few other Sukin items from Winners/Marshalls), a Catrice blush, a gua sha j"
    ],
    "sentiment": 8.6,
    "num_mentions": 384
  },
  "Defy Bags Recon": {
    "name": "Defy Bags Recon",
    "pros": [
      "Most users think Just for context, I’m",
      "Most users think Might be a me thing but t",
      "Most users think Excellent work, looks great"
    ],
    "cons": [
      "Most users think Most American tech and game p",
      "Most users think Unfortunately it’s not as pristine as I’d like as a crap bag of a puppy found it",
      "Most users think KZ1m-QxjduVAuEOhSIoK-ho11vI5BzmrGkZc0QF-LFpRIhFSXVlk98z7IHYdHCsuOX-qxw-GBn1C58EYbP263gjzjTtevrs44OdxnOnWwexXX03k/s1600/IMG_20150323_183839_edit.jpg"
    ],
    "sentiment": 7.8,
    "num_mentions": 198
  },
  "Deuter Giga 28": {
    "name": "Deuter Giga 28",
    "pros": [
      "Most users think The color actually looks really differen",
      "Most users think This might be the only backpack I’ve worn where I don’t feel the entire b",
      "Most users think The straps are pretty beefy and even rigid"
    ],
    "cons": [
      "Most users think The caramel-clay looks ultimately like mustard to me - it’s not really a bright yellow, I would s",
      "Most users think They advised turnaround was up to 9 weeks. I bit the bullet because it’s my work pack",
      "Most users think I’m usually a Cordura kind of guy, but I’m digging this materi"
    ],
    "sentiment": 10.6,
    "num_mentions": 259
  },
  "Deuter Transit 50": {
    "name": "Deuter Transit 50",
    "pros": [
      "Most users think I’ve used the shove it pocket for wet stuff a",
      "Most users think I just bought a $20 cheapo p",
      "Most users think I actually took it on its first trip to Am"
    ],
    "cons": [
      "Most users think Shorts x 2 too cold should’ve done sweats lol Pants x 2 for everyday Sweatshirt for everyday 3 in 1 north face jacket Quechua 10l Day bag (lies flat in the laptop compartment) Sanuks Nike running shoes",
      "Most users think Quechua 10l Day bag (lies flat in the laptop compartment) Sanuks Nike running shoes 5 pairs of underwear and socks 1 pair of long Johns (thermal underwear) A hat and a winter hat Other stuff: Phone + cha",
      "Most users think With all the high-end bags that get promoted on this sub"
    ],
    "sentiment": 9,
    "num_mentions": 520
  },
  "DSPTCH Ruckpack": {
    "name": "DSPTCH Ruckpack",
    "pros": [
      "Most users think It’s useable. (But I like the CPL24 V2 vertical pocket organisation more) - The laptop compartment fits M1 MacBook Pro 16in Very tightly, to the extent that I would start to worry about the zippers scra",
      "Most users think It’s good to have. -DSPTCH is Made in USA. Very wel",
      "Most users think Foam backing for sweat and structure. Cons: not"
    ],
    "cons": [
      "Most users think I noticed that this edition doesn’t get the sort of love that the predecessor used to get with",
      "Most users think At the moment, it's on sale for 39 u",
      "Most users think Sent it in and it was fixed without any issues. 2 weeks total. Their wa"
    ],
    "sentiment": 8.5,
    "num_mentions": 450
  },
  "Eagle Creek Global Companion 40L": {
    "name": "Eagle Creek Global Companion 40L",
    "pros": [
      "Most users think The Forclaz pocket on",
      "Most users think Great value and great quality",
      "Most users think They are affordable and"
    ],
    "cons": [
      "Most users think The Forclaz does not have either feature. Verdic",
      "Most users think Verdict: DRAW 8. External pockets: The Allpa has a water bottle holder, but it does feel quite tight, and I’m not sure how much do space there would be when the bag is completely full. The Forclaz ha",
      "Most users think Can confirm it’s on the back - whether it’s protected or not is a different question as someone above has noted it’s not a suspended pocket (must admit I wasn’"
    ],
    "sentiment": 12.9,
    "num_mentions": 136
  },
  "Eagle Creek Tour Travel Pack 40L": {
    "name": "Eagle Creek Tour Travel Pack 40L",
    "pros": [
      "Most users think As for a daypack, I h",
      "Most users think If the Osprey is more",
      "Most users think That being said, there are a few places you could cut"
    ],
    "cons": [
      "Most users think Rk) - AirTag ### Clothing - Longsleeves: 2x - Blouses: 2x - Sweaters: 1x - Jeans: 1x (in winter, I wear jeans almost exclusively) - Head band, gloves (depends on weather forecast) - Sets of undies and so",
      "Most users think The extra sweater too because unnecessary",
      "Most users think I guess I agree, although I will not primarily use the iPad for e"
    ],
    "sentiment": 9.6,
    "num_mentions": 248
  },
  "Eastpak Out Of Office": {
    "name": "Eastpak Out Of Office",
    "pros": [
      "Most users think 2 days - MAX +10°C (*50°F*) on 2 days - most of the time around -10°C (*14°F*) **Route:** - Day trains to Berlin, night train to Stockholm, spending the day there - Night train going North to Luleå (1",
      "Most users think I had my eyes on the Evergoods MPH22 for a long t",
      "Most users think But honestly, I am very happy with my choice. It was 55 €. It has a simple"
    ],
    "cons": [
      "Most users think Te:** - Day trains to Berlin, night train to Stockholm, spending the day there - Night train going North to Luleå (1 day/1 night there) - Train to Haparanda at the border, walking to Tornio in Finland",
      "Most users think But honestly, I am very hap",
      "Most users think Will *really* check next time. I also took it becaus"
    ],
    "sentiment": 7.3,
    "num_mentions": 500
  },
  "Eastpak Padded Pak'r": {
    "name": "Eastpak Padded Pak'r",
    "pros": [
      "Most users think 2 days - MAX +10°C (*50°F*) on 2 days - most of the time around -10°C (*14°F*) **Route:** - Day trains to Berlin, night train to Stockholm, spending the day there - Night train going North to Luleå (1",
      "Most users think I had my eyes on the Evergoods MPH22 for a long t",
      "Most users think But honestly, I am very happy with my choice. It was 55 €. It has a simple"
    ],
    "cons": [
      "Most users think Te:** - Day trains to Berlin, night train to Stockholm, spending the day there - Night train going North to Luleå (1 day/1 night there) - Train to Haparanda at the border, walking to Tornio in Finland",
      "Most users think N’t seen pics for a leopard print small cloud carry on (only the green juice and snakeskin), but I SWEAR Baggu must be releasing it in this colorway otherwise they’re idiots",
      "Most users think I purchased it to use f"
    ],
    "sentiment": 6.2,
    "num_mentions": 881
  },
  "eBags Professional Weekender": {
    "name": "eBags Professional Weekender",
    "pros": [
      "Most users think I’m now planning an 18-month round-th",
      "Most users think I bought an Osprey 70L (55+15) bag in 2016 thinking all backpacks were created equal. Of c",
      "Most users think I think my Osprey bag is a *little* bit more comforta"
    ],
    "cons": [
      "Most users think After looking at Copaxi and Nomadic and Osprey etc and withering under",
      "Most users think I’m not usually one to post online reviews, but there aren’t *any* interior photos of this pack online, so",
      "Most users think Shorts x 2 too cold should’ve done sweats lol Pants x 2 for everyday Sweatshirt for everyday 3 in 1 north face jacket Quechua 10l Day bag (lies flat in the laptop compartment) Sanuks Nike running shoes"
    ],
    "sentiment": 11.4,
    "num_mentions": 585
  },
  "eBags TLS Mother Lode Weekender": {
    "name": "eBags TLS Mother Lode Weekender",
    "pros": [
      "Most users think BLUF: Gorgeous and super comfortable laptop bag with a couple design fl",
      "Most users think Holds larger pouches and any size water bottle I’",
      "Most users think I added a vinyl bumper to the bottom of the laptop bag, and a sternum strap. The stash pocke"
    ],
    "cons": [
      "Most users think Airflow - Buckles and zippers are a mix of Satin aluminum S buckles, heat shrink zipper pulls but not waterproof - Quick access pouch is soft and padded but could be bigger - 2 Water bottle pocket",
      "Most users think Cheap and 45L (probably more but airlines have never questioned me) and while I know it's not the",
      "Most users think The good and the bad, but d"
    ],
    "sentiment": 8.2,
    "num_mentions": 142
  },
  "Evergoods CHZ22": {
    "name": "Evergoods CHZ22",
    "pros": [
      "Most users think Fits plenty for my usual EDC needs, and I agree that, even unpacked, it lo",
      "Most users think I sold them because o",
      "Most users think I reached out to the seller offered to pay what I sold it for and got the bag that I had fallen in love with back in the day back…and now I can’t carry any other bag, I had a sizeable collection which in"
    ],
    "cons": [
      "Most users think I did sell my CHZ22 back in September and to my surprise saw it back on sale at an inflated price (no shade it’s sold out everywhere) from that buyer in December, I reached out to the seller offered to",
      "Most users think This led to me buying t",
      "Most users think And had secluded myself to the briefcase life, even through commutes it served me well, the TB20 is no joke but I needed a backpack that was less nicer than my CPL24 Phoenix 1 and more “leaner” than my"
    ],
    "sentiment": 8.6,
    "num_mentions": 263
  },
  "Evergoods CHZ26": {
    "name": "Evergoods CHZ26",
    "pros": [
      "Most users think But I must say that the CHZ",
      "Most users think Yes it’s great that it’s beyond my expectation~~",
      "Most users think Would love a CHZ with luggage pass through"
    ],
    "cons": [
      "Most users think The GR1 without MOLLE is such a good, classic looking bag",
      "Most users think It is not too faint or too bright. No complain here, really",
      "Most users think I going to call it a blue cheeze from now on. Beautiful bag"
    ],
    "sentiment": 7.4,
    "num_mentions": 42
  },
  "Evergoods CIVIC Travel Bag 35L": {
    "name": "Evergoods CIVIC Travel Bag 35L",
    "pros": [
      "Most users think Ctb26 layout is great especially when coupled with a few cap1 and 2s. I'd rather have my cab",
      "Most users think The straps on the travel pack are significant",
      "Most users think How did you like the mat"
    ],
    "cons": [
      "Most users think I have to admit that waxed canvas is beautiful, but not pleasant to manipulate: it's a bit hard to easily open the main zipper (maybe mine is not broken-i",
      "Most users think It's stiff, I can't open it in one good quick motion. I'm looking forward to ge",
      "Most users think I'm attempting a one bag travel sy"
    ],
    "sentiment": 7.9,
    "num_mentions": 355
  },
  "Evergoods CPL24": {
    "name": "Evergoods CPL24",
    "pros": [
      "Most users think I couldn't fit it anything else. * The CPL24",
      "Most users think It worked out great, but I missed my bigger camera. * I've travel a few times with t",
      "Most users think CTB26 vs CPL24 Capacity Comparison"
    ],
    "cons": [
      "Most users think For context, I only brought the CPL24 on the",
      "Most users think CPL24 feels closer to like 16L in the main compartment",
      "Most users think My 20L Whitley feels cavernous in comparison. CTB26 I feel is true to ca"
    ],
    "sentiment": 8.1,
    "num_mentions": 755
  },
  "Fjällräven Kånken 17": {
    "name": "Fjällräven Kånken 17",
    "pros": [
      "Most users think Now for the measurements. My 15.6 inch l",
      "Most users think After travel around with my Thule ba",
      "Most users think I carry too much precious cargo (laptop"
    ],
    "cons": [
      "Most users think I've scoured the Fjallraven sub and only came across 1",
      "Most users think When I bought my Kanken, I also picked up the Tree-Kanken Pocket",
      "Most users think There aren't a lot of laptop kånken fakes. but these stitches are weird, I've used my old backpack (not a kånken) for ~6/7 years and I've never seen that. do you know if that's normal"
    ],
    "sentiment": 6.6,
    "num_mentions": 457
  },
  "Fjällräven Kånken 17L": {
    "name": "Fjällräven Kånken 17L",
    "pros": [
      "Most users think Now for the measurements. My 15.6 inch l",
      "Most users think While it’s technically a cycling bag, I t",
      "Most users think I do have a packable down puffer, do you thin"
    ],
    "cons": [
      "Most users think I've scoured the Fjallraven sub and only came across 1",
      "Most users think When I bought my Kanken, I also picked up the Tree-Kanken Pocket",
      "Most users think There aren't a lot of laptop kånken fakes. but these stitches are weird, I've used my old backpack (not a kånken) for ~6/7 years and I've never seen that. do you know if that's normal"
    ],
    "sentiment": 6.8,
    "num_mentions": 672
  },
  "Fjällräven Kånken 20": {
    "name": "Fjällräven Kånken 20",
    "pros": [
      "Most users think Fjallraven’s G-1000 waxed canvas might not be as durable as something like Cordura",
      "Most users think Fjallraven’s G-1000 waxed canvas might not be as d",
      "Most users think Here's my review, hope it may be useful to som"
    ],
    "cons": [
      "Most users think Fjallraven’s G-1000 waxed canvas might not be as durable as",
      "Most users think I plan to switch to some paracord pulls one day",
      "Most users think Compared to the other bags"
    ],
    "sentiment": 10.5,
    "num_mentions": 373
  },
  "Fjällräven Raven 28": {
    "name": "Fjällräven Raven 28",
    "pros": [
      "Most users think Fjallraven’s G-1000 waxed canvas might not be as durable as something like Cordura",
      "Most users think Fjallraven’s G-1000 waxed canvas might not be as d",
      "Most users think Here's my review, hope it may be useful to som"
    ],
    "cons": [
      "Most users think Fjallraven’s G-1000 waxed canvas might not be as durable as",
      "Most users think I plan to switch to some paracord pulls one day",
      "Most users think Compared to the other bags"
    ],
    "sentiment": 10.5,
    "num_mentions": 282
  },
  "Goruck GR1 21L": {
    "name": "Goruck GR1 21L",
    "pros": [
      "Most users think Tacticool market forces I guess! I've often wondered wh",
      "Most users think Materials and quality: The GR1 is all 1000D Cordura, with the exception of the 210D",
      "Most users think Until I had a bottle leak in a backpack, destroying my laptop in the process. That was a"
    ],
    "cons": [
      "Most users think While not the lightest bag at its price point its noticeably lighter then most bags its size",
      "Most users think To keep things on-topic, I hate dyneema. I hate that it's rigid, sou",
      "Most users think However overall, if it's for E"
    ],
    "sentiment": 8.5,
    "num_mentions": 436
  },
  "Goruck GR1 26L": {
    "name": "Goruck GR1 26L",
    "pros": [
      "Most users think Materials and quality: The GR1 is all 1000D Cordura, with the exception of the 210D",
      "Most users think Impressed with the quality of the patch and with the",
      "Most users think It’ll do while I send my"
    ],
    "cons": [
      "Most users think This actually feels quite cheap and looks very shiny. It's also slippery",
      "Most users think I do not need another GR1",
      "Most users think Cordura rucks can be packed out all day, everyday and laugh and keep going. It’s not gonna rip. Wa"
    ],
    "sentiment": 7.7,
    "num_mentions": 199
  },
  "Goruck GR2 40L": {
    "name": "Goruck GR2 40L",
    "pros": [
      "Most users think It’s basically $210 less than a GR2 40L. I",
      "Most users think Work anymore and for my leisure travel I just bring an iPad now so that can go in one of the other pockets or in my personal item sling",
      "Most users think Expensive to be sure but I"
    ],
    "cons": [
      "Most users think It’s one of the worst looking/placed logo",
      "Most users think Expensive to be sure but I needed the laptop compartment on the back. I love my R",
      "Most users think They might cut you a bro deal, but y"
    ],
    "sentiment": 6.6,
    "num_mentions": 260
  },
  "Gravel Explorer Mini": {
    "name": "Gravel Explorer Mini",
    "pros": [
      "Most users think A ziplock bag, i'd want some thoughtful materials and org * easy to clean: i'm a messy person, but love a clean bag * accessibility: how easy is it to get to my ish * fun factor: as a manybagger, that's",
      "Most users think Over the years I have found it best to keep all my hair products (be",
      "Most users think The contents of these bags vary slightly depending on trip type, b"
    ],
    "cons": [
      "Most users think Mind you, I've only trav",
      "Most users think First impressions: The scales are awful. Cheap plastic t",
      "Most users think Honest non-technical review and comparison of Ozark Trail D2 folder Picked two of these up while traveling"
    ],
    "sentiment": 10.1,
    "num_mentions": 380
  },
  "Gravel Explorer Plus": {
    "name": "Gravel Explorer Plus",
    "pros": [
      "Most users think A ziplock bag, i'd want some thoughtful materials and org * easy to clean: i'm a messy person, but love a clean bag * accessibility: how easy is it to get to my ish * fun factor: as a manybagger, that's",
      "Most users think Over the years I have found it best to keep all my hair products (be",
      "Most users think I get what you're saying and the price of quality, entry-level enthusiast bikes has gone through the roof, but there's still a need for decent, cheap"
    ],
    "cons": [
      "Most users think Mind you, I've only trav",
      "Most users think We saw no cars for about a day and a half. There were four river crossings, which were knee",
      "Most users think How it held the bag together while open. but each pocket didnt really feel as useful: smaller ones too small, big ones not big enough? and maybe it needed breaking in, but it wouldnt quite open as i'd like, n"
    ],
    "sentiment": 10.5,
    "num_mentions": 551
  },
  "Greenroom136 Rainmaker": {
    "name": "Greenroom136 Rainmaker",
    "pros": [
      "Most users think Greenroom136's great build quality works very much so for their slings",
      "Most users think The straps and back cushion",
      "Most users think The big representatives on the \"light\" half of the equation for me rn are bags"
    ],
    "cons": [
      "Most users think First things first, I do not recommend the CT Small Po",
      "Most users think I think the bag will work for someone who doesn't mind the extra weight or is just f",
      "Most users think The bag is heavy as fuck haha but it wears comfortable"
    ],
    "sentiment": 9.2,
    "num_mentions": 405
  },
  "Gregory Border 25": {
    "name": "Gregory Border 25",
    "pros": [
      "Most users think Ly think most people would require warmer clothes if they lived the same experience. * 🌧️ **It was raining or drizzling** 40-60% of the time and I didn't pack any rain accessory - I was definitely fine",
      "Most users think Sing Sun_ - _**JAPAN!**_ This was my 3rd time there and as with the other 2 trips it was absolutely amazing and memorable. #| **THE LOGISTICS** I spent 4.5 weeks with an 18L backpack as a T1D and with some",
      "Most users think I could comfortably sit at my airplane seat with both bags around my waist. &amp;nbsp; The"
    ],
    "cons": [
      "Most users think ___ ^(⚠️ Formatting is partially broken on SH.Reddit but fine on NEW.Reddit and OLD.Reddit - so annoying, I put a lot of effort in this submission!) Hello fellow OneBaggers - I recently came back fr",
      "Most users think 18L** Backpack │ ✈️ **Japan** │ 📆 **March** 1st - **April** 2nd ___ ^(⚠️ Formatting is partially broken on SH.Reddit but fine on NEW.Reddit and OLD.Reddit - so annoying, I put a lot of effort in this su",
      "Most users think You only need about half the bottoms as"
    ],
    "sentiment": 16.6,
    "num_mentions": 189
  },
  "Gregory Border 35": {
    "name": "Gregory Border 35",
    "pros": [
      "Most users think Ly think most people would require warmer clothes if they lived the same experience. * 🌧️ **It was raining or drizzling** 40-60% of the time and I didn't pack any rain accessory - I was definitely fine",
      "Most users think Sing Sun_ - _**JAPAN!**_ This was my 3rd time there and as with the other 2 trips it was absolutely amazing and memorable. #| **THE LOGISTICS** I spent 4.5 weeks with an 18L backpack as a T1D and with some",
      "Most users think I could comfortably sit at my airplane seat with both bags around my waist. &amp;nbsp; The"
    ],
    "cons": [
      "Most users think ___ ^(⚠️ Formatting is partially broken on SH.Reddit but fine on NEW.Reddit and OLD.Reddit - so annoying, I put a lot of effort in this submission!) Hello fellow OneBaggers - I recently came back fr",
      "Most users think 18L** Backpack │ ✈️ **Japan** │ 📆 **March** 1st - **April** 2nd ___ ^(⚠️ Formatting is partially broken on SH.Reddit but fine on NEW.Reddit and OLD.Reddit - so annoying, I put a lot of effort in this su",
      "Most users think It is also quite noticeable smaller despite a ''simple'' 6L difference - my profi"
    ],
    "sentiment": 13.8,
    "num_mentions": 745
  },
  "Gregory Nano 22": {
    "name": "Gregory Nano 22",
    "pros": [
      "Most users think I'm really please with the quality. This is my first",
      "Most users think The MPL was very comfortable, and I’m a big fan of the vented back panel (this i",
      "Most users think Regarding the capacity, I usually like around 25L on my EDC bags but I was intereste"
    ],
    "cons": [
      "Most users think I just returned from a beach vacation which had",
      "Most users think So after searching for another chest bag to be my 0.5 bag when traveling and carrying I found the Gregory Nano shoulder bag",
      "Most users think I've cycled with it, taken it"
    ],
    "sentiment": 10.3,
    "num_mentions": 423
  },
  "Haglöfs Tight Pro Large": {
    "name": "Haglöfs Tight Pro Large",
    "pros": [
      "Most users think I once said the Rush LT was Arcteryx’s most perfect hard shell (https://www.reddit.com/r/arcteryx/comments/11d0rbd/from_the_arcteryx_archives_rust_lt_t",
      "Most users think For those enamored with the ab",
      "Most users think That looks fantastic, I’m looking forward to your updates after taking it out skiing"
    ],
    "cons": [
      "Most users think However the Rush LT used Cohaesive which pulled up into the jacket. Bummer, but only slightly. L",
      "Most users think Even with a neck gaiter, there was n tightness around the trac",
      "Most users think By the 1) much shorter tongue which made it extremely hard to tuck the laces strap into and 2) the pain in my toe box that I was getting with every step due to the crease spot of the shoe when I took ste"
    ],
    "sentiment": 8.4,
    "num_mentions": 192
  },
  "Haglöfs Vide Medium": {
    "name": "Haglöfs Vide Medium",
    "pros": [
      "Most users think I immediately jumped to order that [Houdini](https://eu.patagonia.com/fr/fr/product/mens-houdini-",
      "Most users think It has no side pockets! Which honestly is a deal breaker for me ; whether it's for p",
      "Most users think I'm sure it's great if you're wearing a helmet for instance, but without, not the bes"
    ],
    "cons": [
      "Most users think I'll usually wear a coat during my travel, but I'd like to have an op",
      "Most users think A shame, because it is an incredible piece. A bit",
      "Most users think Look for gear designed for bike commuting and adventure riding"
    ],
    "sentiment": 8.9,
    "num_mentions": 94
  },
  "Heimplanet Monolith Daypack": {
    "name": "Heimplanet Monolith Daypack",
    "pros": [
      "Most users think At 5’8 with a not so sho",
      "Most users think It's a bit of a long read. D",
      "Most users think Doing some cleaning and pulled everything out of the closet and"
    ],
    "cons": [
      "Most users think Don't say I didn't warn y",
      "Most users think I never measured, i sold my new 25L Rucker because it felt so much longer than all of my GR1s. (I know that's anecdotal and without data, but wanted to share the experience nonetheless.)",
      "Most users think At 5’8 with a not so short torso, there are times I wished the 21L was slightly lon"
    ],
    "sentiment": 6.3,
    "num_mentions": 117
  },
  "Heimplanet Transit Line Travel Pack": {
    "name": "Heimplanet Transit Line Travel Pack",
    "pros": [
      "Most users think Heimplanet went an extra mile to creat",
      "Most users think X200B; &amp;#x200B; **WHO IT SUITS** &amp;#x200B; * Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of t",
      "Most users think Internal organization features a nicely padded and suspend"
    ],
    "cons": [
      "Most users think Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant pro",
      "Most users think -34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review) Let me know if you have any questions! &amp;#x200B; **FOREWORD** &amp;#x200B; Based in Hamburg, Germany, H",
      "Most users think What is the function of the"
    ],
    "sentiment": 14,
    "num_mentions": 271
  },
  "Herschel Little America": {
    "name": "Herschel Little America",
    "pros": [
      "Most users think Features: -Custom striped fabric liner. -Padded and fl",
      "Most users think Hasn't been used yet to knowledge",
      "Most users think Everything went through smoothly, just get the right size and weight"
    ],
    "cons": [
      "Most users think Hasn't been used yet to knowledge but was most likely gifted to a family m",
      "Most users think Is this bag fake or not? please help",
      "Most users think Got it at Nordstrom Rack for $20 less th"
    ],
    "sentiment": 6.4,
    "num_mentions": 175
  },
  "Herschel Settlement": {
    "name": "Herschel Settlement",
    "pros": [
      "Most users think Doubt it, Herschel isn’t known to have durable products",
      "Most users think Feels really solid and I think it would last. Even has a sternum strap that’s removabl",
      "Most users think It’s a very basic bookbag with only two pockets, no laptop"
    ],
    "cons": [
      "Most users think It’s a very basic bookbag with only two pockets",
      "Most users think Both used everyday for 6 years. Often overloaded",
      "Most users think Doubt it, Herschel isn’t known to have durable products"
    ],
    "sentiment": 6.7,
    "num_mentions": 153
  },
  "Incase EO Travel Backpack": {
    "name": "Incase EO Travel Backpack",
    "pros": [
      "Most users think My main complaint from the CPP was the tiny water bottle pocket",
      "Most users think I dunno, my brain craves the 50/50 split. -New top stash pocket implementation looks",
      "Most users think Looks like the key changes"
    ],
    "cons": [
      "Most users think Looks like the key changes are: * non-hooped hyperlon zipper pul",
      "Most users think Airline I'm flying has a 10kg limit. I know where I could",
      "Most users think I'll also add that a quick access pocket is now not a flappy envelope lying flat in the main compartment, but more of a 3D area connected to the t"
    ],
    "sentiment": 8,
    "num_mentions": 203
  },
  "Incase Icon Backpack": {
    "name": "Incase Icon Backpack",
    "pros": [
      "Most users think Comfort: Aer wins. The Alpaka straps are thin, but wide, resulting in a comfortable carry. The",
      "Most users think My main complaint from the CPP was the tiny water bottle pocket",
      "Most users think * Most impressed with the overall innovation of the design - it’s different yet works quite well! * Least impressed"
    ],
    "cons": [
      "Most users think Despite the difference in claimed volume (14L vs 26L), they’re very close in size a",
      "Most users think Looks like the key changes are: * non-hooped hyperlon zipper pul",
      "Most users think The material deforms to move out of the way, though. I wish Aer wou"
    ],
    "sentiment": 8.4,
    "num_mentions": 692
  },
  "Jack Wolfskin Berkeley": {
    "name": "Jack Wolfskin Berkeley",
    "pros": [
      "Most users think The comfort especially under load is amazing. Just takes a bit of",
      "Most users think I feel like the Thule has to be higher quality since it's m",
      "Most users think Any programmers on mfa can give me a reco"
    ],
    "cons": [
      "Most users think Without further ado, the links to the",
      "Most users think I wear fleeces quite a bit and I've noticed that when I'm carrying a bit more weight, I'm wearing glasses",
      "Most users think Title isn't supposed to be s"
    ],
    "sentiment": 7.1,
    "num_mentions": 101
  },
  "Jack Wolfskin TRT 32 Pack": {
    "name": "Jack Wolfskin TRT 32 Pack",
    "pros": [
      "Most users think I love the organization of the Blitz 30 but I mostly",
      "Most users think Always as carry on. It’s great",
      "Most users think Some people swear by their quality, others have issues with wear and te"
    ],
    "cons": [
      "Most users think Some people swear by their quality, others have issues with wear and tear though. Rea",
      "Most users think I've had it for 3 or 4 years now of dai",
      "Most users think Not a single fray anywhere. It’s indestructible and"
    ],
    "sentiment": 6.2,
    "num_mentions": 29
  },
  "JanSport Right Pack": {
    "name": "JanSport Right Pack",
    "pros": [
      "Most users think These side pockets are deep and easily swallow a wide Na",
      "Most users think I think we can all agree. Everything is",
      "Most users think Its very clean and functional wit"
    ],
    "cons": [
      "Most users think Also the backpack she’s wearing has definitely taken some wear and tear and",
      "Most users think It was for a now defunct blog, hence the length. [Pics album her",
      "Most users think And I’m saying that based off of the set up p"
    ],
    "sentiment": 6.8,
    "num_mentions": 246
  },
  "JanSport SuperBreak": {
    "name": "JanSport SuperBreak",
    "pros": [
      "Most users think I think we can all agree. Everything is",
      "Most users think Help with Finding Wholesale Logoless Durable Black Backpacks similar to Jansport Quality",
      "Most users think Factors like lighting, camera filters, or post-production effects are all elements tha"
    ],
    "cons": [
      "Most users think Also the backpack she’s wearing has definitely taken some wear and tear and",
      "Most users think And I’m saying that based off of the set up p",
      "Most users think Boy do I have some bad news"
    ],
    "sentiment": 6.6,
    "num_mentions": 242
  },
  "Kelty Asher 25": {
    "name": "Kelty Asher 25",
    "pros": [
      "Most users think The stratos has that gorgeous frame, and carries weight b",
      "Most users think The ventilation at the back is grea",
      "Most users think It's a great size for winter packs. For summer, I have a 32L"
    ],
    "cons": [
      "Most users think Alden Indy Boots – 40X (I’m not sure of the exact model) &amp;#x200B; In case the images that uploaded with the post didn't mak",
      "Most users think After 3 weeks of wearing it for hours and miles every day, I knew I had a problem. I hobb",
      "Most users think I just sent in a 15 year old"
    ],
    "sentiment": 7.5,
    "num_mentions": 200
  },
  "Kelty Asher 35": {
    "name": "Kelty Asher 35",
    "pros": [
      "Most users think I have some quality kelty stuff but for the most part it's middle of",
      "Most users think Wish I still lived nearby",
      "Most users think The stratos has that gorgeous frame, and carries weight b"
    ],
    "cons": [
      "Most users think I have a few kelty things that were cheap $ wise but have held",
      "Most users think Alden Indy Boots – 40X (I’m not sure of the exact model) &amp;#x200B; In case the images that uploaded with the post didn't mak",
      "Most users think Also it feels real like the material isn’t cheap"
    ],
    "sentiment": 6.4,
    "num_mentions": 345
  },
  "Kelty Asher 45": {
    "name": "Kelty Asher 45",
    "pros": [
      "Most users think The ventilation at the back is grea",
      "Most users think It's a great size for winter packs. For summer, I have a 32L",
      "Most users think At the time, my budget was very limited so I"
    ],
    "cons": [
      "Most users think Alden Indy Boots – 40X (I’m not sure of the exact model) &amp;#x200B; In case the images that uploaded with the post didn't mak",
      "Most users think I know what they said was very blunt, the sizing channel",
      "Most users think Currently I can get the MR 2DAP which comes in at 27 liters of space for $150 usd, and t"
    ],
    "sentiment": 7.7,
    "num_mentions": 138
  },
  "Kelty Asher 55": {
    "name": "Kelty Asher 55",
    "pros": [
      "Most users think I have some quality kelty stuff but for the most part it's middle of",
      "Most users think The ventilation at the back is grea",
      "Most users think It's a great size for winter packs. For summer, I have a 32L"
    ],
    "cons": [
      "Most users think I have a few kelty things that were cheap $ wise but have held",
      "Most users think After 3 weeks of wearing it for hours and miles every day, I knew I had a problem. I hobb",
      "Most users think Also it feels real like the material isn’t cheap"
    ],
    "sentiment": 6.2,
    "num_mentions": 193
  },
  "Kelty Asher 65": {
    "name": "Kelty Asher 65",
    "pros": [
      "Most users think The ventilation at the back is grea",
      "Most users think It's a great size for winter packs. For summer, I have a 32L",
      "Most users think For summer, I have a 32L Bi"
    ],
    "cons": [
      "Most users think After 3 weeks of wearing it for hours and miles every day, I knew I had a problem. I hobb",
      "Most users think I just sent in a 15 year old",
      "Most users think Obbled into the Bluff Mountain Outfitters in Hot Springs and the owner looked at me and said, “dude no wonder you’re limping, that pack is way too tall for you!” I had no idea what me meant, I never h"
    ],
    "sentiment": 7,
    "num_mentions": 171
  },
  "Kelty Redwing 32": {
    "name": "Kelty Redwing 32",
    "pros": [
      "Most users think Lets consider both to be main compartments since I need to open their",
      "Most users think It was advertised at 40 liters but the capacity is comically",
      "Most users think They basically told me I’m a clueless moron so I went to the store and put their fully loaded dis"
    ],
    "cons": [
      "Most users think I still like to pack light anyway. I know I can trim bits and",
      "Most users think So, weight listed includes the bag, bu",
      "Most users think Getting the family ready for a one bag trip and I’v"
    ],
    "sentiment": 7.8,
    "num_mentions": 248
  },
  "Kelty Redwing 44": {
    "name": "Kelty Redwing 44",
    "pros": [
      "Most users think Great bag that fits my super chunky 17\" work laptop. Black/top",
      "Most users think Kelty Redwing 44L $65: 41 oz, very good condition, some wear around where hip belt meet",
      "Most users think Also, I had a lot more r"
    ],
    "cons": [
      "Most users think Marmot Kompressor Summit $50:",
      "Most users think I really wanted to like thi",
      "Most users think Your flair will update once your p"
    ],
    "sentiment": 9.5,
    "num_mentions": 394
  },
  "Lems Daypack": {
    "name": "Lems Daypack",
    "pros": [
      "Most users think Know this wasn't an extensive trip, but the variety of settings and amount of travel time (5 total flight incl. connections, plus many hours on the road) meant that I set out to be extra considerate in wha",
      "Most users think Happy to hear any thoughts or recommendations, and hope you enjoy! **Bag -** ***REI Ruckpack 28 (c",
      "Most users think R or nomad or ultra-minimalist by any means, but have enjoyed the pursuit of one-bag travel in some capacity for almost 2 decades, from short trips as a teenager with only a schoolbag to several multi-week tr"
    ],
    "cons": [
      "Most users think The following is my packing list with some notes on most",
      "Most users think There's room to improve fo",
      "Most users think In bag if needed) - Black Jeans - Belt -Dakine clamp closure - Compression Socks - T Shirt - Underwear - Xero shoes - Daylite Hikers - Google Pixel 7 - rubber band wallet with ID, 1 credit card, small a"
    ],
    "sentiment": 13,
    "num_mentions": 703
  },
  "Lems Travel Pack": {
    "name": "Lems Travel Pack",
    "pros": [
      "Most users think Know this wasn't an extensive trip, but the variety of settings and amount of travel time (5 total flight incl. connections, plus many hours on the road) meant that I set out to be extra considerate in wha",
      "Most users think Happy to hear any thoughts or recommendations, and hope you enjoy! **Bag -** ***REI Ruckpack 28 (c",
      "Most users think R or nomad or ultra-minimalist by any means, but have enjoyed the pursuit of one-bag travel in some capacity for almost 2 decades, from short trips as a teenager with only a schoolbag to several multi-week tr"
    ],
    "cons": [
      "Most users think The following is my packing list with some notes on most",
      "Most users think There's room to improve fo",
      "Most users think In bag if needed) - Black Jeans - Belt -Dakine clamp closure - Compression Socks - T Shirt - Underwear - Xero shoes - Daylite Hikers - Google Pixel 7 - rubber band wallet with ID, 1 credit card, small a"
    ],
    "sentiment": 12.3,
    "num_mentions": 665
  },
  "Lowe Alpine AirZone Pro 30": {
    "name": "Lowe Alpine AirZone Pro 30",
    "pros": [
      "Most users think Only used twice, great quality build bu",
      "Most users think Only used twice, great qualit",
      "Most users think Them and feel the same way about it; it's a brilliant pack and I find the Airzone system much more comfortable than the Ospreys I've owned"
    ],
    "cons": [
      "Most users think Used twice. Used condition, d",
      "Most users think [WTS] Lowe Alpine Camino Trek 40:50, $130 shipped",
      "Most users think Only used twice, great quality build bu"
    ],
    "sentiment": 7.3,
    "num_mentions": 142
  },
  "Lowe Alpine AirZone Trail 35": {
    "name": "Lowe Alpine AirZone Trail 35",
    "pros": [
      "Most users think Thing is an absolute beast. Very comfortable (even though",
      "Most users think The smaller lowe alpine ones, yeah that was my friends main point that they have always been proper quality stuff 👍",
      "Most users think Been great. Lowe Alpine is one of those brands, even before RAB bought them out which is relia"
    ],
    "cons": [
      "Most users think Fifth Amendment No person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment",
      "Most users think Some people swear by Osprey, but each to their own"
    ],
    "sentiment": 6.8,
    "num_mentions": 22
  },
  "Mammut Seon Courier": {
    "name": "Mammut Seon Courier",
    "pros": [
      "Most users think Very different but both great bags at wha",
      "Most users think Getting the max edc a",
      "Most users think I hope they phase out aq"
    ],
    "cons": [
      "Most users think Very different but bo",
      "Most users think Hadn't expected the CPP2 to come out in the middle of my",
      "Most users think Not sagging, squished...it had come out of the packing box a minute or two before"
    ],
    "sentiment": 6.9,
    "num_mentions": 222
  },
  "Mammut Xeron Flip 22": {
    "name": "Mammut Xeron Flip 22",
    "pros": [],
    "cons": [],
    "sentiment": 5,
    "num_mentions": 0
  },
  "Matador Beast28": {
    "name": "Matador Beast28",
    "pros": [
      "Most users think Recently we traveled through Mexico for 3+ months with our Osprey Fairviews (also 3 months in Euro",
      "Most users think Does that happen to be the [northface rain hoodie?](https://www.thenorthface.com/en-us/womens/womens-jackets-and-vests/womens-rainwear-c299273",
      "Most users think Leeping x 1 Leggings x 1 (donate after colder months) Sweatshirt x (donate after colder months) Rain Jacket x 1 UNDERGARMENTS: Underwear x 7 Workout socks x2 Wool socks x 1 (possibly donate after"
    ],
    "cons": [
      "Most users think T/womens-baggies-shorts-5-inch/57059.html?dwvar_57059_color=BLK) \\- Best shorts ever that I plan on wearing every day. * [Ridge Merino t-shirt](https://www.ridgemerino.com/products/womens-alpine-merino-wo",
      "Most users think They are unfortunately not sold anymore :( * [5” Patagonia Baggies](https:/",
      "Most users think Not sold anymore. * AirPods (first generation) * Packed in black pencil case from Muji Toiletries"
    ],
    "sentiment": 10.9,
    "num_mentions": 449
  },
  "Matador Beast28 Technical Pack": {
    "name": "Matador Beast28 Technical Pack",
    "pros": [
      "Most users think Recently we traveled through Mexico for 3+ months with our Osprey Fairviews (also 3 months in Euro",
      "Most users think Does that happen to be the [northface rain hoodie?](https://www.thenorthface.com/en-us/womens/womens-jackets-and-vests/womens-rainwear-c299273",
      "Most users think Leeping x 1 Leggings x 1 (donate after colder months) Sweatshirt x (donate after colder months) Rain Jacket x 1 UNDERGARMENTS: Underwear x 7 Workout socks x2 Wool socks x 1 (possibly donate after"
    ],
    "cons": [
      "Most users think T/womens-baggies-shorts-5-inch/57059.html?dwvar_57059_color=BLK) \\- Best shorts ever that I plan on wearing every day. * [Ridge Merino t-shirt](https://www.ridgemerino.com/products/womens-alpine-merino-wo",
      "Most users think They are unfortunately not sold anymore :( * [5” Patagonia Baggies](https:/",
      "Most users think Not sold anymore. * AirPods (first generation) * Packed in black pencil case from Muji Toiletries"
    ],
    "sentiment": 10.8,
    "num_mentions": 577
  },
  "Matador Freerain 24": {
    "name": "Matador Freerain 24",
    "pros": [
      "Most users think Pter of my travels. ***Context***: I returned from 6 months in Latin America using a Matador free rain 22- it was outstanding when needed, however I didn't use it much over the 6 months and have been se",
      "Most users think Hin the** ***personal item*** **allowance** (especially strict ones like Ryanair’s 40x20x25cm). # Flights: I'll be flying with: * **Ryanair** (strictest: 40x20x25 cm) * EasyJet (45x20x36) * Aegean (56x2",
      "Most users think Er I didn't use it much over the 6 months and have been seeking a bag that fits these criteria: \\-Comfortable \\-Packable (smaller than the Free rain- bonus if it packs in its on pocket w/o needing an external"
    ],
    "cons": [
      "Most users think The sling is surprisingly big. That's par",
      "Most users think It technically \"worked\", but it was uncomfortable to carry long",
      "Most users think Cked):** hiking pants, sweatpants, t-shirts (x2), dry-fit tee, long sleeve sweatshirt, shorts, underwear (x7), gloves, beanie, sandals, sneakers, extra socks (x2), heattech shirt &amp; pants * **Electroni"
    ],
    "sentiment": 8.3,
    "num_mentions": 310
  },
  "Matador Freerain 32": {
    "name": "Matador Freerain 32",
    "pros": [
      "Most users think Pter of my travels. ***Context***: I returned from 6 months in Latin America using a Matador free rain 22- it was outstanding when needed, however I didn't use it much over the 6 months and have been se",
      "Most users think Er I didn't use it much over the 6 months and have been seeking a bag that fits these criteria: \\-Comfortable \\-Packable (smaller than the Free rain- bonus if it packs in its on pocket w/o needing an external",
      "Most users think Xercise shorts x2 Long underwear Tapered exercise pants Underwear X5 Socks x6 Light hoodie Extras: Rain Jacket Skateboard Eagles Nest hammock, bug net and straps Rodes Video Go Mic II Outlet splitter Ma"
    ],
    "cons": [
      "Most users think Misc orange bag Clothes: Jeans Linen pants x2 T-shirts x4 Linen shirt Exercise shorts x2 Long underwear Tapered exercise pants Underwear X5 Socks x6 Light hoodie Extras: Rain Jacket Skateboard Eagles Ne",
      "Most users think The sling is surprisingly big. That's par",
      "Most users think I did not recognise the quinoa out of context and wondered why you had packed gravel 😂😂"
    ],
    "sentiment": 8.3,
    "num_mentions": 344
  },
  "Matador SEG28": {
    "name": "Matador SEG28",
    "pros": [
      "Most users think It wasn't comfortable for her to carry for a prolonged time. She didn't find the hipbelts",
      "Most users think Does it feel heavy on your shoulders? * Would you see yourself carrying this entire loadout for e",
      "Most users think T handwash? &amp;nbsp; I've only tested the backpack in-stores _(with sandbags to test weight and capacity)_ and my own feedback echoes yours - * Didn't feel breathable due to the back panel material * Th"
    ],
    "cons": [
      "Most users think Without bottle. With everything",
      "Most users think The segment system is innovative but gimmicky. It was tedious having to empty each of",
      "Most users think **CLOTHES** * 6\\* tank tops * 2\\* T-shirts * 1\\* Merino Wool T-shirt * 1\\* long sleeve * 6\\* underwear * 3\\* socks * 1\\* swimming trunks * 2\\* light shorts * 1\\* rain poncho * 1\\* Buff * Flip Flops * pa"
    ],
    "sentiment": 11.1,
    "num_mentions": 537
  },
  "Matador SEG42 Travel Pack": {
    "name": "Matador SEG42 Travel Pack",
    "pros": [
      "Most users think It wasn't comfortable for her to carry for a prolonged time. She didn't find the hipbelts",
      "Most users think Does it feel heavy on your shoulders? * Would you see yourself carrying this entire loadout for e",
      "Most users think T handwash? &amp;nbsp; I've only tested the backpack in-stores _(with sandbags to test weight and capacity)_ and my own feedback echoes yours - * Didn't feel breathable due to the back panel material * Th"
    ],
    "cons": [
      "Most users think Without bottle. With everything",
      "Most users think The segment system is innovative but gimmicky. It was tedious having to empty each of",
      "Most users think **CLOTHES** * 6\\* tank tops * 2\\* T-shirts * 1\\* Merino Wool T-shirt * 1\\* long sleeve * 6\\* underwear * 3\\* socks * 1\\* swimming trunks * 2\\* light shorts * 1\\* rain poncho * 1\\* Buff * Flip Flops * pa"
    ],
    "sentiment": 11.9,
    "num_mentions": 797
  },
  "Matador SEG45": {
    "name": "Matador SEG45",
    "pros": [
      "Most users think It wasn't comfortable for her to carry for a prolonged time. She didn't find the hipbelts",
      "Most users think Does it feel heavy on your shoulders? * Would you see yourself carrying this entire loadout for e",
      "Most users think T handwash? &amp;nbsp; I've only tested the backpack in-stores _(with sandbags to test weight and capacity)_ and my own feedback echoes yours - * Didn't feel breathable due to the back panel material * Th"
    ],
    "cons": [
      "Most users think Without bottle. With everything",
      "Most users think The segment system is innovative but gimmicky. It was tedious having to empty each of",
      "Most users think **CLOTHES** * 6\\* tank tops * 2\\* T-shirts * 1\\* Merino Wool T-shirt * 1\\* long sleeve * 6\\* underwear * 3\\* socks * 1\\* swimming trunks * 2\\* light shorts * 1\\* rain poncho * 1\\* Buff * Flip Flops * pa"
    ],
    "sentiment": 10.3,
    "num_mentions": 415
  },
  "Millican Fraser Rucksack 32L": {
    "name": "Millican Fraser Rucksack 32L",
    "pros": [
      "Most users think Ino) 1 x cardigan (Uniqlo merino) 2 x leggings (I got them at target years ago: 1 fleece lined with pockets, 1 unlined with pockets) 2 x pants (joggers from target, Nautica tencel slacks from costco) Allbird",
      "Most users think I’d recommend bringing a sunhat and some",
      "Most users think Ya) Small (.5L) nalgene (it glows in the dark!) Towel (Drylite medium) Head lamp (Petzl) Red safety light (took it off my brother's old bike) Compass (old orienteering one I found in the garage) Lindisfarn"
    ],
    "cons": [
      "Most users think Tside longer than anticipated) Clothes: Ikea packing cubes, extra for dirty 4 x underwear (rei merino) 2x bra (rei merino) 3 x shirt (2 uniqlo long sleeve, 1 rei short sleeve) 1 x pjs (uniqlo shirt+leg",
      "Most users think I get stuck outside longer than anticipated) Clothes: Ikea packing cubes, extra for dirty 4 x underwear (rei merino) 2x bra (rei merino) 3 x shirt (2 uniqlo long sleeve, 1 rei short sleeve) 1 x pjs (uniq",
      "Most users think Not all heroes wear capes"
    ],
    "sentiment": 7.8,
    "num_mentions": 42
  },
  "Millican Smith Roll Pack 25L": {
    "name": "Millican Smith Roll Pack 25L",
    "pros": [
      "Most users think I was impressed with the quality of fabrics and small design details in function",
      "Most users think I had one for some time and it",
      "Most users think I had one for some time an"
    ],
    "cons": [
      "Most users think Clothes: - 2 Polo shirts, 1 blue and 1 white - 2 Normal Cotton",
      "Most users think I have never used another model of Fjällräven backpack until yesterday with the",
      "Most users think Clothes: - 2 Polo shirts, 1 blue and 1 white - 2 Normal Cotton t-sh"
    ],
    "sentiment": 8.5,
    "num_mentions": 309
  },
  "Minaal Carry-on 2.0": {
    "name": "Minaal Carry-on 2.0",
    "pros": [
      "Most users think Yeah, they aren’t the best/most durable, but they actually work very well and have nice designs",
      "Most users think My potential use cases, but definitely some",
      "Most users think Also, 24 liters with Aer feels pretty close to 28 liters with Evergoods. I can’t"
    ],
    "cons": [
      "Most users think I posted a little over a w",
      "Most users think I need to decide if I'm keeping the ULA Dr",
      "Most users think I just finished this not too long ago. I'"
    ],
    "sentiment": 8.3,
    "num_mentions": 356
  },
  "Minaal Daily 2.0": {
    "name": "Minaal Daily 2.0",
    "pros": [
      "Most users think Yeah, they aren’t the best/most durable, but they actually work very well and have nice designs",
      "Most users think My potential use cases, but definitely some",
      "Most users think Also, 24 liters with Aer feels pretty close to 28 liters with Evergoods. I can’t"
    ],
    "cons": [
      "Most users think After several wears and loadouts, it should be ok. But sometimes, I’ll pile a",
      "Most users think I posted a little over a w",
      "Most users think I need to decide if I'm keeping the ULA Dr"
    ],
    "sentiment": 7.8,
    "num_mentions": 440
  },
  "Mission Workshop Fitzroy": {
    "name": "Mission Workshop Fitzroy",
    "pros": [
      "Most users think I need pockets, plain and simple. I need water bottle holders. I wanted the rambler to be t",
      "Most users think No smoke smell, a few little",
      "Most users think The MW is not great as a side bag - won’t stay on the shoulder well and is less effe"
    ],
    "cons": [
      "Most users think No smoke smell, a few little internal blemishes but the exterior wax canvas is in great condition",
      "Most users think He has taken money from",
      "Most users think Without further ado, the links to the"
    ],
    "sentiment": 7.3,
    "num_mentions": 208
  },
  "Mission Workshop Rhake": {
    "name": "Mission Workshop Rhake",
    "pros": [
      "Most users think What I did miss on the Vandal was organization and a proper plac",
      "Most users think Do You have any recommendations? I love rolltop x-pac combo",
      "Most users think If you want to add a lot of organization, buy an ILE Pocket Organizer"
    ],
    "cons": [
      "Most users think What I did miss on the Vandal was organization and a proper place to put my laptop. The Rh",
      "Most users think I have yet to find the perfect bag. I have three regular ba",
      "Most users think They also sell every bag"
    ],
    "sentiment": 8.8,
    "num_mentions": 209
  },
  "Mission Workshop Vandal": {
    "name": "Mission Workshop Vandal",
    "pros": [
      "Most users think Ockets\" and I low how the Aer opens up like a clamshell for the main compartment. * That said, I do love this bag because it's super stealthy looking, has a great \"shape\", and the lime-green interior is f",
      "Most users think Not a huge fan of the brand but I know they make",
      "Most users think I have a Recon bag and it feels bigger than that, oddly enough. * I am comparing this to m"
    ],
    "cons": [
      "Most users think At $128, it's definitely not che",
      "Most users think Ockets (my CPP only has one) and although there's no \"quick\" compartment on the top to store keys, whatever, there is a \"zippered\" compartment in the main area that you can drop things into. * The laptop",
      "Most users think What I did miss on the Vandal was organization and a proper place to put my laptop. The Rh"
    ],
    "sentiment": 10.1,
    "num_mentions": 313
  },
  "Mountain Hardwear Camp 4 40": {
    "name": "Mountain Hardwear Camp 4 40",
    "pros": [
      "Most users think Always get a bag/quilt with a comfort rating in the range that you'll be in (with comfortab",
      "Most users think Ing (untested as well, and assuming MJ site is correct) and is a full pound heavier the MH is 13°F Comfort rated (actually EN tested) this isn't even a comparison",
      "Most users think And clear the snow from the rain"
    ],
    "cons": [
      "Most users think And really wanted to try it. And since I haven’t seen any pict",
      "Most users think We had a huge storm from the beginning of the af",
      "Most users think It’s a good tent for ventil"
    ],
    "sentiment": 7.1,
    "num_mentions": 724
  },
  "Mountain Hardwear Scrambler 30": {
    "name": "Mountain Hardwear Scrambler 30",
    "pros": [
      "Most users think The most durable alpine pack",
      "Most users think In your opinion, which of these two mountaineering backpacks is more durable? - Alpha 30 FL (315d Hadron® AC² LCP grid fabric) - Samaya Alpine 35 (400D Ripstop) Thanks for you",
      "Most users think I don't think many alphas were torn during use though! While I’m also waiting for r"
    ],
    "cons": [
      "Most users think I have an older Alpha FL wi",
      "Most users think Hout the LCP, but have used an Alpha SL20 pack for quite a bit of alpine use and it’s still without tears or holes after 4 or 5 years",
      "Most users think The material and top roll seemed nice but also seemed to lack some other featur"
    ],
    "sentiment": 7.4,
    "num_mentions": 28
  },
  "Mountain Hardwear Scrambler 35": {
    "name": "Mountain Hardwear Scrambler 35",
    "pros": [
      "Most users think Ing (untested as well, and assuming MJ site is correct) and is a full pound heavier the MH is 13°F Comfort rated (actually EN tested) this isn't even a comparison",
      "Most users think Saying that, goretex would mean the bag is waterproof bu",
      "Most users think It does have a water resistent shell. Is it worth it th"
    ],
    "cons": [
      "Most users think Maybe that's a good name for it! \ud83d",
      "Most users think Ck Size: 9 x 17 Inches 🟢 Compressed Volume: 12 L 🟢650 Fill Duck Down https://www.mountainhardwear.com/p/bishop-pass-gore-tex-0f%2F-18c-1997771.html 2) Big Agnes Sunbeam 0 (PURPLE) 🟣Stuff Sack",
      "Most users think Se domineering wistful coordinated divide scandalous reminiscent *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*"
    ],
    "sentiment": 6.8,
    "num_mentions": 230
  },
  "Mountainsmith Approach 25": {
    "name": "Mountainsmith Approach 25",
    "pros": [
      "Most users think ITW Web dominators and Gri",
      "Most users think To show capacity, used Camelbak 750ml and Ironheart IHSH-75 denim shirt in XL. Remember th",
      "Most users think Note that both capable of being synched and"
    ],
    "cons": [
      "Most users think Sorry if accidently added commentary twice. Quick",
      "Most users think I have worn one like it for ab",
      "Most users think This pack has no zippers. By far the most expensive piece of travel gear I have (not"
    ],
    "sentiment": 6.6,
    "num_mentions": 268
  },
  "Mountainsmith Approach 35": {
    "name": "Mountainsmith Approach 35",
    "pros": [
      "Most users think It's very faint but followable. If you don't",
      "Most users think ITW Web dominators and Gri",
      "Most users think This northern approach is definit"
    ],
    "cons": [
      "Most users think Sorry if accidently added commentary twice. Quick",
      "Most users think I've approached this area from the north and the south (Ludlow",
      "Most users think This pack has no zippers. By far the most expensive piece of travel gear I have (not"
    ],
    "sentiment": 8.1,
    "num_mentions": 378
  },
  "Mystery Ranch 2 Day Assault": {
    "name": "Mystery Ranch 2 Day Assault",
    "pros": [
      "Most users think If so there's a laptop sleeve, document sle",
      "Most users think I'm not really sold on",
      "Most users think Build quality is surprising too, in a good w"
    ],
    "cons": [
      "Most users think Avy laptop, 17\" diagonal and about 5.6 lb, the charger and some other tech stuff, probably a couple notebooks, and on days when I go into the office, maybe a textbook, maybe an extra layer, maybe my lun",
      "Most users think It fits a 17\" laptop, miscellaneous tech",
      "Most users think Sure, it's a name change and minor function ch"
    ],
    "sentiment": 8.1,
    "num_mentions": 539
  },
  "Mystery Ranch Urban Assault 18": {
    "name": "Mystery Ranch Urban Assault 18",
    "pros": [
      "Most users think The bag is very well proportioned, and the small",
      "Most users think The second very simple but very useful mod I did was attaching some elastic cordage to",
      "Most users think The bag is relatively waterproof; for the most part, the rain sits directly"
    ],
    "cons": [
      "Most users think The issue I’m having now is identifying what bag it is, or even what year. I",
      "Most users think Especially in the beginning, this was an awkward sensation and caused discomfort in the upper",
      "Most users think My goal is to stay comfortable and prepared without ove"
    ],
    "sentiment": 8.5,
    "num_mentions": 474
  },
  "Mystery Ranch Urban Assault 21": {
    "name": "Mystery Ranch Urban Assault 21",
    "pros": [
      "Most users think T harness system which is very adjustable - Materials all feel great - Nice to have 2 water bottle pockets - Pretty good weather resistance - Fits way more stuff that I expected Cons: - Wouldn't have bee",
      "Most users think Pros: - Great harness system which is very adjustable - Materials all feel great - Nice t",
      "Most users think I love my UA21 and wish I loved my Catalyst as much but I just don't use it often"
    ],
    "cons": [
      "Most users think When empty it sits more flush when wearing and sup",
      "Most users think Oking really cool imo - Bag seems to stick out a lot more than other similarly sized bags that I've worn Overall: Given the opportunity again, I probably would've gone with the 22 litre version of this b",
      "Most users think When empty it sits more flush when wearing and super comfortab"
    ],
    "sentiment": 8.7,
    "num_mentions": 231
  },
  "Mystery Ranch Urban Assault 24": {
    "name": "Mystery Ranch Urban Assault 24",
    "pros": [
      "Most users think The second very simple but very useful mod I did was attaching some elastic cordage to",
      "Most users think T harness system which is very adjustable - Materials all feel great - Nice to have 2 water bottle pockets - Pretty good weather resistance - Fits way more stuff that I expected Cons: - Wouldn't have bee",
      "Most users think Initial impressions: it’s extre"
    ],
    "cons": [
      "Most users think When empty it sits more flush when wearing and sup",
      "Most users think The issue I’m having now is identifying what bag it is, or even what year. I",
      "Most users think Oking really cool imo - Bag seems to stick out a lot more than other similarly sized bags that I've worn Overall: Given the opportunity again, I probably would've gone with the 22 litre version of this b"
    ],
    "sentiment": 8,
    "num_mentions": 705
  },
  "Nomad Lane Bento Bag": {
    "name": "Nomad Lane Bento Bag",
    "pros": [
      "Most users think This was a gift for my wife of over 15yrs",
      "Most users think There are several mistakes and ugly spots but i",
      "Most users think Act that she brings a tote with her items she wants to quickly reach tells me she probably won’t consolidate into just one duffel anyways, she probably likes not having to unpack her work bag just for a we"
    ],
    "cons": [
      "Most users think Is it because I used a pa",
      "Most users think How has it held up so far in terms of wear and tear or a",
      "Most users think W.loandsons.com/products/catalina-deluxe-organic-canvas-dove-grey) -its big and budget friendly but not very stylish 2. [Nomad Lane Bento Bag](https://nomadlane.com/products/the-bento-bag) -very practi"
    ],
    "sentiment": 8.7,
    "num_mentions": 322
  },
  "Nomad Lane Bento Bag Pro": {
    "name": "Nomad Lane Bento Bag Pro",
    "pros": [
      "Most users think Ion of a luggage pass-through * I wanted a backpack that could also convert into a duffel * I don't love my Calpak Luka Duffle, and while they are different bags, I was worried it would be another situati",
      "Most users think If you're having comfort issues with these bags",
      "Most users think However, it is more of a duffel bag w strap"
    ],
    "cons": [
      "Most users think That being said... I'm 5'7\" and it is bigggg if you pack it all",
      "Most users think I have the 28L Cotopaxi. Is the 35l a good size",
      "Most users think It definitely fit a lot and apparently wasn't to"
    ],
    "sentiment": 10,
    "num_mentions": 101
  },
  "Nomatic Backpack 20L": {
    "name": "Nomatic Backpack 20L",
    "pros": [
      "Most users think I can carry a lot less than",
      "Most users think Overall, fantastic bag. One of the best I've ever own",
      "Most users think Ed, but would have been nice to have that peace of mind if I ever drop the bag. * The back panel is padded and breathable, and very comfortable to wear. * However, it's very \"stiff\" in the sense that it"
    ],
    "cons": [
      "Most users think A few additional notes: * Love the organization features. Lots of separate pockets",
      "Most users think Of mind if I ever drop the bag. * The back panel is padded and breathable, and very comfortable to wear. * However, it's very \"stiff\" in the sense that it in no way adjusts to the curvature of my back",
      "Most users think These were my options but were too big or tall on my back Thule cha"
    ],
    "sentiment": 9.7,
    "num_mentions": 255
  },
  "Nomatic Travel Pack 40L": {
    "name": "Nomatic Travel Pack 40L",
    "pros": [
      "Most users think I also like to occasionally pick up an item or two on my trips. The problem I",
      "Most users think Arger loads while remaining remarkably comfortable throughout long travel days. ## The Basics - **Capacity**: 40L main compartment + 5-10L expandable beavertail - **Style**: Panel-loading with roll-top/Cobr",
      "Most users think It feels very durable with good weatherproofing, so I have no doubts that this bag wi"
    ],
    "cons": [
      "Most users think All bags are made of a 300D Polyester w/TPO Coating w/Outer P",
      "Most users think Also note the 210 back is a deep black with no hint of green (the GRXC2 shoulder strap molly i",
      "Most users think The problem I've found is that full"
    ],
    "sentiment": 9.9,
    "num_mentions": 766
  },
  "Ortlieb Commuter Daypack City": {
    "name": "Ortlieb Commuter Daypack City",
    "pros": [
      "Most users think My current backpack is a cheap",
      "Most users think The North Face is hard to beat on value, though you might ne",
      "Most users think So I'm looking for a waterproof / water resistant bag, that is made of durabl"
    ],
    "cons": [
      "Most users think My current backpack is a cheap Adidas backpack that is very used; uncomfo",
      "Most users think My current backpack is a cheap Ad",
      "Most users think After a few months of light use the fabric is"
    ],
    "sentiment": 9.6,
    "num_mentions": 133
  },
  "Ortlieb Velocity": {
    "name": "Ortlieb Velocity",
    "pros": [
      "Most users think Ght and easy to use - no risk of broken zippers; \\- Ortlieb stand by their product - I damaged the waterproofing on a previous one, and they explained that was because I failed to let it fully dry out (true)",
      "Most users think Col de la Madone is a fairly famous climb in the French Alps used by He Who Shall Not Be Named to train for the Tour when Trek was his Team issued bike",
      "Most users think For huge capacity, the [Cranktank4](https://adventurehydration.com/product/water-storage-solutions-for-bikepackers-ad"
    ],
    "cons": [
      "Most users think Magnets weren't holding it in place firmly enough so I use a retractable c",
      "Most users think The flag can be easily removed / reattach to the bag without dam",
      "Most users think Doesn't break [Velominati](https://www.velominati.com) rule 32; very very breaks rule 52 🙂 *(I feel so stupid, I've only just noticed that \"Madone\" is an anagram of \"Domane\" 🙄)*"
    ],
    "sentiment": 6.7,
    "num_mentions": 214
  },
  "Osprey Daylite 26+6": {
    "name": "Osprey Daylite 26+6",
    "pros": [
      "Most users think I had it extended, but forced it into the smaller size (zippers held up well), didn't really fit i",
      "Most users think I’ve used the shove it pocket for wet stuff a",
      "Most users think Reviews told me it would be t"
    ],
    "cons": [
      "Most users think Inen mini skirt dress - two t-shirts (one black, one white) - long sleeve black shirt - blue jeans Not pictured - 2 bras, 5 thongs, 4 pairs of socks - loose, dressy, white silk tank top (somehow just",
      "Most users think Shorts x 2 too cold should’ve done sweats lol Pants x 2 for everyday Sweatshirt for everyday 3 in 1 north face jacket Quechua 10l Day bag (lies flat in the laptop compartment) Sanuks Nike running shoes",
      "Most users think Quechua 10l Day bag (lies flat in the laptop compartment) Sanuks Nike running shoes 5 pairs of underwear and socks 1 pair of long Johns (thermal underwear) A hat and a winter hat Other stuff: Phone + cha"
    ],
    "sentiment": 7.5,
    "num_mentions": 722
  },
  "Osprey Daylite Plus": {
    "name": "Osprey Daylite Plus",
    "pros": [
      "Most users think Decathlon cap 2. L.L.Bea",
      "Most users think Thread is here: [https://www.reddit.com/r/onebag/comments/vrrndj/looking\\_for\\_travel\\_backpack\\_recommendations/](https://www.reddit.com/r/onebag/comments/vrrndj/looking_for_travel_backpack_recommendations",
      "Most users think So just in case id pack my lightning pair to use with my iphone if"
    ],
    "cons": [
      "Most users think I have been honing my onebag loadout for a few",
      "Most users think Lush mini lotion bar &",
      "Most users think I stayed at friend of a fr"
    ],
    "sentiment": 8.7,
    "num_mentions": 471
  },
  "Osprey Daylite Plus 20L": {
    "name": "Osprey Daylite Plus 20L",
    "pros": [
      "Most users think Decathlon cap 2. L.L.Bea",
      "Most users think Yes, the kickstand is built into the",
      "Most users think Regardless, the Parsec, which I use"
    ],
    "cons": [
      "Most users think I have been honing my onebag loadout for a few",
      "Most users think Lush mini lotion bar &",
      "Most users think If I were properly traveling and not vacationing, I'd skim down an"
    ],
    "sentiment": 8.4,
    "num_mentions": 566
  },
  "Osprey Farpoint 40": {
    "name": "Osprey Farpoint 40",
    "pros": [
      "Most users think Olds a water bottle if the bag is not very full (not tested yet) - the main zipper is big: it looks solid and very durable - the main zipper and the laptop zipper can be locked with a lock - there is a sma",
      "Most users think Speaking of pockets, there is a lack of them on the outside and inside. I do like how",
      "Most users think However I'm not sure if it's worth upgrading my"
    ],
    "cons": [
      "Most users think The Fairview has the exact same features, henc",
      "Most users think The internal frame and sizable hip belt make wearing",
      "Most users think Now that I have pulled the trigger, I thought I would post about my experiences with two bags"
    ],
    "sentiment": 8.3,
    "num_mentions": 695
  },
  "Osprey Farpoint 55": {
    "name": "Osprey Farpoint 55",
    "pros": [],
    "cons": [],
    "sentiment": 5.4,
    "num_mentions": 21
  },
  "Osprey Farpoint 55L": {
    "name": "Osprey Farpoint 55L",
    "pros": [
      "Most users think # The Osprey Toiletry Roll Organizer: Compartments: * Large bottom pocket * Two flat zippered mesh pockets * One open mesh pocket for larger items *",
      "Most users think The Osprey roll pack works great as a toiletry bag, and I am very pleased with the quality of the Thule compression cubes",
      "Most users think I also bought the Osprey Roll Organizer toil"
    ],
    "cons": [
      "Most users think Hi all, I'm not a hiker, not really sporty or anything, BUT I just bought the female Osprey Fairview 55L in Night",
      "Most users think I did go with Marino wool T-shirts, but I’m not overly convinced that the",
      "Most users think I did go with Marino wool T-shirts, but I’m not"
    ],
    "sentiment": 7.8,
    "num_mentions": 641
  },
  "Osprey Porter 30": {
    "name": "Osprey Porter 30",
    "pros": [
      "Most users think Help me fine-tune my outfits for Ireland : r/HerOneBag",
      "Most users think Onebagging on a cheap ass United economy flight (where they charge"
    ],
    "cons": [
      "Most users think Onebagging on a cheap ass United economy flight (where they charge",
      "Most users think Osprey Porter 30L painful section at the back : r/onebag",
      "Most users think Osprey 26 + 6 as personal item ( is it too bulky? ) : r/onebag"
    ],
    "sentiment": 5.2,
    "num_mentions": 26
  },
  "Osprey Porter 30L": {
    "name": "Osprey Porter 30L",
    "pros": [
      "Most users think Ower Bank](https://a.co/d/7EKgKl1) * [Retractable USB C Cables](https://a.co/d/0MhBvo1) * [USB C to Lightning Adapter](https://a.co/d/8NtTzlx) * Bose QC45 Headphones * iPad Mini * AirPods Pro * Apple Watch",
      "Most users think It is very durable but there is a weight penalty. If you re",
      "Most users think Yes, the kickstand is built into the"
    ],
    "cons": [
      "Most users think If I were properly traveling and not vacationing, I'd skim down an",
      "Most users think Pack?sp=1&amp;color=Onyx&amp;size=ONE%20SIZE&amp;sizeType=Regular&amp;ch=pla&amp;cm_mmc=GooglePLA-_-non_brand_NB-_-Unisex_-_Gear_-_Backpacks-_-0230073147000000-_-121881767512&amp;utm_medium=psrch_pla&am",
      "Most users think Goofy on the space, but nothing a little tetrising won’t fix for the most p"
    ],
    "sentiment": 7.9,
    "num_mentions": 446
  },
  "Osprey Porter 46": {
    "name": "Osprey Porter 46",
    "pros": [
      "Most users think Onebagging on a cheap ass United economy flight (where they charge"
    ],
    "cons": [
      "Most users think Onebagging on a cheap ass United economy flight (where they charge",
      "Most users think Osprey Porter 30L painful section at the back : r/onebag",
      "Most users think THIS IS NOT A DRILL. REDDIT"
    ],
    "sentiment": 5.2,
    "num_mentions": 22
  },
  "Patagonia Black Hole 25L": {
    "name": "Patagonia Black Hole 25L",
    "pros": [
      "Most users think At 1.4 lbs it's quite light, while having mos",
      "Most users think I’ve taken it on other trips but this was the first on a truly one bag trip and it worked gre",
      "Most users think Also a fan of having so many pockets easily accessible (front hip stra"
    ],
    "cons": [
      "Most users think Jackets: I brought my Patag",
      "Most users think Zero issues fitting it under",
      "Most users think It's not the most comfortable bag to carry"
    ],
    "sentiment": 8.3,
    "num_mentions": 300
  },
  "Patagonia Black Hole 32L": {
    "name": "Patagonia Black Hole 32L",
    "pros": [
      "Most users think At 1.4 lbs it's quite light, while having mos",
      "Most users think Also a fan of having so many pockets easily accessible (front hip stra",
      "Most users think The plastic coating of the fabric is sta"
    ],
    "cons": [
      "Most users think There is almost no information about this bag, that's why I need your help. What I",
      "Most users think Water bottle pockets are nice, don’t tak",
      "Most users think Lack Hole 32l: - no side acess to the main compartment (quick acess while bag is on the shoulder) - flimsy backpanael with almost not ventilation - no strap at the mesh pockets to hold tripods oder fishing"
    ],
    "sentiment": 7.7,
    "num_mentions": 248
  },
  "Patagonia Black Hole 40L": {
    "name": "Patagonia Black Hole 40L",
    "pros": [
      "Most users think Is to have more room to find things easily, contain and organize gear for the backcountry in one consolidated place and without a ton of digging; a gear bag like this does not go much beyond the house or c",
      "Most users think Great buy, though - congrats",
      "Most users think Organization is not a strength you can list for it, but holy hell, will a giant duffel carry a t"
    ],
    "cons": [
      "Most users think Nabbed this 40% discounted Black Hole 100L an",
      "Most users think My goal is to have more room to find things easily, conta",
      "Most users think So jealous of you right now"
    ],
    "sentiment": 9.9,
    "num_mentions": 80
  },
  "Patagonia Refugio 26L": {
    "name": "Patagonia Refugio 26L",
    "pros": [
      "Most users think I cannot remember what led me to travel more lightweig",
      "Most users think I also have a TB synapse 25, and it fits everything well, but",
      "Most users think Both solid packs! The other big benefit of the kickstan"
    ],
    "cons": [
      "Most users think I am not entirely sure why my context comment appears to be deleted, but here it is: Long time lurker, fir",
      "Most users think Small cross-body purse. * **Tops**: 2x Columbia PFG sun-reflective shirts, Voormi lightweight merino long sleeve top, Smartwool tank top, Smartwool tee-shirt, Smartwool hoodie. * **Bottoms**: Gnara hi",
      "Most users think Baggies shorts * **Underthings**: 2x sports bras, 1x wireless bra, 4x merino socks, 5x merino underwear * **Footwear**: Teva sandals, New Balance all-terrain trainers * **Outerwear**: North Face cropped"
    ],
    "sentiment": 9.2,
    "num_mentions": 582
  },
  "Peak Design Everyday Backpack 20L": {
    "name": "Peak Design Everyday Backpack 20L",
    "pros": [
      "Most users think I’d like to get y’all’s thoug",
      "Most users think Se their travel backpack as a daily carry, I was put off by the combination of the main compartment organization (particularly the zippered pockets on the front panel) and the fact that the clamshell opens up fro",
      "Most users think Perfect for the airplane"
    ],
    "cons": [
      "Most users think Ouch. Their stuff is so good but not cheap",
      "Most users think It’s a weird grey area of wear and tear really but also having a lifeti",
      "Most users think Next thing I know I’m dropping 300$ on a camera bag, and what’s a bag without a small"
    ],
    "sentiment": 7.1,
    "num_mentions": 240
  },
  "Peak Design Everyday Backpack 30L": {
    "name": "Peak Design Everyday Backpack 30L",
    "pros": [
      "Most users think I went into the SF store for something unrelated and",
      "Most users think I’d like to get y’all’s thoug",
      "Most users think Se their travel backpack as a daily carry, I was put off by the combination of the main compartment organization (particularly the zippered pockets on the front panel) and the fact that the clamshell opens up fro"
    ],
    "cons": [
      "Most users think Ouch. Their stuff is so good but not cheap",
      "Most users think It’s a weird grey area of wear and tear really but also having a lifeti",
      "Most users think I went into the SF store for something"
    ],
    "sentiment": 7.2,
    "num_mentions": 269
  },
  "Peak Design Everyday Backpack Zip 15L": {
    "name": "Peak Design Everyday Backpack Zip 15L",
    "pros": [
      "Most users think A pretty insane weight to capacity ratio for an EDC. I’m assuming the wei",
      "Most users think Seems well made, and it's comfortable",
      "Most users think While I absolutely love my v3 CPL24 - maybe the most versatile bag I've ever own"
    ],
    "cons": [
      "Most users think I swear every bag I see right now is so ugly or black (l would definitely prefer a gentle pink or something, black is just not me at",
      "Most users think Cue the MPL22 in Coyote Ecopak ... wow, I could not be happier with this system. Cheers",
      "Most users think I swear every bag I see right now is so ugly or black (l would definitely prefer a gentle pink or something"
    ],
    "sentiment": 7.1,
    "num_mentions": 485
  },
  "Peak Design Everyday Backpack Zip 20L": {
    "name": "Peak Design Everyday Backpack Zip 20L",
    "pros": [
      "Most users think All in all I'd say they're sturdy",
      "Most users think It fits pretty snug but without a case or the pencil",
      "Most users think Do you happen to have any of th"
    ],
    "cons": [
      "Most users think I checked out the Everyday Backpack 20L V2 (regular version, not the Zip) today and believe the XPS 17 9700 or 9710 will fit that bag, although it will be tight",
      "Most users think It’s all sold out now. Bummer",
      "Most users think It fits pretty snug but without a case or the pencil"
    ],
    "sentiment": 6.8,
    "num_mentions": 378
  },
  "Peak Design Everyday Sling 3L": {
    "name": "Peak Design Everyday Sling 3L",
    "pros": [
      "Most users think I found PD's shoulder pad to be uncomfortable, so I added this p",
      "Most users think Besides, it is not the most comfortable bag to use when packed. It is a",
      "Most users think For this reason, I turned to the **Peak Desig"
    ],
    "cons": [
      "Most users think N actually answer this pretty well... it WILL fit, the 3L will fit an a7IV with the Sig 85 1.4 and no lens hood, or the a7IV with a 24-105 with no spare space. the blower will only fit if it's the mini",
      "Most users think You’re only one Liter away at this point (a 6",
      "Most users think Not sure how heavy your tripod is but I just want to throw [this option out there.](https://www.amazon.com/Think-Tank-"
    ],
    "sentiment": 7.2,
    "num_mentions": 112
  },
  "Peak Design Everyday Sling 6L": {
    "name": "Peak Design Everyday Sling 6L",
    "pros": [
      "Most users think It fits quite a lot especially with the Tamron 17-70mm f/2.8(one hefty",
      "Most users think Been using it for the last",
      "Most users think PD Sling V2 3L fits a R5 + RF 70-200 2.8 - [https://imgur.com/qPphBB1](https://img"
    ],
    "cons": [
      "Most users think Overall, I find most of what I hav",
      "Most users think The viewfinder protrodes",
      "Most users think Ard Reader: Apple USB-C to card reader Sandisk SD cards (128gb+64gb+32gb) Tripod: Zero F38 Tripod (not taken in the picture but definitely fits) Filter: Hoya Filter Kit 67mm (not taken in the picture"
    ],
    "sentiment": 7.8,
    "num_mentions": 256
  },
  "Peak Design Travel Backpack 30L": {
    "name": "Peak Design Travel Backpack 30L",
    "pros": [
      "Most users think TLDR: went with the Peak Design 3",
      "Most users think Happy to answer other questions, but here is a quick pro con list. **Peak Design** *Pros* * Huge bu",
      "Most users think All in all I'd say they're sturdy"
    ],
    "cons": [
      "Most users think Does the Peak Design feel",
      "Most users think I won’t be using the integrate",
      "Most users think How well does a coyote color travel"
    ],
    "sentiment": 7.2,
    "num_mentions": 545
  },
  "Peak Design Travel Backpack 45L": {
    "name": "Peak Design Travel Backpack 45L",
    "pros": [
      "Most users think All in all I'd say they're sturdy",
      "Most users think It fits pretty snug but without a case or the pencil",
      "Most users think Do you happen to have any of th"
    ],
    "cons": [
      "Most users think It’s all sold out now. Bummer",
      "Most users think It fits pretty snug but without a case or the pencil",
      "Most users think For being able to keep it small enough to fit under the seat on the plane I keep it snapped a"
    ],
    "sentiment": 6.9,
    "num_mentions": 361
  },
  "Peak Design Travel Backpack 65L": {
    "name": "Peak Design Travel Backpack 65L",
    "pros": [
      "Most users think I’m now planning an 18-month round-th",
      "Most users think I bought an Osprey 70L (55+15) bag in 2016 thinking all backpacks were created equal. Of c",
      "Most users think I think my Osprey bag is a *little* bit more comforta"
    ],
    "cons": [
      "Most users think I’m not usually one to post online reviews, but there aren’t *any* interior photos of this pack online, so",
      "Most users think There are no other reviews out there on the new",
      "Most users think They could have just used cheap canvas straps and it would probably be m"
    ],
    "sentiment": 10.6,
    "num_mentions": 429
  },
  "Peak Design Travel Duffel 35L": {
    "name": "Peak Design Travel Duffel 35L",
    "pros": [
      "Most users think I own several PD products, I love the company philosophy and design D",
      "Most users think Mine fits in barely, I have to wriggle it in really hard, and taking it out is even more ridi",
      "Most users think So I bring a tumi alpha bravo T"
    ],
    "cons": [
      "Most users think They could have just used cheap canvas straps and it would probably be m",
      "Most users think I’ve tried every combination, its gonna be equally as bad and not stick flat to the luggage handles even when using the loops next to the side compartment",
      "Most users think So I bring a tumi alp"
    ],
    "sentiment": 7.6,
    "num_mentions": 311
  },
  "Peak Design Travel Duffel 65L": {
    "name": "Peak Design Travel Duffel 65L",
    "pros": [
      "Most users think I’m now planning an 18-month round-th",
      "Most users think I bought an Osprey 70L (55+15) bag in 2016 thinking all backpacks were created equal. Of c",
      "Most users think I think my Osprey bag is a *little* bit more comforta"
    ],
    "cons": [
      "Most users think I’m not usually one to post online reviews, but there aren’t *any* interior photos of this pack online, so",
      "Most users think There are no other reviews out there on the new",
      "Most users think They could have just used cheap canvas straps and it would probably be m"
    ],
    "sentiment": 9.2,
    "num_mentions": 568
  },
  "Rains Backpack": {
    "name": "Rains Backpack",
    "pros": [
      "Most users think Just picked up a used Rains Mountaineer backpack ([https://www.rains.com/products/mountaineer-bag](https://www.rains.com/pro",
      "Most users think Also was looking for minimal",
      "Most users think I've used it only a few times in heavy rain (light rai"
    ],
    "cons": [
      "Most users think Also was looking for minimalist s",
      "Most users think I've used it only a few times in heavy ra",
      "Most users think Also, the laptop compartment goes all the way down to the bottom of the b"
    ],
    "sentiment": 8,
    "num_mentions": 403
  },
  "Rains Rolltop Backpack": {
    "name": "Rains Rolltop Backpack",
    "pros": [
      "Most users think Just picked up a used Rains Mountaineer backpack ([https://www.rains.com/products/mountaineer-bag](https://www.rains.com/pro",
      "Most users think Also was looking for minimal",
      "Most users think I've used it only a few times in heavy rain (light rai"
    ],
    "cons": [
      "Most users think Also was looking for minimalist s",
      "Most users think I've used it only a few times in heavy ra",
      "Most users think Also, the laptop compartment goes all the way down to the bottom of the b"
    ],
    "sentiment": 8.4,
    "num_mentions": 949
  },
  "Recycled Firefighter 24 Hour": {
    "name": "Recycled Firefighter 24 Hour",
    "pros": [
      "Most users think I received the regular R",
      "Most users think It's a tough, minimalist pack. A few observations that should also apply to the 24 HR",
      "Most users think I have an RFF and have never been able to find a bag wit"
    ],
    "cons": [
      "Most users think The brand is not specified on the pulls or on RFF's website. * A few stray threads had to be",
      "Most users think Like many people getting into the bag market, I had seen a lot of the square clamshel type bags",
      "Most users think Still I would not have bit if the price wasn't so good and it had some features unco"
    ],
    "sentiment": 11.3,
    "num_mentions": 558
  },
  "Red Oxx Air Boss": {
    "name": "Red Oxx Air Boss",
    "pros": [
      "Most users think Redded on this sub once for recommending them since they're not cheap, but screw 'em, Red Oxx makes quality products that are the epitome of BIFL",
      "Most users think A nice and very sturdy bag. I gave it",
      "Most users think So figured I'd post this. Red Oxx has amazing quality"
    ],
    "cons": [
      "Most users think It's just my Red Oxx Metro",
      "Most users think Got shredded on this sub onc",
      "Most users think This sub isn’t for cheap products, so shred away I say lol"
    ],
    "sentiment": 7.3,
    "num_mentions": 150
  },
  "Red Oxx C-Ruck": {
    "name": "Red Oxx C-Ruck",
    "pros": [
      "Most users think I actually ordered the smaller model from Squatch. Gr",
      "Most users think Blue is brand new with tag",
      "Most users think Mainly being able to hold more discs? I have a backpack style that can hold like 23-25 discs for $"
    ],
    "cons": [
      "Most users think Blue is brand new with tag",
      "Most users think This comment is now bei",
      "Most users think I actually ordered the smaller model from Squa"
    ],
    "sentiment": 7,
    "num_mentions": 316
  },
  "Red Oxx Metro": {
    "name": "Red Oxx Metro",
    "pros": [
      "Most users think So figured I'd post this. Red Oxx has amazing quality",
      "Most users think I have 2 4L shadow pockets, 3 ebags packing cubes, a 9L dry sack folded up and s",
      "Most users think It is absolutely rock-solid and bulletproof – and it fits an insane amount as"
    ],
    "cons": [
      "Most users think Though, you can send it back for repairs, for a fee and ship",
      "Most users think I feel that nowadays the standard that justifies someone to proclaim themselves as a DJ",
      "Most users think It's just my Red Oxx Metro"
    ],
    "sentiment": 6.6,
    "num_mentions": 128
  },
  "Red Oxx Metro Backpack": {
    "name": "Red Oxx Metro Backpack",
    "pros": [
      "Most users think So figured I'd post this. Red Oxx has amazing quality",
      "Most users think I have 2 4L shadow pockets, 3 ebags packing cubes, a 9L dry sack folded up and s",
      "Most users think It is absolutely rock-solid and bulletproof – and it fits an insane amount as"
    ],
    "cons": [
      "Most users think Though, you can send it back for repairs, for a fee and ship",
      "Most users think I was looking at the d",
      "Most users think Should I be concerned with footwear? I plan on only wearing Merrel M"
    ],
    "sentiment": 7.2,
    "num_mentions": 80
  },
  "REI Flash 22": {
    "name": "REI Flash 22",
    "pros": [
      "Most users think Great bag that fits my super chunky 17\" work laptop. Black/top",
      "Most users think It has solid organization built in",
      "Most users think Otherwise excellent and VERY sturdy bag. Black Kelty Redwing Tactical"
    ],
    "cons": [
      "Most users think I really wanted to like thi",
      "Most users think Still pretty comfy as long as it's not overloaded. Packing Cubes",
      "Most users think I've used it for work, taken it"
    ],
    "sentiment": 9.4,
    "num_mentions": 285
  },
  "REI Ruckpack 28": {
    "name": "REI Ruckpack 28",
    "pros": [
      "Most users think Know this wasn't an extensive trip, but the variety of settings and amount of travel time (5 total flight incl. connections, plus many hours on the road) meant that I set out to be extra considerate in wha",
      "Most users think Happy to hear any thoughts or recommendations, and hope you enjoy! **Bag -** ***REI Ruckpack 28 (c",
      "Most users think R or nomad or ultra-minimalist by any means, but have enjoyed the pursuit of one-bag travel in some capacity for almost 2 decades, from short trips as a teenager with only a schoolbag to several multi-week tr"
    ],
    "cons": [
      "Most users think The following is my packing list with some notes on most",
      "Most users think My only real complaint is the wa",
      "Most users think Diving into the Zapotec"
    ],
    "sentiment": 11.8,
    "num_mentions": 647
  },
  "REI Trail 25": {
    "name": "REI Trail 25",
    "pros": [
      "Most users think The one who says \"I should only bring o",
      "Most users think I've had this pack for at",
      "Most users think I've had this pack for at least a couple of y"
    ],
    "cons": [
      "Most users think Packing list here includes hiking items but does n",
      "Most users think Afety gear, including an InReach, so I'm underpacking compared to if I were solo hiking/camping. **Worn Items:** Athleta Trekkie North joggers (my ride-or-dies!) Old Navy ribbed tank REI full-zip fl",
      "Most users think Heck yeah, Altras are everythin"
    ],
    "sentiment": 8.5,
    "num_mentions": 383
  },
  "REI Trail 40": {
    "name": "REI Trail 40",
    "pros": [
      "Most users think My jeans stretched out",
      "Most users think Thank you for sharing",
      "Most users think It has solid organization built in"
    ],
    "cons": [
      "Most users think I also had a PJ t shirt and light pan",
      "Most users think I brought a bra and a swim top (which I ended up",
      "Most users think I expected to wear it a lot more, but days 2-5 in Morocco were spent mostly sitting in a van with our tour guide with"
    ],
    "sentiment": 8.5,
    "num_mentions": 356
  },
  "Remote Equipment Alpha 31": {
    "name": "Remote Equipment Alpha 31",
    "pros": [
      "Most users think The main compartment. &gt;Laptop sleeve has a dedicated exterior zipper at the back. &gt;Super comfortable harness is sporting ergonomic S-shaped straps with load lifters, heavily padded and well ventilated",
      "Most users think However, I faced some real rain for the first time yesterday. After a 2",
      "Most users think R via the rolltop. &gt;Utilizing both the compression straps and the adjustable roll-top, the bag capacity varies from ~25L to ~36L. &gt;The bag in UVX40 weighs only 2lb 3oz with the frame sheet removed"
    ],
    "cons": [
      "Most users think Since I gave you a big list abov",
      "Most users think It’s hard for a full size backpack not to look like a child’s backpack on me. Howeve",
      "Most users think I think the compression straps help? When tightened down"
    ],
    "sentiment": 8.2,
    "num_mentions": 190
  },
  "ROFMIA Backpack V2": {
    "name": "ROFMIA Backpack V2",
    "pros": [
      "Most users think I'll try to be thorough in my impressions, but it's very",
      "Most users think It's small, but [perfectly fits my wallet attached by key strap](https",
      "Most users think It's small, but [perfectly fits my wallet attached by key strap](https://i.imgu"
    ],
    "cons": [
      "Most users think To start let me be blunt: this bag is expensive",
      "Most users think &gt;I think I need to stop now... running out of storage space to keep them! &gt; &gt;Front row from left to right: Cabin",
      "Most users think To start let me be blunt: this bag is expensive (~$800 wi"
    ],
    "sentiment": 8.4,
    "num_mentions": 201
  },
  "ROFMIA Daypack V2": {
    "name": "ROFMIA Daypack V2",
    "pros": [
      "Most users think Some of the noteworthy features include: * In",
      "Most users think **COMFORT** As with all Black Ember bags comfort is excellent and the harness system is nearly identical to",
      "Most users think Nicely padded, contoured shoulder s"
    ],
    "cons": [
      "Most users think There is nothing flashy about it, but I can’t possibly call the Shadow a boring product. I",
      "Most users think They’re a small innovative team based in San-Francisco that has been pushing th",
      "Most users think For some reason, the water bo"
    ],
    "sentiment": 15.7,
    "num_mentions": 387
  },
  "Samsonite Tectonic 2": {
    "name": "Samsonite Tectonic 2",
    "pros": [
      "Most users think Op compartment - Trolley sleeve - Front zippered pockets - Side pockets for water bottle/umbrella - Comfortable shoulder straps - Not too sporty looking Not a necessity but nice to have: - Interior organization",
      "Most users think It’s sturdy, has great pockets, and it’s held up really well as my daily commute / wo",
      "Most users think Still 100% usable even after my dog tried destroying it a year or two in. This"
    ],
    "cons": [
      "Most users think I am looking for suggestions and recommendations for a new backpack to house my new laptop, a [Lenovo ThinkPad T72](https://www.lenovo.com/us/en/laptops/thinkpad/thinkpad-p/ThinkPad-P72/p/22WS2WPWP72",
      "Most users think I know the CPP2 is advertised at 24L while the LTT bag is advertised at 20L, b",
      "Most users think Then I realized it was too small for my dai"
    ],
    "sentiment": 8.1,
    "num_mentions": 295
  },
  "Samsonite Xenon 3.0": {
    "name": "Samsonite Xenon 3.0",
    "pros": [
      "Most users think About 30 hours later I have n",
      "Most users think I do know it’s not big enough for my needs. I need a backpack that can carry clo",
      "Most users think King List: - Tortuga 35 L Outbreaker - Dell XPS 13 Ultrabook - 120gb 6th gen Ipod - Rite in the Rain Notepad ( 2 pens, 1 highlighter)-Kindle - Xero Barefoot Sandals - Bexley Flager Gomme City Chelse"
    ],
    "cons": [
      "Most users think The whole selling point was how small this thing would fold up to put",
      "Most users think I also have no idea about what will need to be uncrewed to get the stem out, without d",
      "Most users think I went to the dynamicscooter.com to look for a phone number or chat to inform them o"
    ],
    "sentiment": 5.5,
    "num_mentions": 194
  },
  "Sandqvist Bernt": {
    "name": "Sandqvist Bernt",
    "pros": [
      "Most users think However, it is worth pointing out",
      "Most users think I really dig the dope-dyed DYECOSHELL fabric. It's really sof",
      "Most users think I’ve had one of their side-load lapto"
    ],
    "cons": [
      "Most users think Now you might ask, \"But SaltyMargaritas, what was it about this particular roll-top that told you",
      "Most users think It's really soft but also",
      "Most users think 0 (ideally under $100 though), and I feel pretty strongly about the following features (but they're not *necessarily* dealbreakers), in order of importance: \\- 22-30L in size (I plan to carry groceries"
    ],
    "sentiment": 9,
    "num_mentions": 43
  },
  "Sandqvist Zack": {
    "name": "Sandqvist Zack",
    "pros": [
      "Most users think Con: not a lot of cons bes",
      "Most users think For those able to keep their needs low, I recommend this",
      "Most users think I’m currently torn between"
    ],
    "cons": [
      "Most users think I packed more shirts than I probably need but",
      "Most users think I’ll be sink/hand washing underwear, socks, shorts along the way and",
      "Most users think Could I get rid of some stuff to make this bag work? Sure, and I still might as I’m still cons"
    ],
    "sentiment": 11.4,
    "num_mentions": 176
  },
  "Shimoda Action X30": {
    "name": "Shimoda Action X30",
    "pros": [
      "Most users think This isn’t my first MR bag (I also have",
      "Most users think E more than I remember the UA 24 having The compression straps do a good job cinching down smaller carries, though I would have preferred the lower straps to be just a few inches higher and hit right across",
      "Most users think A smallish hiking pack, or a"
    ],
    "cons": [
      "Most users think A smallish hiking pack, or a just right for a three day weekend pack Well made, not too terribly heavy which I appreciate after using the Aer TP3 a lot, great harness when the load is heavy. MR makes su",
      "Most users think Regarding access, I ha",
      "Most users think Vs remote/more casual needs, 3ish bottoms (pant, short, swim trunk), 3-4 pair socks, 3-4 pair underwear, a raincoat, hoody, laptop or tablet + phone and associated cords and charging blocks, auxiliary ba"
    ],
    "sentiment": 15.4,
    "num_mentions": 288
  },
  "Shimoda Action X30 V2": {
    "name": "Shimoda Action X30 V2",
    "pros": [
      "Most users think Rather comfortable and well made for the price. I didn't bring a laptop this time but I also",
      "Most users think It definitely has a lot of neat features, lots of",
      "Most users think The ef 70-200 f/4 lives on m"
    ],
    "cons": [
      "Most users think I went to Montreal to snowboard for three days this past weekend and wanted to pack everything I needed in one bag (although",
      "Most users think Waiting on mine, hopefully will have no issues with it in Europe and Asian airlines some 35L are too big when packed out",
      "Most users think Camera backpacks that are too small for 16\" Legion"
    ],
    "sentiment": 8.9,
    "num_mentions": 107
  },
  "Shimoda Action X50": {
    "name": "Shimoda Action X50",
    "pros": [
      "Most users think All the things with plen",
      "Most users think You can argue how smar",
      "Most users think All the things with plenty of holders, a lightmeter and a"
    ],
    "cons": [
      "Most users think Not loving that idea, moving through forest or tight space can be annoying but I think I’ll try th",
      "Most users think Maybe worth noting that it was the weight pushing on the",
      "Most users think Hows ur experience with the grafmatics? Are they reliable too"
    ],
    "sentiment": 9.3,
    "num_mentions": 98
  },
  "Shimoda Action X50 V2": {
    "name": "Shimoda Action X50 V2",
    "pros": [
      "Most users think All the things with plen",
      "Most users think You can argue how smar",
      "Most users think All the things with plenty of holders, a lightmeter and a"
    ],
    "cons": [
      "Most users think Hows ur experience with the grafmatics? Are they reliable too",
      "Most users think I had them with me now because no bridges",
      "Most users think The tripod is extra since I use a big and heavy one so I"
    ],
    "sentiment": 9.6,
    "num_mentions": 61
  },
  "Shimoda Action X70": {
    "name": "Shimoda Action X70",
    "pros": [
      "Most users think All the things with plen",
      "Most users think You can argue how smar",
      "Most users think All the things with plenty of holders, a lightmeter and a"
    ],
    "cons": [
      "Most users think Hows ur experience with the grafmatics? Are they reliable too",
      "Most users think I had them with me now because no bridges",
      "Most users think The tripod is extra since I use a big and heavy one so I"
    ],
    "sentiment": 8.4,
    "num_mentions": 144
  },
  "Shimoda Action X70 V2": {
    "name": "Shimoda Action X70 V2",
    "pros": [
      "Most users think All the things with plen",
      "Most users think You can argue how smar",
      "Most users think All the things with plenty of holders, a lightmeter and a"
    ],
    "cons": [
      "Most users think Hows ur experience with the grafmatics? Are they reliable too",
      "Most users think I had them with me now because no bridges",
      "Most users think The tripod is extra since I use a big and heavy one so I"
    ],
    "sentiment": 8.8,
    "num_mentions": 76
  },
  "Shimoda Explore V2 25L": {
    "name": "Shimoda Explore V2 25L",
    "pros": [
      "Most users think Rather comfortable and well made for the price. I didn't bring a laptop this time but I also",
      "Most users think To many it is dinky small but for them it fits nicely. Ev",
      "Most users think Easy access comfortable and sturdy"
    ],
    "cons": [
      "Most users think I went to Montreal to snowboard for three days this past weekend and wanted to pack everything I needed in one bag (although",
      "Most users think Currently I’m just using a camera cube from an o",
      "Most users think Even his lens filters are fre"
    ],
    "sentiment": 9.4,
    "num_mentions": 106
  },
  "Shimoda Explore V2 30L": {
    "name": "Shimoda Explore V2 30L",
    "pros": [
      "Most users think Rather comfortable and well made for the price. I didn't bring a laptop this time but I also",
      "Most users think To many it is dinky small but for them it fits nicely. Ev",
      "Most users think Easy access comfortable and sturdy"
    ],
    "cons": [
      "Most users think I went to Montreal to snowboard for three days this past weekend and wanted to pack everything I needed in one bag (although",
      "Most users think Currently I’m just using a camera cube from an o",
      "Most users think Waiting on mine, hopefully will have no issues with it in Europe and Asian airlines some 35L are too big when packed out"
    ],
    "sentiment": 9,
    "num_mentions": 147
  },
  "Shimoda Explore V2 35L": {
    "name": "Shimoda Explore V2 35L",
    "pros": [
      "Most users think This isn’t my first MR bag (I also have",
      "Most users think E more than I remember the UA 24 having The compression straps do a good job cinching down smaller carries, though I would have preferred the lower straps to be just a few inches higher and hit right across",
      "Most users think A smallish hiking pack, or a"
    ],
    "cons": [
      "Most users think A smallish hiking pack, or a just right for a three day weekend pack Well made, not too terribly heavy which I appreciate after using the Aer TP3 a lot, great harness when the load is heavy. MR makes su",
      "Most users think Regarding access, I ha",
      "Most users think Vs remote/more casual needs, 3ish bottoms (pant, short, swim trunk), 3-4 pair socks, 3-4 pair underwear, a raincoat, hoody, laptop or tablet + phone and associated cords and charging blocks, auxiliary ba"
    ],
    "sentiment": 14,
    "num_mentions": 384
  },
  "The North Face Base Camp Voyager 32L": {
    "name": "The North Face Base Camp Voyager 32L",
    "pros": [
      "Most users think The bag is pretty good and comforta",
      "Most users think The Voyager Rolltop is made off of a water resistant fabric w",
      "Most users think The laptop compartment is great, the front has solid"
    ],
    "cons": [
      "Most users think I decided to post about this bag here, bec",
      "Most users think One thing I noticed is the lack of hip belts for the backpacks though... how do you fin",
      "Most users think If I carry a lot of stuff I use the stabilization buckle that c"
    ],
    "sentiment": 8.5,
    "num_mentions": 292
  },
  "The North Face Borealis": {
    "name": "The North Face Borealis",
    "pros": [
      "Most users think Best laptop sleeve, best internal organization, best accessory",
      "Most users think North face are great and worth the money imo, get near daily use out of all my north face products",
      "Most users think I gotta say I enjoy this newer"
    ],
    "cons": [
      "Most users think So I’m not talking about models before 2018. Im",
      "Most users think Now, I see North Face on here catch a bit of flack from certain corners, but there's not a stitch o",
      "Most users think I gotta say I enjoy this newer model much"
    ],
    "sentiment": 8.4,
    "num_mentions": 62
  },
  "The North Face Recon": {
    "name": "The North Face Recon",
    "pros": [
      "Most users think It’s a perfect blend of durability, comfort, and organization",
      "Most users think It’s a perfect blend of durability, comfort, and o",
      "Most users think I didn't like the lack of organization for the admin functions (e.g., pe"
    ],
    "cons": [
      "Most users think Though there are many reviews of the North Face Surge",
      "Most users think It’s a perfect blend of du",
      "Most users think Even when I was a little snotnosed idiot in hi"
    ],
    "sentiment": 8.3,
    "num_mentions": 416
  },
  "Thule Crossover 32L": {
    "name": "Thule Crossover 32L",
    "pros": [
      "Most users think I’m now planning an 18-month round-th",
      "Most users think I bought an Osprey 70L (55+15) bag in 2016 thinking all backpacks were created equal. Of c",
      "Most users think I think my Osprey bag is a *little* bit more comforta"
    ],
    "cons": [
      "Most users think I’m not usually one to post online reviews, but there aren’t *any* interior photos of this pack online, so",
      "Most users think * Most impressed with the overall innovation of the design - it’s different yet works quite well! * Least impressed with the shoulder stra",
      "Most users think &gt;Most impressed with the overall innovation of the design This is very ... inspired ... by the [ILE Travel Pack](https://ilequipment.com"
    ],
    "sentiment": 10.3,
    "num_mentions": 482
  },
  "Thule Landmark 40L": {
    "name": "Thule Landmark 40L",
    "pros": [
      "Most users think I’m now planning an 18-month round-th",
      "Most users think I bought an Osprey 70L (55+15) bag in 2016 thinking all backpacks were created equal. Of c",
      "Most users think I think my Osprey bag is a *little* bit more comforta"
    ],
    "cons": [
      "Most users think I’m not usually one to post online reviews, but there aren’t *any* interior photos of this pack online, so",
      "Most users think So I was missing a bag to go one-bag traveling, as I really like the i",
      "Most users think The internal frame and sizable hip belt make wearing"
    ],
    "sentiment": 11.8,
    "num_mentions": 527
  },
  "Thule Subterra 34L": {
    "name": "Thule Subterra 34L",
    "pros": [
      "Most users think There are two compartments: a clamshell open “travel pack” main open compartment, and",
      "Most users think Northface is good but doesn't provide ve",
      "Most users think First of all thanks to all of you for great posts. Base"
    ],
    "cons": [
      "Most users think One book, cables and chargers in tech compart",
      "Most users think Look, used as a brief it looks professional, used as a backpack too - Fabric is easy to clean and not a lint magnet - Straps are surprisingly well padded Cons: - Laptop compartment is so densely padd",
      "Most users think My shoulder strap clip fell off, and now the bag is difficult"
    ],
    "sentiment": 8.9,
    "num_mentions": 558
  },
  "Timbuk2 Division": {
    "name": "Timbuk2 Division",
    "pros": [
      "Most users think As above, I was tired of cavernous pockets (that",
      "Most users think You can clip things to it using two loops. What could be improved: - The",
      "Most users think * Gregory Rhune - really nice organisation, breathable, comfortable and great price * Rickshaw Bagworks Potrero - the pockets are great, it's comfortable and the company offers"
    ],
    "cons": [
      "Most users think Unless you're traveling to a place like New York that is literally everyt",
      "Most users think Pack 2 - still one of my favourite bags, it punches well above its weight as an everyday carry bag not just as a travel bag * The North Face Borialis Mini - like a child's backpack, small but perfectly",
      "Most users think As above, I was tired of cavernous pockets (that"
    ],
    "sentiment": 9.7,
    "num_mentions": 626
  },
  "Timbuk2 Never Check": {
    "name": "Timbuk2 Never Check",
    "pros": [
      "Most users think One pocket even has two t-shirts in size XL—the per",
      "Most users think In this case, I’ve stuffed my sec",
      "Most users think S breathable compared to the Aer and A19. - MR Rip Ruck 15 (new version): The material and design quality declined after Yeti acquired the company. - CPP1: I preferred the CPP2 due to its improved functi"
    ],
    "cons": [
      "Most users think Needless to say, I was excited whe",
      "Most users think Lacked flexibility for accommodating oddly shaped items. - GR0 RR (photo#6): My Dell laptop was a tight fit, and the back panel didn't seem as breathable compared to the Aer and A19. - MR Rip Ruck 15 (",
      "Most users think I actually selected it originally because I had the same"
    ],
    "sentiment": 8.6,
    "num_mentions": 590
  },
  "Tom Bihn Aeronaut 45": {
    "name": "Tom Bihn Aeronaut 45",
    "pros": [
      "Most users think This is the perfect bag for me. Love: the organization c",
      "Most users think This is the perfect bag for me. Love: the organization compa",
      "Most users think Very comfortable strap, even when I switch the bag to the front once im riding the train in"
    ],
    "cons": [
      "Most users think Packout is representative of a trip, I actually just grabbed some clothes and threw them in a cube without much thinking.) * Peak Design Packing Cube * 2 cotton tshirts (XL) * 2 Merino tshirts (XL)",
      "Most users think I did not wear the extras, but this is one place where I will not budge. Women’s bikini-cut",
      "Most users think I did not wear the extras, but this is one place where I will not budge. Women’s bikini-"
    ],
    "sentiment": 7.3,
    "num_mentions": 319
  },
  "Tom Bihn Synapse 25": {
    "name": "Tom Bihn Synapse 25",
    "pros": [
      "Most users think Gear list follows. **Bags** I guess it's not strict one",
      "Most users think Ich it actually worked incredibly well for. **Things I don't like about the synapse 25** Too Many Pockets - while initially I thought that it would be great to have a backpack with a lot of pockets (becaus",
      "Most users think The materials are incredibly durable and very high quality"
    ],
    "cons": [
      "Most users think Along the way|1|0.49|ounce| |**total weight**|&amp;nbsp;|&amp;nbsp;|0.68|pounds| **Clothing, outerwear** |**Wool &amp;amp; Prince Waffle Sweater**|crew neck merino sweater|1|10.56|ounce| :--|:--|:--|:-",
      "Most users think Synapse 25 #1 **Clothes (packing cube #6):** 4 T shirts 1 cotton long sleeve 1 tank top 6 underwear 4 pairs small socks 2 pair of wool socks #5 1 pair of swim trunks 1 pair of prana brion shorts",
      "Most users think Gear list follows. **Bags** I guess it's not strict oneb"
    ],
    "sentiment": 8.1,
    "num_mentions": 198
  },
  "Tom Bihn Synik 22": {
    "name": "Tom Bihn Synik 22",
    "pros": [
      "Most users think Wish that there is one or two more pockets in the main compart",
      "Most users think Style aside - the design just doesn't work for me - i never manage to use all of those pockets on the front - and I would give up all of that pocket organization for two, heck, even just one ext",
      "Most users think Unsurprisingly, was lighter to carry, but very surprisingly, felt crazy light"
    ],
    "cons": [
      "Most users think I didn’t think it would be annoying, but it is. I’m just not sure it’s",
      "Most users think Do you find it better than a heavy backpack",
      "Most users think And regarding the Synik itself (the bag design, no"
    ],
    "sentiment": 7.5,
    "num_mentions": 521
  },
  "Tom Bihn Synik 30": {
    "name": "Tom Bihn Synik 30",
    "pros": [
      "Most users think Style aside - the design just doesn't work for me - i never manage to use all of those pockets on the front - and I would give up all of that pocket organization for two, heck, even just one ext",
      "Most users think The 26L truly is the perfect size for me. Looks just like the 22L and 30L so n",
      "Most users think Looks like the perfect size"
    ],
    "cons": [
      "Most users think The material is really nice, soft, almost",
      "Most users think I didn’t think it would be annoying, but it is. I’m just not sure it’s",
      "Most users think For me, at least. I have an Everg"
    ],
    "sentiment": 7.8,
    "num_mentions": 473
  },
  "Tom Bihn Techonaut 30": {
    "name": "Tom Bihn Techonaut 30",
    "pros": [
      "Most users think I had to stack in front of my laptop, which limited how easily it could",
      "Most users think One of the other major reasons for mo",
      "Most users think This is the perfect bag for me. Love: the organization c"
    ],
    "cons": [
      "Most users think Part of the reason my sizing keeps going down is I'm gettin",
      "Most users think Do you find it better than a heavy backpack",
      "Most users think Yeoman turned out to be perfect. No extra unnecessary pockets an"
    ],
    "sentiment": 8.8,
    "num_mentions": 362
  },
  "Topo Designs Core Pack": {
    "name": "Topo Designs Core Pack",
    "pros": [
      "Most users think It is very durable but there is a weight penalty. If you re",
      "Most users think With this load, the bag is pretty full",
      "Most users think The [small top pocket](https://i.imgur.com/S58iVjY.jpg) is nice for e"
    ],
    "cons": [
      "Most users think Now that I have some experience with it, I figured I'd give a detailed run down of my thoughts for",
      "Most users think Stop at the KeeLung night market o",
      "Most users think You will be absolutely blind. I hate it. Now the website h"
    ],
    "sentiment": 7.4,
    "num_mentions": 262
  },
  "Topo Designs Global Travel Bag 30L": {
    "name": "Topo Designs Global Travel Bag 30L",
    "pros": [
      "Most users think I travel a bit for work, typically 2-5 day",
      "Most users think My golf bag carries my golf bag and golf shoes. The Thule compression cubes, 1 medium",
      "Most users think If you want a bag with pockets, this is the one. I experime"
    ],
    "cons": [
      "Most users think As you can imagine, my golf travel bag is huge",
      "Most users think M/gallery/fCMqXoC) &amp;#x200B; **SAMPLE PACKING LIST:** lighterpack: [https://lighterpack.com/r/nop399](https://lighterpack.com/r/nop399) &amp;#x200B; **Background:** I have owned many 24-32L [T",
      "Most users think Here goes nothing! &amp;#x200B; **Gear Used - 7 Day Trip** \\- [Topo Designs 30L Travel Ba"
    ],
    "sentiment": 9.4,
    "num_mentions": 295
  },
  "Tortuga Outbreaker 35L": {
    "name": "Tortuga Outbreaker 35L",
    "pros": [
      "Most users think I love my PCSB but the floppiness can be annoying- the high deni",
      "Most users think Great for all kinds of weather, including rainy days. I",
      "Most users think So 10 days was a great way to test and prep my one bag setup. As a test I also pac"
    ],
    "cons": [
      "Most users think Considering I’ll be wearing contacts but planes make my eyes very dry and I had some space, so why not? * Tech: * Sony A6000 inside case with zoom kit lens and a 35 mm prime lens * iPad mini 6 in",
      "Most users think Often going on trips with nothing more than a",
      "Most users think Bag for liquids * Naturehike Xpac pouch for passport + JR Passes &amp;#x200B; * Clothing: * Worn: modal tshirt, Public Rec jogger, Adidas Free Hiker (left side) * 3 more modal tshirts * 1 de"
    ],
    "sentiment": 9.2,
    "num_mentions": 181
  },
  "Tortuga Setout 45L": {
    "name": "Tortuga Setout 45L",
    "pros": [
      "Most users think The Forclaz pocket on",
      "Most users think Great value and great quality",
      "Most users think They are affordable and"
    ],
    "cons": [
      "Most users think The Forclaz does not have either feature. Verdic",
      "Most users think This little guy lets me globe-trot l",
      "Most users think Verdict: DRAW 8. External pockets: The Allpa has a water bottle holder, but it does feel quite tight, and I’m not sure how much do space there would be when the bag is completely full. The Forclaz ha"
    ],
    "sentiment": 9.4,
    "num_mentions": 290
  },
  "Tortuga Setout Divide": {
    "name": "Tortuga Setout Divide",
    "pros": [
      "Most users think I definitely need to slim down on some clothes I know! All the clothes in the",
      "Most users think And let’s face it, although we all pr",
      "Most users think The Forclaz pocket on"
    ],
    "cons": [
      "Most users think Will return whichever I don’t us",
      "Most users think All the clothes in the pics include the outf",
      "Most users think The Forclaz does not have either feature. Verdic"
    ],
    "sentiment": 10.2,
    "num_mentions": 380
  },
  "Tortuga Travel Backpack 40L": {
    "name": "Tortuga Travel Backpack 40L",
    "pros": [
      "Most users think Con: not a lot of cons bes",
      "Most users think For those able to keep their needs low, I recommend this",
      "Most users think I’m currently torn between"
    ],
    "cons": [
      "Most users think I packed more shirts than I probably need but",
      "Most users think I’ll be sink/hand washing underwear, socks, shorts along the way and",
      "Most users think Could I get rid of some stuff to make this bag work? Sure, and I still might as I’m still cons"
    ],
    "sentiment": 11,
    "num_mentions": 591
  },
  "Tropicfeel Nest": {
    "name": "Tropicfeel Nest",
    "pros": [
      "Most users think Perfect. Spain is amazin",
      "Most users think My MUST haves: +fast Laptop access +Water-bottle +Confy straps +good organisations +Practical compartments +beeing able to use daily +beeing somewhat waterproof Nice to have: +Blue or other cool colour",
      "Most users think Aesthetically I like it, however I did have to"
    ],
    "cons": [
      "Most users think Not thrilled about the cheap m",
      "Most users think I brought two pairs of shoes and the pair I was",
      "Most users think +nice inside material Current favourite: Tropicfeel Shell (199 Eur) + Size is expandable (big enough for weekend away or more) +useful inside organisation compartments +I like colour and design +"
    ],
    "sentiment": 10.4,
    "num_mentions": 671
  },
  "Tropicfeel Shell": {
    "name": "Tropicfeel Shell",
    "pros": [
      "Most users think My MUST haves: +fast Laptop access +Water-bottle +Confy straps +good organisations +Practical compartments +beeing able to use daily +beeing somewhat waterproof Nice to have: +Blue or other cool colour",
      "Most users think Aesthetically I like it, however I did have to",
      "Most users think I thankfully stumbled upon a second hand one on eBay and got it at 50"
    ],
    "cons": [
      "Most users think Not thrilled about the cheap m",
      "Most users think I brought two pairs of shoes and the pair I was",
      "Most users think +nice inside material Current favourite: Tropicfeel Shell (199 Eur) + Size is expandable (big enough for weekend away or more) +useful inside organisation compartments +I like colour and design +"
    ],
    "sentiment": 10,
    "num_mentions": 363
  },
  "Tumi Alpha Bravo Search": {
    "name": "Tumi Alpha Bravo Search",
    "pros": [
      "Most users think This unit is an urban version of North Face Baee Camp D",
      "Most users think Will use it for work and some classes, feels very solid, definitely has the TUMI premium feel and build quality (loved the orange stitching on the top hand",
      "Most users think At this price point, you’re paying"
    ],
    "cons": [
      "Most users think When Tumi wants to get rid of their s",
      "Most users think Now please Make pikachu wear it",
      "Most users think Not sure if there have been changes. Things I carry in it: Laptop, IPad, leather portfolio, a few"
    ],
    "sentiment": 8.2,
    "num_mentions": 274
  },
  "Tumi Voyageur Calais": {
    "name": "Tumi Voyageur Calais",
    "pros": [
      "Most users think T I'd love some The Row reps :) just had an amazing conversation with a friend about the future of \"comfortable, high quality fashion\" and the Olsens were part of it :)",
      "Most users think I am not a chick, but I'd love some The Row reps :) just had an amazing conversation with a friend about the future of \"comfortabl",
      "Most users think Literally brought it home and dropp"
    ],
    "cons": [
      "Most users think I am not a chick, but I'd love some The Row reps :) just had an amazing conversation with a friend about th",
      "Most users think It has a light scratch, read online",
      "Most users think Backpacks are backpacks, and they're going to get scratche"
    ],
    "sentiment": 6.4,
    "num_mentions": 481
  },
  "ULA Atlas": {
    "name": "ULA Atlas",
    "pros": [
      "Most users think Link: [https://sharing.spaceflightsimulator.app/rocket/VIVj\\_OfVEe2dP7uAd13aUA](https://sharing.spaceflightsimulator.app/rocket/VIVj_O",
      "Most users think At I've seen in this thread: |Fewer Letters|More Letters| |-------|---------|---| |[BE-4](/r/Spaceflight/comments/1fwdmbr/stub/lqi63sr \"Last usage\")|Blue Engine 4 methalox rocket engine, developed by Blue",
      "Most users think The Starliner crewed test flight, currently scheduled for Friday 17th Ma"
    ],
    "cons": [
      "Most users think There is a reply feature and no this ain't yours",
      "Most users think Atlas V Heavy existed only as a concept. By contrast the Del",
      "Most users think Not recoverable, but they're looking at something called 'Smart Reuse', where just the engine segment"
    ],
    "sentiment": 5.4,
    "num_mentions": 326
  },
  "ULA Circuit": {
    "name": "ULA Circuit",
    "pros": [
      "Most users think All of the packing cubes are filled to ~80-",
      "Most users think It got uncomfortably heavy for daypack use even though the harness it",
      "Most users think ULA Spark is rated to 20L in the main compartment. Overstuffed and using the side p"
    ],
    "cons": [
      "Most users think It got uncomfortably heavy for daypack use even though the harness itself was comfortab",
      "Most users think Evergoods CHZ22 - Hated the laptop compa",
      "Most users think Those pants are bulky. About the same overall capacity as the Spark, but this is pa"
    ],
    "sentiment": 7.9,
    "num_mentions": 293
  },
  "ULA Dragonfly Ultra": {
    "name": "ULA Dragonfly Ultra",
    "pros": [
      "Most users think I love love love the side stretch water bottle pockets. It turns out to be super convenient and I",
      "Most users think It looks so small to the untrained observer but like the Tardis, it's s",
      "Most users think I was able to fit in ultra-light sandals and hand wipes. But anything no"
    ],
    "cons": [
      "Most users think It turns out to be supe",
      "Most users think Secondly, I've been traveling more",
      "Most users think But here is the 30L packed out with some front and side measurements. Will post the 36 next"
    ],
    "sentiment": 9.2,
    "num_mentions": 298
  },
  "Vaude Citygo 23": {
    "name": "Vaude Citygo 23",
    "pros": [
      "Most users think Throw a rain cover over it. Probably an awful idea",
      "Most users think I've had this idea re"
    ],
    "cons": [
      "Most users think I've had this idea re",
      "Most users think Hypalon additions and",
      "Most users think It weighs roughly 1250 grams, so not really UL. All se"
    ],
    "sentiment": 7.2,
    "num_mentions": 60
  },
  "Vaude Wizard 30+4": {
    "name": "Vaude Wizard 30+4",
    "pros": [
      "Most users think The winners, please go to and read [my post from earlier this year](https://www.reddit.com/r/BlackClover/comments/u604vi/looking_at_the_top_10_across_all_5_shonen_jump/) For this post, I've included the",
      "Most users think It is very comfortable even when fully loaded. I think it is balanced casual/formal if n",
      "Most users think It is very comfortable even when fully loaded. I think it is balanced casual/formal if"
    ],
    "cons": [
      "Most users think Ps://www.shonenjump.com/j/sp_bclover/result6/index.html) I had a realization! in the 5th poll IT'S NOT Luck, Charlotte, Gauche in the top 10 -- it's them *AND THEIR ELF COUNTERPARTS* ~~how did i miss t",
      "Most users think Put on a heavy hiking pack and tighten the waist strap and it is going to feel...heavy because it is heavy. :D Pu",
      "Most users think Don’t want it to be enormous, but want to be able"
    ],
    "sentiment": 7.8,
    "num_mentions": 218
  },
  "Wandrd Duo Daypack": {
    "name": "Wandrd Duo Daypack",
    "pros": [
      "Most users think My main complaint from the CPP was the tiny water bottle pocket",
      "Most users think Pair of merino wool socks. * Most of my clothes is Western Rise, seems like promotion but I really love their clothes lol. * My tech is mostly Apple, and I only goes USB-C (except for lightning). * TSA-a",
      "Most users think Definitely much more elegantly integrated into the bag than they are on the PRVKE"
    ],
    "cons": [
      "Most users think The zip pocket against the back panel, however, is kind of poorly placed. I think",
      "Most users think Looks like the key changes are: * non-hooped hyperlon zipper pul",
      "Most users think It has a nice padded phone sleeve and can easily fit a"
    ],
    "sentiment": 9.5,
    "num_mentions": 362
  },
  "Wandrd PRVKE 31L": {
    "name": "Wandrd PRVKE 31L",
    "pros": [
      "Most users think The weather is supposed to b",
      "Most users think I got the newer version",
      "Most users think It’s not a cheap bag by any means but it is re"
    ],
    "cons": [
      "Most users think For this trip I only plan on",
      "Most users think White sneakers are my go to for ca",
      "Most users think Not pictured is the travel-ish tripod that straps to the side of the bag. It’s not a cheap bag by a"
    ],
    "sentiment": 8.6,
    "num_mentions": 321
  }
}