{
  "name": "Axiom Gear 24L",
  "imageThreads": [
    {
      "image": "https://preview.redd.it/9ey58ris68k61.jpg?width=1080&crop=smart&auto=webp&s=527eb37d92ea0fa69df7cac7c29800c9bf852aac",
      "thread": {
        "title": "Looking for help with panniers. Any opinions between these waterproof rear panniers for long tours: Classic Ortliebs, Axiom Oceanweave Seymour or Monsoon, Arkel Orca or Dolphin. Any advice would be greatly appreciated! Photo for attention.",
        "url": "https://www.reddit.com/r/bicycletouring/comments/luguw0/looking_for_help_with_panniers_any_opinions/",
        "selftext": "",
        "author": "RunBikeClimb114",
        "score": 124,
        "numComments": 76,
        "created": 1614521164,
        "comments": [
          {
            "author": "[deleted]",
            "body": "I’ve never used anything but my Ortliebs. But I can confirm that even in torrential downpours, everything in the bags stay very, very dry. I love them!",
            "score": 30,
            "created": 1614531045,
            "replies": [
              {
                "author": "funkyDaikon",
                "body": "Came here to say the same. Ortliebs are the best investment IMO.",
                "score": 7,
                "created": 1614542785
              },
              {
                "author": "worn-out-knees",
                "body": "When Ortlieb says waterproof they mean you can swim across a river with it and will probably still be dry. A bit heavy and expensive but after a day of riding in rain having dry clothes/towel/everything else is priceless.",
                "score": 7,
                "created": 1614564103
              }
            ]
          },
          {
            "author": "owlpellet",
            "body": "I use Ortleib Backrollers daily. Good latches, very stable on the bike. Widely adjustable. Water and dirt proof. Big dumb buckets, rather than small clever pockets, which is my preference. I didn't have these while touring, and I spent hours digging through zipper pockets looking for some tool or other.",
            "score": 16,
            "created": 1614529814,
            "replies": [
              {
                "author": "POTATO_IN_MY_DINNER",
                "body": "And you can pretty easily get spares or replacement bits",
                "score": 3,
                "created": 1614544236
              }
            ]
          },
          {
            "author": "Ktn44",
            "body": "Arkels are great in general, never had the orca or dolphin however. Is that Mt Yale?",
            "score": 14,
            "created": 1614521589,
            "replies": [
              {
                "author": "JeffCarr",
                "body": "I'm a big fan of Arkels.  The bags are great, and their quick release cam system works extremely well too.  I've customized mine so that the quick release pull comes off, making it very hard to remove the bags without it.  It's basically a way to lock the panniers to the rack without adding extra weight.  Might be nice to think about if you're looking for a way to secure your bags on a long tour.\n\nYou can also buy the quick releases separately if you want to add them to another bag if you prefer a different bag and don't mind a little more expense and a bit of diy.",
                "score": 10,
                "created": 1614526136
              }
            ]
          },
          {
            "author": "halfwheeled",
            "body": "I can only praise my Ortlieb Classic Roller Rears. 20 years old. Never leaked. Over 80weeks use on 40 plus 2 week tours. I have no experience of any other pannier and never will.",
            "score": 13,
            "created": 1614533661,
            "replies": []
          },
          {
            "author": "Low-Fig429",
            "body": "My orcas’s are great. Love the latch system - super secure.",
            "score": 9,
            "created": 1614523666,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/e6387t3t9rid1.jpeg?width=1080&crop=smart&auto=webp&s=3388a81d2a3025a7ca0ada29151f5676f2a04a98",
      "thread": {
        "title": "Still searching for the perfect bag",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1esmays/still_searching_for_the_perfect_bag/",
        "selftext": "I’ve been on the search for the perfect bag and haven’t nailed it yet but I’m hoping you guys have some suggestions. Just for context, I’m a 29M that works in IT and travels fairly often. I don’t commute on public transit and I keep my edc fairly minimal and compact. Here is a brief summary of the bags I own and my personal opinion on each one.\n\nTAD Axiom 24: My first big bag purchase. Loved it and it was my daily for over a year but soon left me wanting for something with better feeling materials and less bulk. Admin pocket on the front is probably my favorite feature and the side “water bottle” pockets are great for long term storage of stuff I rarely need and don’t want in the way. \n\nNutsac Satchel 15: Great materials and feel. Organization is heavily pouch/organizer based and I tried but it wasn’t for me. Might be a me thing but the shoulder strap pulled on my clothes and was uncomfortable.\n\nBlack Ember Forge 20: similar issue to the nutsac when in satchel mode so I never used it like that. Backpack mode carried fairly well but it always felt small on me. Organization was great. Materials also solid. The layout definitely favors the satchel mode so things would often shift while carrying in backpack mode.\n\nFilson Journeyman: materials were great but felt like a $150 to $200 bag with a $200 logo. Lacking organization and looked a bit weird when it wasn’t fully packed out and sat very far off the back when it was. \n\nTAD Axiom S2 WX: My favorite work/get sh*t done bag. Organization is great to set next to me and have all tools and gear readily available. Materials are incredibly durable(almost too much) and it has the same pockets I loved on the original Axiom 24. The downsides are that the back panel definitely takes some breaking in and is almost too stiff. I’ve heavily considered removing the plastic sheet in the back just so it conforms to my back a little better. Straps are all over the place and I use Velcro to tame them but it’s worth mentioning. It is also a fairly heavy bag. \n\nArktype dashpack: I love this bag for everyday carry. It is just floppy and slim enough to sits perfectly on your back without feeling like it’s pulling you off balance. There is basically no floppy anything on it so it’s great for the motorcycle. Back laptop compartment feels like an after thought and completely ruins the comfort of the bag when used. Luckily they also added an internal drop style laptop sleeve and using that makes a world of difference. Front zipper pocket is terrible. One single strand of elastic with varying sizes that are too big for pens but too small for anything larger. You could use them for cables but good luck not going insane every time you try to put them back in. Interior organization in the main pocket is great and gives you a few pockets to keep things accessible but out of the way. \n\nSo that leads to my “grail” bag that I have yet to find. From what I’ve used and what I dislike and like about the bags, here is my perfect bag:\n\nForm factor: 16-20L and carry’s close to the back\n\nMaterials: Traditional canvas that isn’t too heavy or stiff\n\nSturdiness: Decent padding on back but still conforms to spine\n\nPockets: front admin pocket with organization that opens downwards and presents everything in it like the axiom. A top “sunglass” pocket is also very desired for things like keys, AirPods, flash drives, and general dump.  I also don’t care if the laptop sleeve is its own dedicated pocket or just a padded sleeve in the main pocket. \n\nWater bottle: I don’t care if it has water bottle pockets or not.\n\nStraps: the axiom straps are too thick. Arktype and Filson are very close to perfect. \n\nExtra “nice to haves”: leather accents on the bottom similar to the nutsac for durability would be great. I also tend to use the external webbing for random things whether it’s on the back of the Arktype or the straps on the Axiom.\n\nLet me know if you have any suggestions on the next pack I should try. Love you. ",
        "author": "SweetJesusBatman",
        "score": 122,
        "numComments": 91,
        "created": 1723696211,
        "comments": [
          {
            "author": "chigoku",
            "body": "There is no perfect bag. As soon as you change one thing you carry, or where you're going, all of the sudden your needs change and the bag isn't perfect anymore. That's why we all have many bags.",
            "score": 91,
            "created": 1723697690,
            "replies": [
              {
                "author": "MezcalFlame",
                "body": "This is slowly what I'm starting to agree with.\n\nJust like \"one size fits most\" is not really a solution for everyone.",
                "score": 10,
                "created": 1723698371
              },
              {
                "author": "SweetJesusBatman",
                "body": "haha fair point, I literally thought the axiom 24 was my perfect pack until the crackling of the material got to me.",
                "score": 2,
                "created": 1723697880
              }
            ]
          },
          {
            "author": "gingerfiggle",
            "body": "I just picked up a Gregory Rhune 22 and am loving it so far.",
            "score": 7,
            "created": 1723697519,
            "replies": [
              {
                "author": "SweetJesusBatman",
                "body": "that one is very tempting, how are the materials?",
                "score": 1,
                "created": 1723698038
              }
            ]
          },
          {
            "author": "aritex90",
            "body": "Man, I think I’ve looked at dozens of bags on my quest for a daily, and I still can’t decide what I want to do.",
            "score": 7,
            "created": 1723698124,
            "replies": [
              {
                "author": "SweetJesusBatman",
                "body": "hopefully this thread will help you as much as it does me.",
                "score": 2,
                "created": 1723698277
              }
            ]
          },
          {
            "author": "zacs",
            "body": "Limiting to canvas limits your options. I have a couple slings from Defy and love their waxed canvas. I haven’t felt the fit, but the [Defy Bucktown](https://defybags.com/products/bucktown-backpack-black-wax-canvas) could fit the bill. Its admin panel looks nice. Defy’s craftsmanship is excellent.",
            "score": 6,
            "created": 1723701649,
            "replies": [
              {
                "author": "SweetJesusBatman",
                "body": "I think the Bucktown might be it. I was so busy drooling over the recon I completely looked over their backpacks. I know Defy has insane quality, ive just never pulled the trigger.",
                "score": 3,
                "created": 1723702026
              }
            ]
          },
          {
            "author": "BraveTurtle85",
            "body": "I used to hate the look of the alpha one niner evade but now, it's my favourite bag! It's the best overall bag for me",
            "score": 5,
            "created": 1723721936,
            "replies": []
          }
        ]
      }
    }
  ]
}