{
  "name": "Black Diamond Stonehauler 45",
  "imageThreads": [
    {
      "image": "https://external-preview.redd.it/IHogdZQ7kLXhxsfcIk-62-hEASFO5H9BUA1irmpbP4I.jpg?width=1080&crop=smart&auto=webp&s=ff694ace318fa6d2b492eb6003f7d83db851f606",
      "thread": {
        "title": "&gt;40L carry-on backpack duffle recs ",
        "url": "https://www.reddit.com/r/onebag/comments/1cs1qvw/40l_carryon_backpack_duffle_recs/",
        "selftext": "My main travel bag is the 40L Topo Designs Mountain Duffle. I’ve carried it on tons of flights both international and domestic. I like the simplicity and padded structure.\n\nPreviously, I did one trip with their Global Travel Bag and hated all the stupid pockets and extra material, it felt like it had tons of compartments but no space. I guess I just like a big open bag. I don’t even really utilize the external side pockets on the Mountain Duffle, though I like the internal mesh pocket for this and that.\n\nBeen hitting a wall though with 40L on trips of around two weeks, particularly if I need to bring clothes for multiple activities/climates or need a second pair of shoes, like dress shoes or hiking boots. The bag is stuffed! \n\nI have a three week trip coming up and want something slightly bigger, but not so big that it precludes carry on. \n\nHere’s what I’m looking at and what I like about them:\n\nPatagonia Black Hole 55L - It is what it is, seems like the perfect size but isn’t particularly exciting. \n\nBlack Diamond Stonehauler 60L - Looks nice and I like the integrated bag for dirty laundry/shoes.\n\nThe North Face Base Camp Voyager 62L - I like the external pocket for shoes/laundry, but feels flimsy and the backpack straps in the lid seem weird. Worried it would be too big, but I bought one to check it out and it’s not substantially bigger than my 40L Mountain Duffle. See pics. \n\n\n\n",
        "author": "saalmotrutta",
        "score": 2,
        "numComments": 17,
        "created": 1715717216,
        "comments": [
          {
            "author": "Projektdb",
            "body": "Your about at the max safe carry-on alteady. Anything over 22\" is technically too large. Sometimes you'll be ok, sometimes it'll end up checked at cost at the gate.\n\nMy wife packed a 45L duffel that was listed at 22\" on the website. It was absolutely stuffed. We got through the gate, but it was a smaller regional jet (still listed 22\" max) and the flight was packed. The overheads were completely stuffed throughout the plane and it took both of us to stuff it into the only spot left and get the door shut.\n\nThis was the first time she tried one bagging and she gets embarrassed easily. She used that bag a few more times, but I swear she left it 1/4 empty after that.\n\nAnecdotal, but anything over 22\" is definitely risky. I've seen people board with much larger bags, but I've seen people get force checked as well.\n\nCan you add a personal item backpack instead? You can get another 20-25L that way.",
            "score": 5,
            "created": 1715756276,
            "replies": []
          },
          {
            "author": "Captndad",
            "body": "You may want to look at the Osprey Porter.",
            "score": 3,
            "created": 1715738933,
            "replies": [
              {
                "author": "saalmotrutta",
                "body": "Thanks, seriously considering the Osprey Farpoint TREK",
                "score": 1,
                "created": 1716309846
              }
            ]
          },
          {
            "author": "cliff0217",
            "body": "Don’t have a recommendation. Only to say I think the REI anniversary sale starts May 17…and all their store branded duffels are 30% off.\n\nOptions.",
            "score": 3,
            "created": 1715743965,
            "replies": [
              {
                "author": "weeddealerrenamon",
                "body": "Oh shit, thank you for reminding me, I'm definitely getting a big haul",
                "score": 1,
                "created": 1715799977
              }
            ]
          },
          {
            "author": "Crazeeeyez",
            "body": "Isn’t carryon max size 45L?  Tom Bihn Techonaut 45 has backpack and duffel carry modes. Also the mystery ranch mission rover 45. Both great bags.",
            "score": 3,
            "created": 1715744800,
            "replies": [
              {
                "author": "saalmotrutta",
                "body": "Technically yes, practically it’s whatever you can get away with.",
                "score": 2,
                "created": 1716309791
              }
            ]
          },
          {
            "author": "SeattleHikeBike",
            "body": "I wouldn’t be carrying anything more for three weeks than I would for a week. Laundry happens. Extra toys and boots are always the bane of onebagging. \n\n55+ liter bags are all outside the general limits for carry on. It’s just part of the game. You may run into weight limits too.",
            "score": 3,
            "created": 1715786947,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/5ev6327eqfqb1.jpg?width=1080&crop=smart&auto=webp&s=2bd8874e288ac5053eca9141e95794620f37a4ba",
      "thread": {
        "title": "Recommendations for durable/heavy duty gym bags?",
        "url": "https://www.reddit.com/r/BuyItForLife/comments/16ry12a/recommendations_for_durableheavy_duty_gym_bags/",
        "selftext": "Seeking recommendations for durable/heavy duty duffel style gym bags. My boyfriend is a daily gym goer and his current duffel bag (off brand from Amazon) is in bad disrepair. Inner lining torn, side pickets and zippers separated, it’s a mess. Seeking to spend $100-$150 on a high quality, durable bag that will last years. What are the best brands at that price point?",
        "author": "nopenopershin",
        "score": 53,
        "numComments": 71,
        "created": 1695662234,
        "comments": [
          {
            "author": "JohnnyWall",
            "body": "I always recommend King Kong bags, they are well designed and durable. https://knkg.com/collections/duffels",
            "score": 30,
            "created": 1695664310,
            "replies": [
              {
                "author": "nopenopershin",
                "body": "Thanks for the rec! I ended up going with king kong",
                "score": 7,
                "created": 1695677826
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[removed]",
            "score": 27,
            "created": 1708466576,
            "replies": [
              {
                "author": "AutoModerator",
                "body": "Hello /u/Neat_Tree4902! Your post or comment was removed for using an Amazon Affiliate link or Reference (see Rule 8). You can change the URL and re-post it.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BuyItForLife) if you have any questions or concerns.*",
                "score": 1,
                "created": 1709231063
              }
            ]
          },
          {
            "author": "sparky750",
            "body": "Northface basecamp makesure you get the correct size as some of them are massive, I used a large one travelling the world on oil rigs for about 15 odd years and a smaller version of the same bag is my gym bag absolutely bomb proof",
            "score": 16,
            "created": 1695672472,
            "replies": [
              {
                "author": "weakleg",
                "body": "Came here to pile on re: North Face Basecamp bags.  An XS is a good size bag for the gym, IMHO.",
                "score": 8,
                "created": 1695677396
              },
              {
                "author": "TreeBeard-7",
                "body": "Second for the Basecamp\n\nI've got several, and I think the large one is the one I use to haul about fifty pounds of personal equipment from truck to truck each shift. It's holding up very well.",
                "score": 2,
                "created": 1695772585
              }
            ]
          },
          {
            "author": "BuckTheStallion",
            "body": "I have an adidas that has seen near daily use since I was a teenager (probably 13ish), I’m 35 years old. No idea if their quality is still up to snuff, but I still use adidas for most of my athletic needs, and they’re still proving to be consistently durable.",
            "score": 10,
            "created": 1695663772,
            "replies": [
              {
                "author": "Horkosthegreat",
                "body": "Sadly Adidas, just like many similar brands, Nike, Quicksilver etc. are completely different then they were we are young. I have Quicksilver shirts from early 2000s, that are still going good while the one I bought in 2020 had holes after 1 years.",
                "score": 11,
                "created": 1695727127
              }
            ]
          },
          {
            "author": "endangeredstranger",
            "body": "patagonia black hole",
            "score": 9,
            "created": 1695678324,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/573b8w1h56ne1.jpeg?width=320&crop=smart&auto=webp&s=a2f4e1f5d586facc1bda927622653035f260eb0c",
      "thread": {
        "title": "I need a backpack that is like this.",
        "url": "https://www.reddit.com/r/backpacks/comments/1j5bosc/i_need_a_backpack_that_is_like_this/",
        "selftext": "I need a backpack that looks like this and can fit a 17.3\" laptop and that is 50l with side straps as well.",
        "author": "Jmesparza05",
        "score": 10,
        "numComments": 18,
        "created": 1741310279,
        "comments": [
          {
            "author": "Hizu69",
            "body": "Have you thought about buying one?",
            "score": 12,
            "created": 1741312042,
            "replies": [
              {
                "author": "Jmesparza05",
                "body": "If I knew what to look for yeah",
                "score": 1,
                "created": 1741312237
              }
            ]
          },
          {
            "author": "Interesting_Tower485",
            "body": "kinda close? you'd need to check the actual laptop compartment dimensions which aren't listed on the page: [https://www.patagonia.com/product/black-hole-mlc-convertible-travel-backpack-45-liters/195699025073.html](https://www.patagonia.com/product/black-hole-mlc-convertible-travel-backpack-45-liters/195699025073.html)",
            "score": 3,
            "created": 1741313376,
            "replies": []
          },
          {
            "author": "Usual_Excellent",
            "body": "That's 50l? Oof don't see any harnesses , rip back",
            "score": 2,
            "created": 1741351267,
            "replies": []
          },
          {
            "author": "JFFIASCO",
            "body": "The Matador Globerider is pretty good at 42L. 50L is gonna be hard to find for a traditional backpack, unless you're open to duffel hybrids",
            "score": 2,
            "created": 1741313198,
            "replies": [
              {
                "author": "Willing-Permission94",
                "body": "Was going to suggest Globerider as well. GORUCK GR3 might be of interest",
                "score": 2,
                "created": 1741358912
              }
            ]
          },
          {
            "author": "ccagan",
            "body": "Osprey Daylite 44L or 35L depending on your needs. New Osprey Transporter series are out but the lid config is a bit different than what you posted.",
            "score": 1,
            "created": 1741318745,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/ulsu8a4ri6ye1.png?width=640&crop=smart&auto=webp&s=ed2b6df676c8ae90aec18b47b43a4b3b325078c0",
      "thread": {
        "title": "What are we using to pack for week-long summer camp these days?",
        "url": "https://www.reddit.com/r/BSA/comments/1kc9v1m/what_are_we_using_to_pack_for_weeklong_summer/?tl=fr",
        "selftext": "When I was a Scout it was popular to use steamer-type trunks like [this](https://www.homedepot.com/p/Seward-Trunk-Seward-Explorer-30-in-Trunk-with-Wheels-Lock-Misty-Blue-SWD6113-36/313849926?source=shoppingads&amp;locale=en-US&amp;srsltid=AfmBOooGQuuwLERjfv-CabGZquodPitS29d0ye3gz3tvapB5sX3EYX3APqY&amp;gQT=1), but they weren't particularly durable and didn't handle getting wet very well. Now I'm looking at plastic trunks like [this one](https://www.cabelas.com/p/plano-sportsmans-large-wheeled-trunk?ds_e=GOOGLE&amp;ds_c=Cabelas%7CShopping%7CPMax%7CCatchAll%7CGeneral%7CNAud%7CGoogle%7CNMT&amp;gad_source=1&amp;gclid=Cj0KCQjw8cHABhC-ARIsAJnY12yPv6khLsspODO_rQZybCtupLVAadkFcimhE_lJf9BbzmHaELxzHvkaAhJfEALw_wcB&amp;gclsrc=aw.ds), but wanted to see if anybody else had other ideas or experience. Thanks!",
        "author": "Enginerdad",
        "score": 115,
        "numComments": 146,
        "created": 1746109090,
        "comments": [
          {
            "author": "mctaco",
            "body": "I just wish we didn’t travel with so much STUFF.",
            "score": 56,
            "created": 1746113152,
            "replies": [
              {
                "author": "Prize-Can4849",
                "body": "I'm the ultralight backpacking ASM, so I'm trying my best to lighten up our Troop on outings.   \nThey are learning...slowly.\n\n\nMy catchphrase is \"Less is More\"\n\n\nLess weight = more fun, more miles\nLess stuff = more time not cleaning up, more stuff not \"lost\"",
                "score": 35,
                "created": 1746120432
              }
            ]
          },
          {
            "author": "RosewoodPaddle",
            "body": "Those black totes with yellow lids from costco",
            "score": 49,
            "created": 1746110668,
            "replies": [
              {
                "author": "randynewman1880",
                "body": "Yep!  They fit perfectly under the standard summer camp cot!  Pro tip when packing: put a daily outfit in a separate dry bag for each day the scout is  there so they can take it directly the showers, change, then put the dirty clothes in a laundry bag so the bin stays organized throughout the week!\n\nAnd then be appalled as a parent when the outfits come back unopened and unworn.\n\nEdit: spelling.",
                "score": 20,
                "created": 1746128291
              },
              {
                "author": "oklahomahunter",
                "body": "100% - Put your name in black marker on all 4 sides and the top.  If it doesn’t fit in it then it doesn’t need to come with us.",
                "score": 8,
                "created": 1746120965
              }
            ]
          },
          {
            "author": "TwoWheeledTraveler",
            "body": "I don't use them for summer camp any more, but those Plano sportsmans cases like in your picture are awesome. I bought one for camp years ago and now I have several of them that I use for camping gear storage in my basement. They stack, they're durable, they're just overall good.",
            "score": 23,
            "created": 1746110445,
            "replies": [
              {
                "author": "sumo_steve",
                "body": "Pro tip, wedge foam weather stripping in the lid channel and they become dust resistant (important for roof rack travel).",
                "score": 3,
                "created": 1746156461
              },
              {
                "author": "CarlWeezley",
                "body": "Upvote for the Plano Sportsman. They lock, have wheels and stack well. Probably a bit larger than they need to be, but as a scouter who no longer goes to summer camp (![gif](emote|free_emotes_pack|cry)), they make great garage storage for all my camping gear. Mind that we only use these for summer camp, not for weekend camping or high adventure (obviously.)",
                "score": 2,
                "created": 1746187475
              }
            ]
          },
          {
            "author": "nweaglescout",
            "body": "I used those trunks when I was in staff but as a participant we had to pack everything in so everybody used a hiking pack. Our pack was over 1000 acres and the farthest campsite was over a mile from the flag field",
            "score": 17,
            "created": 1746112118,
            "replies": [
              {
                "author": "[deleted]",
                "body": "[removed]",
                "score": 1,
                "created": 1746165995
              }
            ]
          },
          {
            "author": "Deep-Hovercraft6716",
            "body": "What? \n\nWe always just packed everything in our backpacks. How would you even get this to the site?",
            "score": 17,
            "created": 1746112178,
            "replies": [
              {
                "author": "AshnodX",
                "body": "In the southeast, this has been a thing for a long time. My older son uses the same footlocker that I brought to summer camps as a scout 25+ years ago. It's on the official packing list for every summer camp (that we've been to).\n\nThe standardized, stackable shape also makes it easier to pack a troop trailer. Compared to soft bags or irregular shaped backpacks. Some camps allow troops to park trailers at the site. Other camps will at least allow the troops to unpack the trailer at site and park it elsewhere. So getting it into the camp is not a problem.",
                "score": 17,
                "created": 1746116342
              },
              {
                "author": "Drummerboybac",
                "body": "This is for summer camp specifically. So they have trucks that bring these to your site, and there’s room for them in the canvas platform tents",
                "score": 9,
                "created": 1746132033
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/e3jro6ibdxdb1.jpg?width=1080&crop=smart&auto=webp&s=eff773224a68fbebad275e9c63c70d4ca9d6d8ec",
      "thread": {
        "title": "Thinking of buying this big hog (80L) for grocery runs and hauling a lot of gear to work, any comparable alternatives you'd recommend?",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/158cmrx/thinking_of_buying_this_big_hog_80l_for_grocery/?tl=nl",
        "selftext": "",
        "author": "Mezmerik",
        "score": 18,
        "numComments": 45,
        "created": 1690209733,
        "comments": [
          {
            "author": "[deleted]",
            "body": "Honda civic",
            "score": 128,
            "created": 1690214166,
            "replies": [
              {
                "author": "pinkcollarworker",
                "body": "This made me laugh. I’m glad you aren’t being downvoted for it.",
                "score": 5,
                "created": 1690247744
              }
            ]
          },
          {
            "author": "SeattleHikeBike",
            "body": "Get something with a load transferring harness if you are going to carry that much stuff. \n\nRead up on load transferring harness and fitting here: https://hillpeoplegear.com/packfitment",
            "score": 13,
            "created": 1690216422,
            "replies": []
          },
          {
            "author": "[deleted]",
            "body": "The harness can't transfer the weight properly to your body. You will curse a lot, if you really load that pack.",
            "score": 11,
            "created": 1690218867,
            "replies": [
              {
                "author": "FlanOfAttack",
                "body": "Yeah I have the smaller version of this and it's just a sack with zero structure.  Looks cool, but lives on the shelf.",
                "score": 1,
                "created": 1690226687
              }
            ]
          },
          {
            "author": "AQuietMan",
            "body": "Gregory Baltoro. The REI outlet store often has the big ones (75+ liters), used, at a reasonable price.",
            "score": 10,
            "created": 1690216678,
            "replies": [
              {
                "author": "chrisabraham",
                "body": "&gt;Gregory Baltoro\n\nI think he wants a cool courier style BAB (big ass bag) and not a dorky load balanced trek bag :)",
                "score": 3,
                "created": 1690237435
              },
              {
                "author": "Bkozi",
                "body": "I second this. I have the 95, and it's the only bag I would load all the way and expect to walk anywhere.",
                "score": 2,
                "created": 1690232148
              }
            ]
          },
          {
            "author": "iamgreengang",
            "body": "get a pannier. you will have a much better time",
            "score": 6,
            "created": 1690225431,
            "replies": []
          }
        ]
      }
    }
  ]
}