{
  "name": "Eagle Creek Tour Travel Pack 40L",
  "imageThreads": [
    {
      "image": "https://preview.redd.it/q6wf3ufzm5pc1.jpg?width=2100&format=pjpg&auto=webp&s=8d836d12240676101dfd79f1a1184c5b8ad3f898",
      "thread": {
        "title": "15 Days in Lund (Sweden) — Packing List &amp; Backpack Decision Help",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1bi1erm/15_days_in_lund_sweden_packing_list_backpack/",
        "selftext": "(Sorry in advance, super long post)\n\nHi guys,\nI'd like your advice! In April, I will be doing my first onebagging trip. I’m going to Lund, Sweden, for 15 days as a work trip and then spend 2 more days in Copenhagen to see the city.\nI've never attempted onebagging before, but I'm eager to try it out (or rather 1.5-bagging as I'll have a daypack on me as well). So please bear with me if there is way too much stuff on my packing list! I'll probably check my main backpack as it's paid for by work anyways.\n\nMy bag will likely be the Eagle Creek Tour Travel Pack 40l or the Osprey Fairview 40l. I have both bags here to try them out, but I haven't decided yet which to keep. As for a daypack, I have the Osprey Fairview Daypack here to try out, but I'm happy to get recommendations for other daypacks available in Germany (similar size or a little smaller, packable, and a laptop compartment would be perfect).\n\nApparently, I will have access to a laundry room, but still, I want to have at least a little variety in my outfits as it's a work trip (luckily the dresscode will still be quite casual).\nI guess I will be inside most of the time and thus don't really need too many warm clothes. Also, I feel like I can layer the clothes that I plan for already rather decently.\n\nSo, here's my current packing list:\n\n## Daypack (Hand Luggage)\n- Wallet with stuff that goes into a wallet\n- Refillable water bottle (0.5l)\n- Packable tote bag\n- Phone + charging cable\n- Watch + charging cable\n- Charging brick (for watch and phone, must be USB-C because of charging cable for watch)\n- In-ear headphones\n- iPad (would be very nice for work but needs extra charging brick and charging cable because of Lightning, duh)\n- Kindle\n- Laptop\n- Presenter, as I will have to give a talk at some point\n- AirTag \n- One set of undies and socks to mitigate single points of failure lol (i.e. main bag gets lost)\n- Some snacks\n- Liquids Bag: Deodorant, hand sanitizer, ibuprofen: 1-2x, chapstick\n\n## Main Backpack\n- Charging brick and cable for laptop\n- Computer mouse (still undecided, would be nice for work)\n- AirTag\n\n### Clothing\n- Longsleeves: 2x\n- Blouses: 2x\n- Sweaters: 1x\n- Jeans: 1x (in winter, I wear jeans almost exclusively)\n- Head band, gloves (depends on weather forecast)\n- Sets of undies and socks: 5x\n- Base layers: 2x (tank tops, maybe Heattech?)\n- Pyjamas: 1x\n- Sports: 2 leggings (also for layering underneath jeans and chilling at home, thus 2), 1 shirt, 1 sports bra\n- Shoes: trail-runners (GoreTex), Adidas Adilettes (also for wearing at home with socks)\n\n### Washing Bag\n- Toothbrush, small toothpaste\n- Face wash (decanted into contact lens case)\n- Face cream (already half empty, will be empty at end of trip, then throw away)\n- Tiny eyebrow pencil\n- Concealer (decanted into contact lens case)\n- Hairbrush, some bobby pins, hair ties\n- Plasters, blister plasters, some more ibuprofen\n- Shampoo bar\n- Shaver\n- Small hand lotion\n\nWhat I will wear when travelling (i.e. doesn't need to fit into the backpack):\n- Jeans\n- T-shirt\n- Sweater\n- Thin scarf\n- Winter coat (3-in-1, can be separated into rain coat and fleece jacket, not super stylish but practical)\n- DocMartens\n\nI tried packing all this stuff into the backpacks and space is quite tight to say the least. It feels like there is a little more space in the Fairview than in the Eagle Creek, but the trail-runners fit into neither of them and need to go extra anyway.\nI feel like I’m already not bringing too much unnecessary stuff, but if you have any recommendations on how to pare down further, please fire away!\n\nI'm kind of torn between the two backpacks. I really like the design of the Eagle Creek, and if I followed my heart, I would go with this one (sorry, cheesy!). However, the straps actually feel a bit uncomfortable (not sure if not just badly adjusted), it feels a bit smaller than the Fairview, and the hip belts don't really do anything.\nOn the other hand, the Fairview feels so thought through, especially with the different ways to attach the daypack. So, this one would probably be the more rational choice. However, although I like the colour and its overall appearance in general, I look a bit like a turtle wearing it (I'm quite short, 1.61m/5′3″).\nI'll definitely want my decision to be future-proof. So, please help me decide between the two bags! And of course, if you have any more insights on the two bags (especially the Eagle Creek as there are tons of posts on the Fairview already), tell me!\n\nSorry for the long post but thanks for reading it! I appreciate your insights!!",
        "author": "_parrotlet_",
        "score": 46,
        "numComments": 26,
        "created": 1710794725,
        "comments": [
          {
            "author": "LSATMaven",
            "body": "I'm team Fairview, so not unbiased. :)\n\nThis is going to sound silly, but, you know how the zippers don't go quite all the way to the bottom on the Fairview? Are you sure you are filling up all the space at the bottom?  I often find that even once I have my packing cubes in the bag, if I need to shove in my giant Hoka recovery slides or something, if I feel around at the bottom past the zippers there is more room than I realized and I can shove more stuff down there.  Maybe try putting your trail runners down there?",
            "score": 15,
            "created": 1710797456,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "So, I’ve now tried this and I can confirm that there actually was quite some space left at the bottom. With some restructuring and improved Tetris packing, everything fits now comfortably! Thanks a lot!",
                "score": 6,
                "created": 1710873929
              },
              {
                "author": "_parrotlet_",
                "body": "Great suggestion, I’ll try that out! Thanks!",
                "score": 2,
                "created": 1710826418
              }
            ]
          },
          {
            "author": "Perfect_Profit_7696",
            "body": "Did you already try packing your socks inside your shoes? And I don't know what types of bras but if any are on the more formed side, placing one cup inside the other then packing your undies inside that can also help with space. (I don't use packing cubes though so I dk if this will have the same impact for making more shoe space)\n\nEdited to add:\nAlso, is there any chance you could stand to wear both sweaters on the plane? \n\nAnd... I know this is a long shot especially since you're presenting, but is there any way you can take just your tablet and leave your laptop? Do you already have a keyboard for it? It's a game changer if you can\n\nEdited again to add:\nI dk what the battery life is like in your iPad but can you also load the Kindle app on that or on your phone and read on one of those? My \"kindle\" is actually a fire tablet about the same size as your iPad and your case looks like it may already fold to stand up. My battery lasts plenty long as long as I turn off wifi/Internet etc. \n\nIf you can change your electronics like these ideas just make sure you also take a slightly longer charging cord so you can comfortably read or work while charging because you'll be more dependent on each item",
            "score": 7,
            "created": 1710804082,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I didn’t try either one yet, but these sound like good tips. Maybe I should also only use one packing cube and stuff everything else into the backpack as is.\n\nI think wearing both sweaters will be too warm for me. And in that case, I’ll have to carry lots of stuff in my hands, so I think I should really try to get the second sweater into the backpack.\n\nMy laptop is my main work device (computer science haha), so if something needs to stay home, it will be my iPad. The iPad would just be convenient for having all my notes and brainstorming, but some sheets of paper will probably do fine, too. (Also since the iPad is not the newest anymore, its battery doesn’t last super long and investing into a keyboard doesn’t make too much sense because of this.. but otherwise, I agree with your suggestions!)",
                "score": 3,
                "created": 1710830381
              }
            ]
          },
          {
            "author": "ireadrot",
            "body": "Comfort over all else. If the Osprey is more comfortable to carry on your back take that. You won't care what you may look like after carrying it for hours. \n\nI'd drop the long sleeves if you're taking heat tech tanks or drop one and one of the blouses too. The extra sweater too because unnecessary bulk and you're wearing one on the trip over. \n\nAre the slides for showers? Because if not don't take them, it's just unnecessary bulk. While its handy to have slides, which I always travel with some, I never travel with boots either. I wear the shoes and carry the slides in my bag but I'm guessing your boots are for work.\n\nUnderwear I'd drop a couple of pairs too, but I am an undies washer when I shower and found that I don't need many pairs when they dry overnight. \n\nThese are just my perspective no judgement.",
            "score": 6,
            "created": 1710803690,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I think you're right. I will do a bit of walking with both backpacks this afternoon as another person here suggested, but I guess the more reasonable choice is taking the Fairview.\n\nAs I'm not yet used to trying to pack minimally in any way, I fear that I won't have enough options like this, but I will think about that. Thanks for the suggestions!\n\nYes, in Copenhagen there will be shared showers, so I'll definitely need slides. However, I'll try to find some more packable ones.",
                "score": 1,
                "created": 1710835333
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1710802332,
            "replies": [
              {
                "author": "Perfect_Profit_7696",
                "body": "Or maybe a smaller type of sneaker like Roxy Bayshore. The sole is less protective but they fit in a much tighter space",
                "score": 3,
                "created": 1710805847
              },
              {
                "author": "_parrotlet_",
                "body": "I'll have a look for other, more packable slippers. But since there are shared showers at the place in Copenhagen where I'll stay, I will definitely need to bring some kind of slippers.\nI'm hoping of doing some sports while being in Lund (hiking, running and/or gym, I don’t know yet how much time I have and what will be possible), and the trail runners feel like the most versatile option I have for all of this (plus they are waterproof). \nAlso, temperatures will be around 2–10°C (35–50°F) and I'm easily getting cold feet, so this is why I thought of bringing the bulky boots.\n\nBut maybe I'm just not used to pare down on shoes yet. I will try to do some Tetris packing again with what's currently on my packing list and if this doesn't help, I will try to replace the docs with some more packable sneakers. So, thanks for your suggestions!",
                "score": 1,
                "created": 1710833272
              }
            ]
          },
          {
            "author": "turnybutton",
            "body": "You don't actually have a ton of stuff listed here, so I'd guess that you could fit all of this more comfortably into either bag with some Tetris packing! That being said, there are a few places you could cut down:\n\nTech: Since you're bringing a laptop, iPad, \\*and\\* Kindle, I think you're right that you should leave one behind. It sounds like you need the laptop for work, and I know I don't use my laptop for personal things, but two entertainment devices probably aren't necessary!\n\nClothing: You also probably don't need two sets of leggings if you're also bringing pajama pants. Also, bringing three pairs of shoes can be tough. Are your boots comfy enough for hiking? Or do you have a shoe that can do both?\n\nAs for the backpack -  the Osprey backpack is wildly popular in this and the other onebagging sub, and I agree that comfort is super important! Try packing the Eagle Creek, walking around with it on for an hour, and see if you change your own mind :-D",
            "score": 3,
            "created": 1710811612,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "Yes, when reading through the comments here, I realised that I really need to amp up my Tetris skills!\n\nI guess I agree, although I will not primarily use the iPad for entertainment purposes but rather for taking notes and having all my notes together. But I think I can also make do without the iPad and just use some sheets of paper for brainstorming.\n\nRegarding shoes: I'm hoping of doing some sports while being there like running or maybe even going to a gym (+ hiking like you mentioned), so this explains why I'd like to pack the running shoes. On the other hand, temperatures will be around 2–10°C (35–50°F), so bringing boots is probably also not a bad idea. As for the slides, I don't think I can ditch those as I'll need them for shared showers in Copenhagen. But I'll see whether I can find some other slides that are more packable.\n\nOh yes, I'll do that this afternoon! Thanks for your suggestions!",
                "score": 3,
                "created": 1710832369
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/g5f2e4fzm5pc1.jpg?width=5712&format=pjpg&auto=webp&s=a01b0f091d7a1a3c48dd768c1fe7feeea57b55ba",
      "thread": {
        "title": "15 Days in Lund (Sweden) — Packing List &amp; Backpack Decision Help",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1bi1erm/15_days_in_lund_sweden_packing_list_backpack/",
        "selftext": "(Sorry in advance, super long post)\n\nHi guys,\nI'd like your advice! In April, I will be doing my first onebagging trip. I’m going to Lund, Sweden, for 15 days as a work trip and then spend 2 more days in Copenhagen to see the city.\nI've never attempted onebagging before, but I'm eager to try it out (or rather 1.5-bagging as I'll have a daypack on me as well). So please bear with me if there is way too much stuff on my packing list! I'll probably check my main backpack as it's paid for by work anyways.\n\nMy bag will likely be the Eagle Creek Tour Travel Pack 40l or the Osprey Fairview 40l. I have both bags here to try them out, but I haven't decided yet which to keep. As for a daypack, I have the Osprey Fairview Daypack here to try out, but I'm happy to get recommendations for other daypacks available in Germany (similar size or a little smaller, packable, and a laptop compartment would be perfect).\n\nApparently, I will have access to a laundry room, but still, I want to have at least a little variety in my outfits as it's a work trip (luckily the dresscode will still be quite casual).\nI guess I will be inside most of the time and thus don't really need too many warm clothes. Also, I feel like I can layer the clothes that I plan for already rather decently.\n\nSo, here's my current packing list:\n\n## Daypack (Hand Luggage)\n- Wallet with stuff that goes into a wallet\n- Refillable water bottle (0.5l)\n- Packable tote bag\n- Phone + charging cable\n- Watch + charging cable\n- Charging brick (for watch and phone, must be USB-C because of charging cable for watch)\n- In-ear headphones\n- iPad (would be very nice for work but needs extra charging brick and charging cable because of Lightning, duh)\n- Kindle\n- Laptop\n- Presenter, as I will have to give a talk at some point\n- AirTag \n- One set of undies and socks to mitigate single points of failure lol (i.e. main bag gets lost)\n- Some snacks\n- Liquids Bag: Deodorant, hand sanitizer, ibuprofen: 1-2x, chapstick\n\n## Main Backpack\n- Charging brick and cable for laptop\n- Computer mouse (still undecided, would be nice for work)\n- AirTag\n\n### Clothing\n- Longsleeves: 2x\n- Blouses: 2x\n- Sweaters: 1x\n- Jeans: 1x (in winter, I wear jeans almost exclusively)\n- Head band, gloves (depends on weather forecast)\n- Sets of undies and socks: 5x\n- Base layers: 2x (tank tops, maybe Heattech?)\n- Pyjamas: 1x\n- Sports: 2 leggings (also for layering underneath jeans and chilling at home, thus 2), 1 shirt, 1 sports bra\n- Shoes: trail-runners (GoreTex), Adidas Adilettes (also for wearing at home with socks)\n\n### Washing Bag\n- Toothbrush, small toothpaste\n- Face wash (decanted into contact lens case)\n- Face cream (already half empty, will be empty at end of trip, then throw away)\n- Tiny eyebrow pencil\n- Concealer (decanted into contact lens case)\n- Hairbrush, some bobby pins, hair ties\n- Plasters, blister plasters, some more ibuprofen\n- Shampoo bar\n- Shaver\n- Small hand lotion\n\nWhat I will wear when travelling (i.e. doesn't need to fit into the backpack):\n- Jeans\n- T-shirt\n- Sweater\n- Thin scarf\n- Winter coat (3-in-1, can be separated into rain coat and fleece jacket, not super stylish but practical)\n- DocMartens\n\nI tried packing all this stuff into the backpacks and space is quite tight to say the least. It feels like there is a little more space in the Fairview than in the Eagle Creek, but the trail-runners fit into neither of them and need to go extra anyway.\nI feel like I’m already not bringing too much unnecessary stuff, but if you have any recommendations on how to pare down further, please fire away!\n\nI'm kind of torn between the two backpacks. I really like the design of the Eagle Creek, and if I followed my heart, I would go with this one (sorry, cheesy!). However, the straps actually feel a bit uncomfortable (not sure if not just badly adjusted), it feels a bit smaller than the Fairview, and the hip belts don't really do anything.\nOn the other hand, the Fairview feels so thought through, especially with the different ways to attach the daypack. So, this one would probably be the more rational choice. However, although I like the colour and its overall appearance in general, I look a bit like a turtle wearing it (I'm quite short, 1.61m/5′3″).\nI'll definitely want my decision to be future-proof. So, please help me decide between the two bags! And of course, if you have any more insights on the two bags (especially the Eagle Creek as there are tons of posts on the Fairview already), tell me!\n\nSorry for the long post but thanks for reading it! I appreciate your insights!!",
        "author": "_parrotlet_",
        "score": 46,
        "numComments": 26,
        "created": 1710794725,
        "comments": [
          {
            "author": "LSATMaven",
            "body": "I'm team Fairview, so not unbiased. :)\n\nThis is going to sound silly, but, you know how the zippers don't go quite all the way to the bottom on the Fairview? Are you sure you are filling up all the space at the bottom?  I often find that even once I have my packing cubes in the bag, if I need to shove in my giant Hoka recovery slides or something, if I feel around at the bottom past the zippers there is more room than I realized and I can shove more stuff down there.  Maybe try putting your trail runners down there?",
            "score": 15,
            "created": 1710797456,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "So, I’ve now tried this and I can confirm that there actually was quite some space left at the bottom. With some restructuring and improved Tetris packing, everything fits now comfortably! Thanks a lot!",
                "score": 6,
                "created": 1710873929
              },
              {
                "author": "_parrotlet_",
                "body": "Great suggestion, I’ll try that out! Thanks!",
                "score": 2,
                "created": 1710826418
              }
            ]
          },
          {
            "author": "Perfect_Profit_7696",
            "body": "Did you already try packing your socks inside your shoes? And I don't know what types of bras but if any are on the more formed side, placing one cup inside the other then packing your undies inside that can also help with space. (I don't use packing cubes though so I dk if this will have the same impact for making more shoe space)\n\nEdited to add:\nAlso, is there any chance you could stand to wear both sweaters on the plane? \n\nAnd... I know this is a long shot especially since you're presenting, but is there any way you can take just your tablet and leave your laptop? Do you already have a keyboard for it? It's a game changer if you can\n\nEdited again to add:\nI dk what the battery life is like in your iPad but can you also load the Kindle app on that or on your phone and read on one of those? My \"kindle\" is actually a fire tablet about the same size as your iPad and your case looks like it may already fold to stand up. My battery lasts plenty long as long as I turn off wifi/Internet etc. \n\nIf you can change your electronics like these ideas just make sure you also take a slightly longer charging cord so you can comfortably read or work while charging because you'll be more dependent on each item",
            "score": 7,
            "created": 1710804082,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I didn’t try either one yet, but these sound like good tips. Maybe I should also only use one packing cube and stuff everything else into the backpack as is.\n\nI think wearing both sweaters will be too warm for me. And in that case, I’ll have to carry lots of stuff in my hands, so I think I should really try to get the second sweater into the backpack.\n\nMy laptop is my main work device (computer science haha), so if something needs to stay home, it will be my iPad. The iPad would just be convenient for having all my notes and brainstorming, but some sheets of paper will probably do fine, too. (Also since the iPad is not the newest anymore, its battery doesn’t last super long and investing into a keyboard doesn’t make too much sense because of this.. but otherwise, I agree with your suggestions!)",
                "score": 3,
                "created": 1710830381
              }
            ]
          },
          {
            "author": "ireadrot",
            "body": "Comfort over all else. If the Osprey is more comfortable to carry on your back take that. You won't care what you may look like after carrying it for hours. \n\nI'd drop the long sleeves if you're taking heat tech tanks or drop one and one of the blouses too. The extra sweater too because unnecessary bulk and you're wearing one on the trip over. \n\nAre the slides for showers? Because if not don't take them, it's just unnecessary bulk. While its handy to have slides, which I always travel with some, I never travel with boots either. I wear the shoes and carry the slides in my bag but I'm guessing your boots are for work.\n\nUnderwear I'd drop a couple of pairs too, but I am an undies washer when I shower and found that I don't need many pairs when they dry overnight. \n\nThese are just my perspective no judgement.",
            "score": 6,
            "created": 1710803690,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I think you're right. I will do a bit of walking with both backpacks this afternoon as another person here suggested, but I guess the more reasonable choice is taking the Fairview.\n\nAs I'm not yet used to trying to pack minimally in any way, I fear that I won't have enough options like this, but I will think about that. Thanks for the suggestions!\n\nYes, in Copenhagen there will be shared showers, so I'll definitely need slides. However, I'll try to find some more packable ones.",
                "score": 1,
                "created": 1710835333
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1710802332,
            "replies": [
              {
                "author": "Perfect_Profit_7696",
                "body": "Or maybe a smaller type of sneaker like Roxy Bayshore. The sole is less protective but they fit in a much tighter space",
                "score": 3,
                "created": 1710805847
              },
              {
                "author": "_parrotlet_",
                "body": "I'll have a look for other, more packable slippers. But since there are shared showers at the place in Copenhagen where I'll stay, I will definitely need to bring some kind of slippers.\nI'm hoping of doing some sports while being in Lund (hiking, running and/or gym, I don’t know yet how much time I have and what will be possible), and the trail runners feel like the most versatile option I have for all of this (plus they are waterproof). \nAlso, temperatures will be around 2–10°C (35–50°F) and I'm easily getting cold feet, so this is why I thought of bringing the bulky boots.\n\nBut maybe I'm just not used to pare down on shoes yet. I will try to do some Tetris packing again with what's currently on my packing list and if this doesn't help, I will try to replace the docs with some more packable sneakers. So, thanks for your suggestions!",
                "score": 1,
                "created": 1710833272
              }
            ]
          },
          {
            "author": "turnybutton",
            "body": "You don't actually have a ton of stuff listed here, so I'd guess that you could fit all of this more comfortably into either bag with some Tetris packing! That being said, there are a few places you could cut down:\n\nTech: Since you're bringing a laptop, iPad, \\*and\\* Kindle, I think you're right that you should leave one behind. It sounds like you need the laptop for work, and I know I don't use my laptop for personal things, but two entertainment devices probably aren't necessary!\n\nClothing: You also probably don't need two sets of leggings if you're also bringing pajama pants. Also, bringing three pairs of shoes can be tough. Are your boots comfy enough for hiking? Or do you have a shoe that can do both?\n\nAs for the backpack -  the Osprey backpack is wildly popular in this and the other onebagging sub, and I agree that comfort is super important! Try packing the Eagle Creek, walking around with it on for an hour, and see if you change your own mind :-D",
            "score": 3,
            "created": 1710811612,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "Yes, when reading through the comments here, I realised that I really need to amp up my Tetris skills!\n\nI guess I agree, although I will not primarily use the iPad for entertainment purposes but rather for taking notes and having all my notes together. But I think I can also make do without the iPad and just use some sheets of paper for brainstorming.\n\nRegarding shoes: I'm hoping of doing some sports while being there like running or maybe even going to a gym (+ hiking like you mentioned), so this explains why I'd like to pack the running shoes. On the other hand, temperatures will be around 2–10°C (35–50°F), so bringing boots is probably also not a bad idea. As for the slides, I don't think I can ditch those as I'll need them for shared showers in Copenhagen. But I'll see whether I can find some other slides that are more packable.\n\nOh yes, I'll do that this afternoon! Thanks for your suggestions!",
                "score": 3,
                "created": 1710832369
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/pe9gpwfzm5pc1.jpg?width=5712&format=pjpg&auto=webp&s=ebd887870b5aa198da41e1a46f6d34592cd9a060",
      "thread": {
        "title": "15 Days in Lund (Sweden) — Packing List &amp; Backpack Decision Help",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1bi1erm/15_days_in_lund_sweden_packing_list_backpack/",
        "selftext": "(Sorry in advance, super long post)\n\nHi guys,\nI'd like your advice! In April, I will be doing my first onebagging trip. I’m going to Lund, Sweden, for 15 days as a work trip and then spend 2 more days in Copenhagen to see the city.\nI've never attempted onebagging before, but I'm eager to try it out (or rather 1.5-bagging as I'll have a daypack on me as well). So please bear with me if there is way too much stuff on my packing list! I'll probably check my main backpack as it's paid for by work anyways.\n\nMy bag will likely be the Eagle Creek Tour Travel Pack 40l or the Osprey Fairview 40l. I have both bags here to try them out, but I haven't decided yet which to keep. As for a daypack, I have the Osprey Fairview Daypack here to try out, but I'm happy to get recommendations for other daypacks available in Germany (similar size or a little smaller, packable, and a laptop compartment would be perfect).\n\nApparently, I will have access to a laundry room, but still, I want to have at least a little variety in my outfits as it's a work trip (luckily the dresscode will still be quite casual).\nI guess I will be inside most of the time and thus don't really need too many warm clothes. Also, I feel like I can layer the clothes that I plan for already rather decently.\n\nSo, here's my current packing list:\n\n## Daypack (Hand Luggage)\n- Wallet with stuff that goes into a wallet\n- Refillable water bottle (0.5l)\n- Packable tote bag\n- Phone + charging cable\n- Watch + charging cable\n- Charging brick (for watch and phone, must be USB-C because of charging cable for watch)\n- In-ear headphones\n- iPad (would be very nice for work but needs extra charging brick and charging cable because of Lightning, duh)\n- Kindle\n- Laptop\n- Presenter, as I will have to give a talk at some point\n- AirTag \n- One set of undies and socks to mitigate single points of failure lol (i.e. main bag gets lost)\n- Some snacks\n- Liquids Bag: Deodorant, hand sanitizer, ibuprofen: 1-2x, chapstick\n\n## Main Backpack\n- Charging brick and cable for laptop\n- Computer mouse (still undecided, would be nice for work)\n- AirTag\n\n### Clothing\n- Longsleeves: 2x\n- Blouses: 2x\n- Sweaters: 1x\n- Jeans: 1x (in winter, I wear jeans almost exclusively)\n- Head band, gloves (depends on weather forecast)\n- Sets of undies and socks: 5x\n- Base layers: 2x (tank tops, maybe Heattech?)\n- Pyjamas: 1x\n- Sports: 2 leggings (also for layering underneath jeans and chilling at home, thus 2), 1 shirt, 1 sports bra\n- Shoes: trail-runners (GoreTex), Adidas Adilettes (also for wearing at home with socks)\n\n### Washing Bag\n- Toothbrush, small toothpaste\n- Face wash (decanted into contact lens case)\n- Face cream (already half empty, will be empty at end of trip, then throw away)\n- Tiny eyebrow pencil\n- Concealer (decanted into contact lens case)\n- Hairbrush, some bobby pins, hair ties\n- Plasters, blister plasters, some more ibuprofen\n- Shampoo bar\n- Shaver\n- Small hand lotion\n\nWhat I will wear when travelling (i.e. doesn't need to fit into the backpack):\n- Jeans\n- T-shirt\n- Sweater\n- Thin scarf\n- Winter coat (3-in-1, can be separated into rain coat and fleece jacket, not super stylish but practical)\n- DocMartens\n\nI tried packing all this stuff into the backpacks and space is quite tight to say the least. It feels like there is a little more space in the Fairview than in the Eagle Creek, but the trail-runners fit into neither of them and need to go extra anyway.\nI feel like I’m already not bringing too much unnecessary stuff, but if you have any recommendations on how to pare down further, please fire away!\n\nI'm kind of torn between the two backpacks. I really like the design of the Eagle Creek, and if I followed my heart, I would go with this one (sorry, cheesy!). However, the straps actually feel a bit uncomfortable (not sure if not just badly adjusted), it feels a bit smaller than the Fairview, and the hip belts don't really do anything.\nOn the other hand, the Fairview feels so thought through, especially with the different ways to attach the daypack. So, this one would probably be the more rational choice. However, although I like the colour and its overall appearance in general, I look a bit like a turtle wearing it (I'm quite short, 1.61m/5′3″).\nI'll definitely want my decision to be future-proof. So, please help me decide between the two bags! And of course, if you have any more insights on the two bags (especially the Eagle Creek as there are tons of posts on the Fairview already), tell me!\n\nSorry for the long post but thanks for reading it! I appreciate your insights!!",
        "author": "_parrotlet_",
        "score": 46,
        "numComments": 26,
        "created": 1710794725,
        "comments": [
          {
            "author": "LSATMaven",
            "body": "I'm team Fairview, so not unbiased. :)\n\nThis is going to sound silly, but, you know how the zippers don't go quite all the way to the bottom on the Fairview? Are you sure you are filling up all the space at the bottom?  I often find that even once I have my packing cubes in the bag, if I need to shove in my giant Hoka recovery slides or something, if I feel around at the bottom past the zippers there is more room than I realized and I can shove more stuff down there.  Maybe try putting your trail runners down there?",
            "score": 15,
            "created": 1710797456,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "So, I’ve now tried this and I can confirm that there actually was quite some space left at the bottom. With some restructuring and improved Tetris packing, everything fits now comfortably! Thanks a lot!",
                "score": 6,
                "created": 1710873929
              },
              {
                "author": "_parrotlet_",
                "body": "Great suggestion, I’ll try that out! Thanks!",
                "score": 2,
                "created": 1710826418
              }
            ]
          },
          {
            "author": "Perfect_Profit_7696",
            "body": "Did you already try packing your socks inside your shoes? And I don't know what types of bras but if any are on the more formed side, placing one cup inside the other then packing your undies inside that can also help with space. (I don't use packing cubes though so I dk if this will have the same impact for making more shoe space)\n\nEdited to add:\nAlso, is there any chance you could stand to wear both sweaters on the plane? \n\nAnd... I know this is a long shot especially since you're presenting, but is there any way you can take just your tablet and leave your laptop? Do you already have a keyboard for it? It's a game changer if you can\n\nEdited again to add:\nI dk what the battery life is like in your iPad but can you also load the Kindle app on that or on your phone and read on one of those? My \"kindle\" is actually a fire tablet about the same size as your iPad and your case looks like it may already fold to stand up. My battery lasts plenty long as long as I turn off wifi/Internet etc. \n\nIf you can change your electronics like these ideas just make sure you also take a slightly longer charging cord so you can comfortably read or work while charging because you'll be more dependent on each item",
            "score": 7,
            "created": 1710804082,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I didn’t try either one yet, but these sound like good tips. Maybe I should also only use one packing cube and stuff everything else into the backpack as is.\n\nI think wearing both sweaters will be too warm for me. And in that case, I’ll have to carry lots of stuff in my hands, so I think I should really try to get the second sweater into the backpack.\n\nMy laptop is my main work device (computer science haha), so if something needs to stay home, it will be my iPad. The iPad would just be convenient for having all my notes and brainstorming, but some sheets of paper will probably do fine, too. (Also since the iPad is not the newest anymore, its battery doesn’t last super long and investing into a keyboard doesn’t make too much sense because of this.. but otherwise, I agree with your suggestions!)",
                "score": 3,
                "created": 1710830381
              }
            ]
          },
          {
            "author": "ireadrot",
            "body": "Comfort over all else. If the Osprey is more comfortable to carry on your back take that. You won't care what you may look like after carrying it for hours. \n\nI'd drop the long sleeves if you're taking heat tech tanks or drop one and one of the blouses too. The extra sweater too because unnecessary bulk and you're wearing one on the trip over. \n\nAre the slides for showers? Because if not don't take them, it's just unnecessary bulk. While its handy to have slides, which I always travel with some, I never travel with boots either. I wear the shoes and carry the slides in my bag but I'm guessing your boots are for work.\n\nUnderwear I'd drop a couple of pairs too, but I am an undies washer when I shower and found that I don't need many pairs when they dry overnight. \n\nThese are just my perspective no judgement.",
            "score": 6,
            "created": 1710803690,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I think you're right. I will do a bit of walking with both backpacks this afternoon as another person here suggested, but I guess the more reasonable choice is taking the Fairview.\n\nAs I'm not yet used to trying to pack minimally in any way, I fear that I won't have enough options like this, but I will think about that. Thanks for the suggestions!\n\nYes, in Copenhagen there will be shared showers, so I'll definitely need slides. However, I'll try to find some more packable ones.",
                "score": 1,
                "created": 1710835333
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1710802332,
            "replies": [
              {
                "author": "Perfect_Profit_7696",
                "body": "Or maybe a smaller type of sneaker like Roxy Bayshore. The sole is less protective but they fit in a much tighter space",
                "score": 3,
                "created": 1710805847
              },
              {
                "author": "_parrotlet_",
                "body": "I'll have a look for other, more packable slippers. But since there are shared showers at the place in Copenhagen where I'll stay, I will definitely need to bring some kind of slippers.\nI'm hoping of doing some sports while being in Lund (hiking, running and/or gym, I don’t know yet how much time I have and what will be possible), and the trail runners feel like the most versatile option I have for all of this (plus they are waterproof). \nAlso, temperatures will be around 2–10°C (35–50°F) and I'm easily getting cold feet, so this is why I thought of bringing the bulky boots.\n\nBut maybe I'm just not used to pare down on shoes yet. I will try to do some Tetris packing again with what's currently on my packing list and if this doesn't help, I will try to replace the docs with some more packable sneakers. So, thanks for your suggestions!",
                "score": 1,
                "created": 1710833272
              }
            ]
          },
          {
            "author": "turnybutton",
            "body": "You don't actually have a ton of stuff listed here, so I'd guess that you could fit all of this more comfortably into either bag with some Tetris packing! That being said, there are a few places you could cut down:\n\nTech: Since you're bringing a laptop, iPad, \\*and\\* Kindle, I think you're right that you should leave one behind. It sounds like you need the laptop for work, and I know I don't use my laptop for personal things, but two entertainment devices probably aren't necessary!\n\nClothing: You also probably don't need two sets of leggings if you're also bringing pajama pants. Also, bringing three pairs of shoes can be tough. Are your boots comfy enough for hiking? Or do you have a shoe that can do both?\n\nAs for the backpack -  the Osprey backpack is wildly popular in this and the other onebagging sub, and I agree that comfort is super important! Try packing the Eagle Creek, walking around with it on for an hour, and see if you change your own mind :-D",
            "score": 3,
            "created": 1710811612,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "Yes, when reading through the comments here, I realised that I really need to amp up my Tetris skills!\n\nI guess I agree, although I will not primarily use the iPad for entertainment purposes but rather for taking notes and having all my notes together. But I think I can also make do without the iPad and just use some sheets of paper for brainstorming.\n\nRegarding shoes: I'm hoping of doing some sports while being there like running or maybe even going to a gym (+ hiking like you mentioned), so this explains why I'd like to pack the running shoes. On the other hand, temperatures will be around 2–10°C (35–50°F), so bringing boots is probably also not a bad idea. As for the slides, I don't think I can ditch those as I'll need them for shared showers in Copenhagen. But I'll see whether I can find some other slides that are more packable.\n\nOh yes, I'll do that this afternoon! Thanks for your suggestions!",
                "score": 3,
                "created": 1710832369
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/l62ps3fzm5pc1.jpg?width=2100&format=pjpg&auto=webp&s=889095bf9f10316793392b75ac35b2d31fe3af9c",
      "thread": {
        "title": "15 Days in Lund (Sweden) — Packing List &amp; Backpack Decision Help",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1bi1erm/15_days_in_lund_sweden_packing_list_backpack/",
        "selftext": "(Sorry in advance, super long post)\n\nHi guys,\nI'd like your advice! In April, I will be doing my first onebagging trip. I’m going to Lund, Sweden, for 15 days as a work trip and then spend 2 more days in Copenhagen to see the city.\nI've never attempted onebagging before, but I'm eager to try it out (or rather 1.5-bagging as I'll have a daypack on me as well). So please bear with me if there is way too much stuff on my packing list! I'll probably check my main backpack as it's paid for by work anyways.\n\nMy bag will likely be the Eagle Creek Tour Travel Pack 40l or the Osprey Fairview 40l. I have both bags here to try them out, but I haven't decided yet which to keep. As for a daypack, I have the Osprey Fairview Daypack here to try out, but I'm happy to get recommendations for other daypacks available in Germany (similar size or a little smaller, packable, and a laptop compartment would be perfect).\n\nApparently, I will have access to a laundry room, but still, I want to have at least a little variety in my outfits as it's a work trip (luckily the dresscode will still be quite casual).\nI guess I will be inside most of the time and thus don't really need too many warm clothes. Also, I feel like I can layer the clothes that I plan for already rather decently.\n\nSo, here's my current packing list:\n\n## Daypack (Hand Luggage)\n- Wallet with stuff that goes into a wallet\n- Refillable water bottle (0.5l)\n- Packable tote bag\n- Phone + charging cable\n- Watch + charging cable\n- Charging brick (for watch and phone, must be USB-C because of charging cable for watch)\n- In-ear headphones\n- iPad (would be very nice for work but needs extra charging brick and charging cable because of Lightning, duh)\n- Kindle\n- Laptop\n- Presenter, as I will have to give a talk at some point\n- AirTag \n- One set of undies and socks to mitigate single points of failure lol (i.e. main bag gets lost)\n- Some snacks\n- Liquids Bag: Deodorant, hand sanitizer, ibuprofen: 1-2x, chapstick\n\n## Main Backpack\n- Charging brick and cable for laptop\n- Computer mouse (still undecided, would be nice for work)\n- AirTag\n\n### Clothing\n- Longsleeves: 2x\n- Blouses: 2x\n- Sweaters: 1x\n- Jeans: 1x (in winter, I wear jeans almost exclusively)\n- Head band, gloves (depends on weather forecast)\n- Sets of undies and socks: 5x\n- Base layers: 2x (tank tops, maybe Heattech?)\n- Pyjamas: 1x\n- Sports: 2 leggings (also for layering underneath jeans and chilling at home, thus 2), 1 shirt, 1 sports bra\n- Shoes: trail-runners (GoreTex), Adidas Adilettes (also for wearing at home with socks)\n\n### Washing Bag\n- Toothbrush, small toothpaste\n- Face wash (decanted into contact lens case)\n- Face cream (already half empty, will be empty at end of trip, then throw away)\n- Tiny eyebrow pencil\n- Concealer (decanted into contact lens case)\n- Hairbrush, some bobby pins, hair ties\n- Plasters, blister plasters, some more ibuprofen\n- Shampoo bar\n- Shaver\n- Small hand lotion\n\nWhat I will wear when travelling (i.e. doesn't need to fit into the backpack):\n- Jeans\n- T-shirt\n- Sweater\n- Thin scarf\n- Winter coat (3-in-1, can be separated into rain coat and fleece jacket, not super stylish but practical)\n- DocMartens\n\nI tried packing all this stuff into the backpacks and space is quite tight to say the least. It feels like there is a little more space in the Fairview than in the Eagle Creek, but the trail-runners fit into neither of them and need to go extra anyway.\nI feel like I’m already not bringing too much unnecessary stuff, but if you have any recommendations on how to pare down further, please fire away!\n\nI'm kind of torn between the two backpacks. I really like the design of the Eagle Creek, and if I followed my heart, I would go with this one (sorry, cheesy!). However, the straps actually feel a bit uncomfortable (not sure if not just badly adjusted), it feels a bit smaller than the Fairview, and the hip belts don't really do anything.\nOn the other hand, the Fairview feels so thought through, especially with the different ways to attach the daypack. So, this one would probably be the more rational choice. However, although I like the colour and its overall appearance in general, I look a bit like a turtle wearing it (I'm quite short, 1.61m/5′3″).\nI'll definitely want my decision to be future-proof. So, please help me decide between the two bags! And of course, if you have any more insights on the two bags (especially the Eagle Creek as there are tons of posts on the Fairview already), tell me!\n\nSorry for the long post but thanks for reading it! I appreciate your insights!!",
        "author": "_parrotlet_",
        "score": 46,
        "numComments": 26,
        "created": 1710794725,
        "comments": [
          {
            "author": "LSATMaven",
            "body": "I'm team Fairview, so not unbiased. :)\n\nThis is going to sound silly, but, you know how the zippers don't go quite all the way to the bottom on the Fairview? Are you sure you are filling up all the space at the bottom?  I often find that even once I have my packing cubes in the bag, if I need to shove in my giant Hoka recovery slides or something, if I feel around at the bottom past the zippers there is more room than I realized and I can shove more stuff down there.  Maybe try putting your trail runners down there?",
            "score": 15,
            "created": 1710797456,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "So, I’ve now tried this and I can confirm that there actually was quite some space left at the bottom. With some restructuring and improved Tetris packing, everything fits now comfortably! Thanks a lot!",
                "score": 6,
                "created": 1710873929
              },
              {
                "author": "_parrotlet_",
                "body": "Great suggestion, I’ll try that out! Thanks!",
                "score": 2,
                "created": 1710826418
              }
            ]
          },
          {
            "author": "Perfect_Profit_7696",
            "body": "Did you already try packing your socks inside your shoes? And I don't know what types of bras but if any are on the more formed side, placing one cup inside the other then packing your undies inside that can also help with space. (I don't use packing cubes though so I dk if this will have the same impact for making more shoe space)\n\nEdited to add:\nAlso, is there any chance you could stand to wear both sweaters on the plane? \n\nAnd... I know this is a long shot especially since you're presenting, but is there any way you can take just your tablet and leave your laptop? Do you already have a keyboard for it? It's a game changer if you can\n\nEdited again to add:\nI dk what the battery life is like in your iPad but can you also load the Kindle app on that or on your phone and read on one of those? My \"kindle\" is actually a fire tablet about the same size as your iPad and your case looks like it may already fold to stand up. My battery lasts plenty long as long as I turn off wifi/Internet etc. \n\nIf you can change your electronics like these ideas just make sure you also take a slightly longer charging cord so you can comfortably read or work while charging because you'll be more dependent on each item",
            "score": 7,
            "created": 1710804082,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I didn’t try either one yet, but these sound like good tips. Maybe I should also only use one packing cube and stuff everything else into the backpack as is.\n\nI think wearing both sweaters will be too warm for me. And in that case, I’ll have to carry lots of stuff in my hands, so I think I should really try to get the second sweater into the backpack.\n\nMy laptop is my main work device (computer science haha), so if something needs to stay home, it will be my iPad. The iPad would just be convenient for having all my notes and brainstorming, but some sheets of paper will probably do fine, too. (Also since the iPad is not the newest anymore, its battery doesn’t last super long and investing into a keyboard doesn’t make too much sense because of this.. but otherwise, I agree with your suggestions!)",
                "score": 3,
                "created": 1710830381
              }
            ]
          },
          {
            "author": "ireadrot",
            "body": "Comfort over all else. If the Osprey is more comfortable to carry on your back take that. You won't care what you may look like after carrying it for hours. \n\nI'd drop the long sleeves if you're taking heat tech tanks or drop one and one of the blouses too. The extra sweater too because unnecessary bulk and you're wearing one on the trip over. \n\nAre the slides for showers? Because if not don't take them, it's just unnecessary bulk. While its handy to have slides, which I always travel with some, I never travel with boots either. I wear the shoes and carry the slides in my bag but I'm guessing your boots are for work.\n\nUnderwear I'd drop a couple of pairs too, but I am an undies washer when I shower and found that I don't need many pairs when they dry overnight. \n\nThese are just my perspective no judgement.",
            "score": 6,
            "created": 1710803690,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I think you're right. I will do a bit of walking with both backpacks this afternoon as another person here suggested, but I guess the more reasonable choice is taking the Fairview.\n\nAs I'm not yet used to trying to pack minimally in any way, I fear that I won't have enough options like this, but I will think about that. Thanks for the suggestions!\n\nYes, in Copenhagen there will be shared showers, so I'll definitely need slides. However, I'll try to find some more packable ones.",
                "score": 1,
                "created": 1710835333
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1710802332,
            "replies": [
              {
                "author": "Perfect_Profit_7696",
                "body": "Or maybe a smaller type of sneaker like Roxy Bayshore. The sole is less protective but they fit in a much tighter space",
                "score": 3,
                "created": 1710805847
              },
              {
                "author": "_parrotlet_",
                "body": "I'll have a look for other, more packable slippers. But since there are shared showers at the place in Copenhagen where I'll stay, I will definitely need to bring some kind of slippers.\nI'm hoping of doing some sports while being in Lund (hiking, running and/or gym, I don’t know yet how much time I have and what will be possible), and the trail runners feel like the most versatile option I have for all of this (plus they are waterproof). \nAlso, temperatures will be around 2–10°C (35–50°F) and I'm easily getting cold feet, so this is why I thought of bringing the bulky boots.\n\nBut maybe I'm just not used to pare down on shoes yet. I will try to do some Tetris packing again with what's currently on my packing list and if this doesn't help, I will try to replace the docs with some more packable sneakers. So, thanks for your suggestions!",
                "score": 1,
                "created": 1710833272
              }
            ]
          },
          {
            "author": "turnybutton",
            "body": "You don't actually have a ton of stuff listed here, so I'd guess that you could fit all of this more comfortably into either bag with some Tetris packing! That being said, there are a few places you could cut down:\n\nTech: Since you're bringing a laptop, iPad, \\*and\\* Kindle, I think you're right that you should leave one behind. It sounds like you need the laptop for work, and I know I don't use my laptop for personal things, but two entertainment devices probably aren't necessary!\n\nClothing: You also probably don't need two sets of leggings if you're also bringing pajama pants. Also, bringing three pairs of shoes can be tough. Are your boots comfy enough for hiking? Or do you have a shoe that can do both?\n\nAs for the backpack -  the Osprey backpack is wildly popular in this and the other onebagging sub, and I agree that comfort is super important! Try packing the Eagle Creek, walking around with it on for an hour, and see if you change your own mind :-D",
            "score": 3,
            "created": 1710811612,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "Yes, when reading through the comments here, I realised that I really need to amp up my Tetris skills!\n\nI guess I agree, although I will not primarily use the iPad for entertainment purposes but rather for taking notes and having all my notes together. But I think I can also make do without the iPad and just use some sheets of paper for brainstorming.\n\nRegarding shoes: I'm hoping of doing some sports while being there like running or maybe even going to a gym (+ hiking like you mentioned), so this explains why I'd like to pack the running shoes. On the other hand, temperatures will be around 2–10°C (35–50°F), so bringing boots is probably also not a bad idea. As for the slides, I don't think I can ditch those as I'll need them for shared showers in Copenhagen. But I'll see whether I can find some other slides that are more packable.\n\nOh yes, I'll do that this afternoon! Thanks for your suggestions!",
                "score": 3,
                "created": 1710832369
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/nntia6fzm5pc1.jpg?width=5210&format=pjpg&auto=webp&s=802b017c8a3cbf47d24db7b4f344dd05cd9d3e80",
      "thread": {
        "title": "15 Days in Lund (Sweden) — Packing List &amp; Backpack Decision Help",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1bi1erm/15_days_in_lund_sweden_packing_list_backpack/",
        "selftext": "(Sorry in advance, super long post)\n\nHi guys,\nI'd like your advice! In April, I will be doing my first onebagging trip. I’m going to Lund, Sweden, for 15 days as a work trip and then spend 2 more days in Copenhagen to see the city.\nI've never attempted onebagging before, but I'm eager to try it out (or rather 1.5-bagging as I'll have a daypack on me as well). So please bear with me if there is way too much stuff on my packing list! I'll probably check my main backpack as it's paid for by work anyways.\n\nMy bag will likely be the Eagle Creek Tour Travel Pack 40l or the Osprey Fairview 40l. I have both bags here to try them out, but I haven't decided yet which to keep. As for a daypack, I have the Osprey Fairview Daypack here to try out, but I'm happy to get recommendations for other daypacks available in Germany (similar size or a little smaller, packable, and a laptop compartment would be perfect).\n\nApparently, I will have access to a laundry room, but still, I want to have at least a little variety in my outfits as it's a work trip (luckily the dresscode will still be quite casual).\nI guess I will be inside most of the time and thus don't really need too many warm clothes. Also, I feel like I can layer the clothes that I plan for already rather decently.\n\nSo, here's my current packing list:\n\n## Daypack (Hand Luggage)\n- Wallet with stuff that goes into a wallet\n- Refillable water bottle (0.5l)\n- Packable tote bag\n- Phone + charging cable\n- Watch + charging cable\n- Charging brick (for watch and phone, must be USB-C because of charging cable for watch)\n- In-ear headphones\n- iPad (would be very nice for work but needs extra charging brick and charging cable because of Lightning, duh)\n- Kindle\n- Laptop\n- Presenter, as I will have to give a talk at some point\n- AirTag \n- One set of undies and socks to mitigate single points of failure lol (i.e. main bag gets lost)\n- Some snacks\n- Liquids Bag: Deodorant, hand sanitizer, ibuprofen: 1-2x, chapstick\n\n## Main Backpack\n- Charging brick and cable for laptop\n- Computer mouse (still undecided, would be nice for work)\n- AirTag\n\n### Clothing\n- Longsleeves: 2x\n- Blouses: 2x\n- Sweaters: 1x\n- Jeans: 1x (in winter, I wear jeans almost exclusively)\n- Head band, gloves (depends on weather forecast)\n- Sets of undies and socks: 5x\n- Base layers: 2x (tank tops, maybe Heattech?)\n- Pyjamas: 1x\n- Sports: 2 leggings (also for layering underneath jeans and chilling at home, thus 2), 1 shirt, 1 sports bra\n- Shoes: trail-runners (GoreTex), Adidas Adilettes (also for wearing at home with socks)\n\n### Washing Bag\n- Toothbrush, small toothpaste\n- Face wash (decanted into contact lens case)\n- Face cream (already half empty, will be empty at end of trip, then throw away)\n- Tiny eyebrow pencil\n- Concealer (decanted into contact lens case)\n- Hairbrush, some bobby pins, hair ties\n- Plasters, blister plasters, some more ibuprofen\n- Shampoo bar\n- Shaver\n- Small hand lotion\n\nWhat I will wear when travelling (i.e. doesn't need to fit into the backpack):\n- Jeans\n- T-shirt\n- Sweater\n- Thin scarf\n- Winter coat (3-in-1, can be separated into rain coat and fleece jacket, not super stylish but practical)\n- DocMartens\n\nI tried packing all this stuff into the backpacks and space is quite tight to say the least. It feels like there is a little more space in the Fairview than in the Eagle Creek, but the trail-runners fit into neither of them and need to go extra anyway.\nI feel like I’m already not bringing too much unnecessary stuff, but if you have any recommendations on how to pare down further, please fire away!\n\nI'm kind of torn between the two backpacks. I really like the design of the Eagle Creek, and if I followed my heart, I would go with this one (sorry, cheesy!). However, the straps actually feel a bit uncomfortable (not sure if not just badly adjusted), it feels a bit smaller than the Fairview, and the hip belts don't really do anything.\nOn the other hand, the Fairview feels so thought through, especially with the different ways to attach the daypack. So, this one would probably be the more rational choice. However, although I like the colour and its overall appearance in general, I look a bit like a turtle wearing it (I'm quite short, 1.61m/5′3″).\nI'll definitely want my decision to be future-proof. So, please help me decide between the two bags! And of course, if you have any more insights on the two bags (especially the Eagle Creek as there are tons of posts on the Fairview already), tell me!\n\nSorry for the long post but thanks for reading it! I appreciate your insights!!",
        "author": "_parrotlet_",
        "score": 46,
        "numComments": 26,
        "created": 1710794725,
        "comments": [
          {
            "author": "LSATMaven",
            "body": "I'm team Fairview, so not unbiased. :)\n\nThis is going to sound silly, but, you know how the zippers don't go quite all the way to the bottom on the Fairview? Are you sure you are filling up all the space at the bottom?  I often find that even once I have my packing cubes in the bag, if I need to shove in my giant Hoka recovery slides or something, if I feel around at the bottom past the zippers there is more room than I realized and I can shove more stuff down there.  Maybe try putting your trail runners down there?",
            "score": 15,
            "created": 1710797456,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "So, I’ve now tried this and I can confirm that there actually was quite some space left at the bottom. With some restructuring and improved Tetris packing, everything fits now comfortably! Thanks a lot!",
                "score": 6,
                "created": 1710873929
              },
              {
                "author": "_parrotlet_",
                "body": "Great suggestion, I’ll try that out! Thanks!",
                "score": 2,
                "created": 1710826418
              }
            ]
          },
          {
            "author": "Perfect_Profit_7696",
            "body": "Did you already try packing your socks inside your shoes? And I don't know what types of bras but if any are on the more formed side, placing one cup inside the other then packing your undies inside that can also help with space. (I don't use packing cubes though so I dk if this will have the same impact for making more shoe space)\n\nEdited to add:\nAlso, is there any chance you could stand to wear both sweaters on the plane? \n\nAnd... I know this is a long shot especially since you're presenting, but is there any way you can take just your tablet and leave your laptop? Do you already have a keyboard for it? It's a game changer if you can\n\nEdited again to add:\nI dk what the battery life is like in your iPad but can you also load the Kindle app on that or on your phone and read on one of those? My \"kindle\" is actually a fire tablet about the same size as your iPad and your case looks like it may already fold to stand up. My battery lasts plenty long as long as I turn off wifi/Internet etc. \n\nIf you can change your electronics like these ideas just make sure you also take a slightly longer charging cord so you can comfortably read or work while charging because you'll be more dependent on each item",
            "score": 7,
            "created": 1710804082,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I didn’t try either one yet, but these sound like good tips. Maybe I should also only use one packing cube and stuff everything else into the backpack as is.\n\nI think wearing both sweaters will be too warm for me. And in that case, I’ll have to carry lots of stuff in my hands, so I think I should really try to get the second sweater into the backpack.\n\nMy laptop is my main work device (computer science haha), so if something needs to stay home, it will be my iPad. The iPad would just be convenient for having all my notes and brainstorming, but some sheets of paper will probably do fine, too. (Also since the iPad is not the newest anymore, its battery doesn’t last super long and investing into a keyboard doesn’t make too much sense because of this.. but otherwise, I agree with your suggestions!)",
                "score": 3,
                "created": 1710830381
              }
            ]
          },
          {
            "author": "ireadrot",
            "body": "Comfort over all else. If the Osprey is more comfortable to carry on your back take that. You won't care what you may look like after carrying it for hours. \n\nI'd drop the long sleeves if you're taking heat tech tanks or drop one and one of the blouses too. The extra sweater too because unnecessary bulk and you're wearing one on the trip over. \n\nAre the slides for showers? Because if not don't take them, it's just unnecessary bulk. While its handy to have slides, which I always travel with some, I never travel with boots either. I wear the shoes and carry the slides in my bag but I'm guessing your boots are for work.\n\nUnderwear I'd drop a couple of pairs too, but I am an undies washer when I shower and found that I don't need many pairs when they dry overnight. \n\nThese are just my perspective no judgement.",
            "score": 6,
            "created": 1710803690,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I think you're right. I will do a bit of walking with both backpacks this afternoon as another person here suggested, but I guess the more reasonable choice is taking the Fairview.\n\nAs I'm not yet used to trying to pack minimally in any way, I fear that I won't have enough options like this, but I will think about that. Thanks for the suggestions!\n\nYes, in Copenhagen there will be shared showers, so I'll definitely need slides. However, I'll try to find some more packable ones.",
                "score": 1,
                "created": 1710835333
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1710802332,
            "replies": [
              {
                "author": "Perfect_Profit_7696",
                "body": "Or maybe a smaller type of sneaker like Roxy Bayshore. The sole is less protective but they fit in a much tighter space",
                "score": 3,
                "created": 1710805847
              },
              {
                "author": "_parrotlet_",
                "body": "I'll have a look for other, more packable slippers. But since there are shared showers at the place in Copenhagen where I'll stay, I will definitely need to bring some kind of slippers.\nI'm hoping of doing some sports while being in Lund (hiking, running and/or gym, I don’t know yet how much time I have and what will be possible), and the trail runners feel like the most versatile option I have for all of this (plus they are waterproof). \nAlso, temperatures will be around 2–10°C (35–50°F) and I'm easily getting cold feet, so this is why I thought of bringing the bulky boots.\n\nBut maybe I'm just not used to pare down on shoes yet. I will try to do some Tetris packing again with what's currently on my packing list and if this doesn't help, I will try to replace the docs with some more packable sneakers. So, thanks for your suggestions!",
                "score": 1,
                "created": 1710833272
              }
            ]
          },
          {
            "author": "turnybutton",
            "body": "You don't actually have a ton of stuff listed here, so I'd guess that you could fit all of this more comfortably into either bag with some Tetris packing! That being said, there are a few places you could cut down:\n\nTech: Since you're bringing a laptop, iPad, \\*and\\* Kindle, I think you're right that you should leave one behind. It sounds like you need the laptop for work, and I know I don't use my laptop for personal things, but two entertainment devices probably aren't necessary!\n\nClothing: You also probably don't need two sets of leggings if you're also bringing pajama pants. Also, bringing three pairs of shoes can be tough. Are your boots comfy enough for hiking? Or do you have a shoe that can do both?\n\nAs for the backpack -  the Osprey backpack is wildly popular in this and the other onebagging sub, and I agree that comfort is super important! Try packing the Eagle Creek, walking around with it on for an hour, and see if you change your own mind :-D",
            "score": 3,
            "created": 1710811612,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "Yes, when reading through the comments here, I realised that I really need to amp up my Tetris skills!\n\nI guess I agree, although I will not primarily use the iPad for entertainment purposes but rather for taking notes and having all my notes together. But I think I can also make do without the iPad and just use some sheets of paper for brainstorming.\n\nRegarding shoes: I'm hoping of doing some sports while being there like running or maybe even going to a gym (+ hiking like you mentioned), so this explains why I'd like to pack the running shoes. On the other hand, temperatures will be around 2–10°C (35–50°F), so bringing boots is probably also not a bad idea. As for the slides, I don't think I can ditch those as I'll need them for shared showers in Copenhagen. But I'll see whether I can find some other slides that are more packable.\n\nOh yes, I'll do that this afternoon! Thanks for your suggestions!",
                "score": 3,
                "created": 1710832369
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/jcegswfzm5pc1.jpg?width=5466&format=pjpg&auto=webp&s=b68931b2c0d8ec6114bc0c299d007969709e0b26",
      "thread": {
        "title": "15 Days in Lund (Sweden) — Packing List &amp; Backpack Decision Help",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1bi1erm/15_days_in_lund_sweden_packing_list_backpack/",
        "selftext": "(Sorry in advance, super long post)\n\nHi guys,\nI'd like your advice! In April, I will be doing my first onebagging trip. I’m going to Lund, Sweden, for 15 days as a work trip and then spend 2 more days in Copenhagen to see the city.\nI've never attempted onebagging before, but I'm eager to try it out (or rather 1.5-bagging as I'll have a daypack on me as well). So please bear with me if there is way too much stuff on my packing list! I'll probably check my main backpack as it's paid for by work anyways.\n\nMy bag will likely be the Eagle Creek Tour Travel Pack 40l or the Osprey Fairview 40l. I have both bags here to try them out, but I haven't decided yet which to keep. As for a daypack, I have the Osprey Fairview Daypack here to try out, but I'm happy to get recommendations for other daypacks available in Germany (similar size or a little smaller, packable, and a laptop compartment would be perfect).\n\nApparently, I will have access to a laundry room, but still, I want to have at least a little variety in my outfits as it's a work trip (luckily the dresscode will still be quite casual).\nI guess I will be inside most of the time and thus don't really need too many warm clothes. Also, I feel like I can layer the clothes that I plan for already rather decently.\n\nSo, here's my current packing list:\n\n## Daypack (Hand Luggage)\n- Wallet with stuff that goes into a wallet\n- Refillable water bottle (0.5l)\n- Packable tote bag\n- Phone + charging cable\n- Watch + charging cable\n- Charging brick (for watch and phone, must be USB-C because of charging cable for watch)\n- In-ear headphones\n- iPad (would be very nice for work but needs extra charging brick and charging cable because of Lightning, duh)\n- Kindle\n- Laptop\n- Presenter, as I will have to give a talk at some point\n- AirTag \n- One set of undies and socks to mitigate single points of failure lol (i.e. main bag gets lost)\n- Some snacks\n- Liquids Bag: Deodorant, hand sanitizer, ibuprofen: 1-2x, chapstick\n\n## Main Backpack\n- Charging brick and cable for laptop\n- Computer mouse (still undecided, would be nice for work)\n- AirTag\n\n### Clothing\n- Longsleeves: 2x\n- Blouses: 2x\n- Sweaters: 1x\n- Jeans: 1x (in winter, I wear jeans almost exclusively)\n- Head band, gloves (depends on weather forecast)\n- Sets of undies and socks: 5x\n- Base layers: 2x (tank tops, maybe Heattech?)\n- Pyjamas: 1x\n- Sports: 2 leggings (also for layering underneath jeans and chilling at home, thus 2), 1 shirt, 1 sports bra\n- Shoes: trail-runners (GoreTex), Adidas Adilettes (also for wearing at home with socks)\n\n### Washing Bag\n- Toothbrush, small toothpaste\n- Face wash (decanted into contact lens case)\n- Face cream (already half empty, will be empty at end of trip, then throw away)\n- Tiny eyebrow pencil\n- Concealer (decanted into contact lens case)\n- Hairbrush, some bobby pins, hair ties\n- Plasters, blister plasters, some more ibuprofen\n- Shampoo bar\n- Shaver\n- Small hand lotion\n\nWhat I will wear when travelling (i.e. doesn't need to fit into the backpack):\n- Jeans\n- T-shirt\n- Sweater\n- Thin scarf\n- Winter coat (3-in-1, can be separated into rain coat and fleece jacket, not super stylish but practical)\n- DocMartens\n\nI tried packing all this stuff into the backpacks and space is quite tight to say the least. It feels like there is a little more space in the Fairview than in the Eagle Creek, but the trail-runners fit into neither of them and need to go extra anyway.\nI feel like I’m already not bringing too much unnecessary stuff, but if you have any recommendations on how to pare down further, please fire away!\n\nI'm kind of torn between the two backpacks. I really like the design of the Eagle Creek, and if I followed my heart, I would go with this one (sorry, cheesy!). However, the straps actually feel a bit uncomfortable (not sure if not just badly adjusted), it feels a bit smaller than the Fairview, and the hip belts don't really do anything.\nOn the other hand, the Fairview feels so thought through, especially with the different ways to attach the daypack. So, this one would probably be the more rational choice. However, although I like the colour and its overall appearance in general, I look a bit like a turtle wearing it (I'm quite short, 1.61m/5′3″).\nI'll definitely want my decision to be future-proof. So, please help me decide between the two bags! And of course, if you have any more insights on the two bags (especially the Eagle Creek as there are tons of posts on the Fairview already), tell me!\n\nSorry for the long post but thanks for reading it! I appreciate your insights!!",
        "author": "_parrotlet_",
        "score": 46,
        "numComments": 26,
        "created": 1710794725,
        "comments": [
          {
            "author": "LSATMaven",
            "body": "I'm team Fairview, so not unbiased. :)\n\nThis is going to sound silly, but, you know how the zippers don't go quite all the way to the bottom on the Fairview? Are you sure you are filling up all the space at the bottom?  I often find that even once I have my packing cubes in the bag, if I need to shove in my giant Hoka recovery slides or something, if I feel around at the bottom past the zippers there is more room than I realized and I can shove more stuff down there.  Maybe try putting your trail runners down there?",
            "score": 15,
            "created": 1710797456,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "So, I’ve now tried this and I can confirm that there actually was quite some space left at the bottom. With some restructuring and improved Tetris packing, everything fits now comfortably! Thanks a lot!",
                "score": 6,
                "created": 1710873929
              },
              {
                "author": "_parrotlet_",
                "body": "Great suggestion, I’ll try that out! Thanks!",
                "score": 2,
                "created": 1710826418
              }
            ]
          },
          {
            "author": "Perfect_Profit_7696",
            "body": "Did you already try packing your socks inside your shoes? And I don't know what types of bras but if any are on the more formed side, placing one cup inside the other then packing your undies inside that can also help with space. (I don't use packing cubes though so I dk if this will have the same impact for making more shoe space)\n\nEdited to add:\nAlso, is there any chance you could stand to wear both sweaters on the plane? \n\nAnd... I know this is a long shot especially since you're presenting, but is there any way you can take just your tablet and leave your laptop? Do you already have a keyboard for it? It's a game changer if you can\n\nEdited again to add:\nI dk what the battery life is like in your iPad but can you also load the Kindle app on that or on your phone and read on one of those? My \"kindle\" is actually a fire tablet about the same size as your iPad and your case looks like it may already fold to stand up. My battery lasts plenty long as long as I turn off wifi/Internet etc. \n\nIf you can change your electronics like these ideas just make sure you also take a slightly longer charging cord so you can comfortably read or work while charging because you'll be more dependent on each item",
            "score": 7,
            "created": 1710804082,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I didn’t try either one yet, but these sound like good tips. Maybe I should also only use one packing cube and stuff everything else into the backpack as is.\n\nI think wearing both sweaters will be too warm for me. And in that case, I’ll have to carry lots of stuff in my hands, so I think I should really try to get the second sweater into the backpack.\n\nMy laptop is my main work device (computer science haha), so if something needs to stay home, it will be my iPad. The iPad would just be convenient for having all my notes and brainstorming, but some sheets of paper will probably do fine, too. (Also since the iPad is not the newest anymore, its battery doesn’t last super long and investing into a keyboard doesn’t make too much sense because of this.. but otherwise, I agree with your suggestions!)",
                "score": 3,
                "created": 1710830381
              }
            ]
          },
          {
            "author": "ireadrot",
            "body": "Comfort over all else. If the Osprey is more comfortable to carry on your back take that. You won't care what you may look like after carrying it for hours. \n\nI'd drop the long sleeves if you're taking heat tech tanks or drop one and one of the blouses too. The extra sweater too because unnecessary bulk and you're wearing one on the trip over. \n\nAre the slides for showers? Because if not don't take them, it's just unnecessary bulk. While its handy to have slides, which I always travel with some, I never travel with boots either. I wear the shoes and carry the slides in my bag but I'm guessing your boots are for work.\n\nUnderwear I'd drop a couple of pairs too, but I am an undies washer when I shower and found that I don't need many pairs when they dry overnight. \n\nThese are just my perspective no judgement.",
            "score": 6,
            "created": 1710803690,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I think you're right. I will do a bit of walking with both backpacks this afternoon as another person here suggested, but I guess the more reasonable choice is taking the Fairview.\n\nAs I'm not yet used to trying to pack minimally in any way, I fear that I won't have enough options like this, but I will think about that. Thanks for the suggestions!\n\nYes, in Copenhagen there will be shared showers, so I'll definitely need slides. However, I'll try to find some more packable ones.",
                "score": 1,
                "created": 1710835333
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1710802332,
            "replies": [
              {
                "author": "Perfect_Profit_7696",
                "body": "Or maybe a smaller type of sneaker like Roxy Bayshore. The sole is less protective but they fit in a much tighter space",
                "score": 3,
                "created": 1710805847
              },
              {
                "author": "_parrotlet_",
                "body": "I'll have a look for other, more packable slippers. But since there are shared showers at the place in Copenhagen where I'll stay, I will definitely need to bring some kind of slippers.\nI'm hoping of doing some sports while being in Lund (hiking, running and/or gym, I don’t know yet how much time I have and what will be possible), and the trail runners feel like the most versatile option I have for all of this (plus they are waterproof). \nAlso, temperatures will be around 2–10°C (35–50°F) and I'm easily getting cold feet, so this is why I thought of bringing the bulky boots.\n\nBut maybe I'm just not used to pare down on shoes yet. I will try to do some Tetris packing again with what's currently on my packing list and if this doesn't help, I will try to replace the docs with some more packable sneakers. So, thanks for your suggestions!",
                "score": 1,
                "created": 1710833272
              }
            ]
          },
          {
            "author": "turnybutton",
            "body": "You don't actually have a ton of stuff listed here, so I'd guess that you could fit all of this more comfortably into either bag with some Tetris packing! That being said, there are a few places you could cut down:\n\nTech: Since you're bringing a laptop, iPad, \\*and\\* Kindle, I think you're right that you should leave one behind. It sounds like you need the laptop for work, and I know I don't use my laptop for personal things, but two entertainment devices probably aren't necessary!\n\nClothing: You also probably don't need two sets of leggings if you're also bringing pajama pants. Also, bringing three pairs of shoes can be tough. Are your boots comfy enough for hiking? Or do you have a shoe that can do both?\n\nAs for the backpack -  the Osprey backpack is wildly popular in this and the other onebagging sub, and I agree that comfort is super important! Try packing the Eagle Creek, walking around with it on for an hour, and see if you change your own mind :-D",
            "score": 3,
            "created": 1710811612,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "Yes, when reading through the comments here, I realised that I really need to amp up my Tetris skills!\n\nI guess I agree, although I will not primarily use the iPad for entertainment purposes but rather for taking notes and having all my notes together. But I think I can also make do without the iPad and just use some sheets of paper for brainstorming.\n\nRegarding shoes: I'm hoping of doing some sports while being there like running or maybe even going to a gym (+ hiking like you mentioned), so this explains why I'd like to pack the running shoes. On the other hand, temperatures will be around 2–10°C (35–50°F), so bringing boots is probably also not a bad idea. As for the slides, I don't think I can ditch those as I'll need them for shared showers in Copenhagen. But I'll see whether I can find some other slides that are more packable.\n\nOh yes, I'll do that this afternoon! Thanks for your suggestions!",
                "score": 3,
                "created": 1710832369
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/x56ub3fzm5pc1.jpg?width=5712&format=pjpg&auto=webp&s=66c60c04b445d0508d7ca58d064a05c400cd66f7",
      "thread": {
        "title": "15 Days in Lund (Sweden) — Packing List &amp; Backpack Decision Help",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1bi1erm/15_days_in_lund_sweden_packing_list_backpack/",
        "selftext": "(Sorry in advance, super long post)\n\nHi guys,\nI'd like your advice! In April, I will be doing my first onebagging trip. I’m going to Lund, Sweden, for 15 days as a work trip and then spend 2 more days in Copenhagen to see the city.\nI've never attempted onebagging before, but I'm eager to try it out (or rather 1.5-bagging as I'll have a daypack on me as well). So please bear with me if there is way too much stuff on my packing list! I'll probably check my main backpack as it's paid for by work anyways.\n\nMy bag will likely be the Eagle Creek Tour Travel Pack 40l or the Osprey Fairview 40l. I have both bags here to try them out, but I haven't decided yet which to keep. As for a daypack, I have the Osprey Fairview Daypack here to try out, but I'm happy to get recommendations for other daypacks available in Germany (similar size or a little smaller, packable, and a laptop compartment would be perfect).\n\nApparently, I will have access to a laundry room, but still, I want to have at least a little variety in my outfits as it's a work trip (luckily the dresscode will still be quite casual).\nI guess I will be inside most of the time and thus don't really need too many warm clothes. Also, I feel like I can layer the clothes that I plan for already rather decently.\n\nSo, here's my current packing list:\n\n## Daypack (Hand Luggage)\n- Wallet with stuff that goes into a wallet\n- Refillable water bottle (0.5l)\n- Packable tote bag\n- Phone + charging cable\n- Watch + charging cable\n- Charging brick (for watch and phone, must be USB-C because of charging cable for watch)\n- In-ear headphones\n- iPad (would be very nice for work but needs extra charging brick and charging cable because of Lightning, duh)\n- Kindle\n- Laptop\n- Presenter, as I will have to give a talk at some point\n- AirTag \n- One set of undies and socks to mitigate single points of failure lol (i.e. main bag gets lost)\n- Some snacks\n- Liquids Bag: Deodorant, hand sanitizer, ibuprofen: 1-2x, chapstick\n\n## Main Backpack\n- Charging brick and cable for laptop\n- Computer mouse (still undecided, would be nice for work)\n- AirTag\n\n### Clothing\n- Longsleeves: 2x\n- Blouses: 2x\n- Sweaters: 1x\n- Jeans: 1x (in winter, I wear jeans almost exclusively)\n- Head band, gloves (depends on weather forecast)\n- Sets of undies and socks: 5x\n- Base layers: 2x (tank tops, maybe Heattech?)\n- Pyjamas: 1x\n- Sports: 2 leggings (also for layering underneath jeans and chilling at home, thus 2), 1 shirt, 1 sports bra\n- Shoes: trail-runners (GoreTex), Adidas Adilettes (also for wearing at home with socks)\n\n### Washing Bag\n- Toothbrush, small toothpaste\n- Face wash (decanted into contact lens case)\n- Face cream (already half empty, will be empty at end of trip, then throw away)\n- Tiny eyebrow pencil\n- Concealer (decanted into contact lens case)\n- Hairbrush, some bobby pins, hair ties\n- Plasters, blister plasters, some more ibuprofen\n- Shampoo bar\n- Shaver\n- Small hand lotion\n\nWhat I will wear when travelling (i.e. doesn't need to fit into the backpack):\n- Jeans\n- T-shirt\n- Sweater\n- Thin scarf\n- Winter coat (3-in-1, can be separated into rain coat and fleece jacket, not super stylish but practical)\n- DocMartens\n\nI tried packing all this stuff into the backpacks and space is quite tight to say the least. It feels like there is a little more space in the Fairview than in the Eagle Creek, but the trail-runners fit into neither of them and need to go extra anyway.\nI feel like I’m already not bringing too much unnecessary stuff, but if you have any recommendations on how to pare down further, please fire away!\n\nI'm kind of torn between the two backpacks. I really like the design of the Eagle Creek, and if I followed my heart, I would go with this one (sorry, cheesy!). However, the straps actually feel a bit uncomfortable (not sure if not just badly adjusted), it feels a bit smaller than the Fairview, and the hip belts don't really do anything.\nOn the other hand, the Fairview feels so thought through, especially with the different ways to attach the daypack. So, this one would probably be the more rational choice. However, although I like the colour and its overall appearance in general, I look a bit like a turtle wearing it (I'm quite short, 1.61m/5′3″).\nI'll definitely want my decision to be future-proof. So, please help me decide between the two bags! And of course, if you have any more insights on the two bags (especially the Eagle Creek as there are tons of posts on the Fairview already), tell me!\n\nSorry for the long post but thanks for reading it! I appreciate your insights!!",
        "author": "_parrotlet_",
        "score": 46,
        "numComments": 26,
        "created": 1710794725,
        "comments": [
          {
            "author": "LSATMaven",
            "body": "I'm team Fairview, so not unbiased. :)\n\nThis is going to sound silly, but, you know how the zippers don't go quite all the way to the bottom on the Fairview? Are you sure you are filling up all the space at the bottom?  I often find that even once I have my packing cubes in the bag, if I need to shove in my giant Hoka recovery slides or something, if I feel around at the bottom past the zippers there is more room than I realized and I can shove more stuff down there.  Maybe try putting your trail runners down there?",
            "score": 15,
            "created": 1710797456,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "So, I’ve now tried this and I can confirm that there actually was quite some space left at the bottom. With some restructuring and improved Tetris packing, everything fits now comfortably! Thanks a lot!",
                "score": 6,
                "created": 1710873929
              },
              {
                "author": "_parrotlet_",
                "body": "Great suggestion, I’ll try that out! Thanks!",
                "score": 2,
                "created": 1710826418
              }
            ]
          },
          {
            "author": "Perfect_Profit_7696",
            "body": "Did you already try packing your socks inside your shoes? And I don't know what types of bras but if any are on the more formed side, placing one cup inside the other then packing your undies inside that can also help with space. (I don't use packing cubes though so I dk if this will have the same impact for making more shoe space)\n\nEdited to add:\nAlso, is there any chance you could stand to wear both sweaters on the plane? \n\nAnd... I know this is a long shot especially since you're presenting, but is there any way you can take just your tablet and leave your laptop? Do you already have a keyboard for it? It's a game changer if you can\n\nEdited again to add:\nI dk what the battery life is like in your iPad but can you also load the Kindle app on that or on your phone and read on one of those? My \"kindle\" is actually a fire tablet about the same size as your iPad and your case looks like it may already fold to stand up. My battery lasts plenty long as long as I turn off wifi/Internet etc. \n\nIf you can change your electronics like these ideas just make sure you also take a slightly longer charging cord so you can comfortably read or work while charging because you'll be more dependent on each item",
            "score": 7,
            "created": 1710804082,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I didn’t try either one yet, but these sound like good tips. Maybe I should also only use one packing cube and stuff everything else into the backpack as is.\n\nI think wearing both sweaters will be too warm for me. And in that case, I’ll have to carry lots of stuff in my hands, so I think I should really try to get the second sweater into the backpack.\n\nMy laptop is my main work device (computer science haha), so if something needs to stay home, it will be my iPad. The iPad would just be convenient for having all my notes and brainstorming, but some sheets of paper will probably do fine, too. (Also since the iPad is not the newest anymore, its battery doesn’t last super long and investing into a keyboard doesn’t make too much sense because of this.. but otherwise, I agree with your suggestions!)",
                "score": 3,
                "created": 1710830381
              }
            ]
          },
          {
            "author": "ireadrot",
            "body": "Comfort over all else. If the Osprey is more comfortable to carry on your back take that. You won't care what you may look like after carrying it for hours. \n\nI'd drop the long sleeves if you're taking heat tech tanks or drop one and one of the blouses too. The extra sweater too because unnecessary bulk and you're wearing one on the trip over. \n\nAre the slides for showers? Because if not don't take them, it's just unnecessary bulk. While its handy to have slides, which I always travel with some, I never travel with boots either. I wear the shoes and carry the slides in my bag but I'm guessing your boots are for work.\n\nUnderwear I'd drop a couple of pairs too, but I am an undies washer when I shower and found that I don't need many pairs when they dry overnight. \n\nThese are just my perspective no judgement.",
            "score": 6,
            "created": 1710803690,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "I think you're right. I will do a bit of walking with both backpacks this afternoon as another person here suggested, but I guess the more reasonable choice is taking the Fairview.\n\nAs I'm not yet used to trying to pack minimally in any way, I fear that I won't have enough options like this, but I will think about that. Thanks for the suggestions!\n\nYes, in Copenhagen there will be shared showers, so I'll definitely need slides. However, I'll try to find some more packable ones.",
                "score": 1,
                "created": 1710835333
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1710802332,
            "replies": [
              {
                "author": "Perfect_Profit_7696",
                "body": "Or maybe a smaller type of sneaker like Roxy Bayshore. The sole is less protective but they fit in a much tighter space",
                "score": 3,
                "created": 1710805847
              },
              {
                "author": "_parrotlet_",
                "body": "I'll have a look for other, more packable slippers. But since there are shared showers at the place in Copenhagen where I'll stay, I will definitely need to bring some kind of slippers.\nI'm hoping of doing some sports while being in Lund (hiking, running and/or gym, I don’t know yet how much time I have and what will be possible), and the trail runners feel like the most versatile option I have for all of this (plus they are waterproof). \nAlso, temperatures will be around 2–10°C (35–50°F) and I'm easily getting cold feet, so this is why I thought of bringing the bulky boots.\n\nBut maybe I'm just not used to pare down on shoes yet. I will try to do some Tetris packing again with what's currently on my packing list and if this doesn't help, I will try to replace the docs with some more packable sneakers. So, thanks for your suggestions!",
                "score": 1,
                "created": 1710833272
              }
            ]
          },
          {
            "author": "turnybutton",
            "body": "You don't actually have a ton of stuff listed here, so I'd guess that you could fit all of this more comfortably into either bag with some Tetris packing! That being said, there are a few places you could cut down:\n\nTech: Since you're bringing a laptop, iPad, \\*and\\* Kindle, I think you're right that you should leave one behind. It sounds like you need the laptop for work, and I know I don't use my laptop for personal things, but two entertainment devices probably aren't necessary!\n\nClothing: You also probably don't need two sets of leggings if you're also bringing pajama pants. Also, bringing three pairs of shoes can be tough. Are your boots comfy enough for hiking? Or do you have a shoe that can do both?\n\nAs for the backpack -  the Osprey backpack is wildly popular in this and the other onebagging sub, and I agree that comfort is super important! Try packing the Eagle Creek, walking around with it on for an hour, and see if you change your own mind :-D",
            "score": 3,
            "created": 1710811612,
            "replies": [
              {
                "author": "_parrotlet_",
                "body": "Yes, when reading through the comments here, I realised that I really need to amp up my Tetris skills!\n\nI guess I agree, although I will not primarily use the iPad for entertainment purposes but rather for taking notes and having all my notes together. But I think I can also make do without the iPad and just use some sheets of paper for brainstorming.\n\nRegarding shoes: I'm hoping of doing some sports while being there like running or maybe even going to a gym (+ hiking like you mentioned), so this explains why I'd like to pack the running shoes. On the other hand, temperatures will be around 2–10°C (35–50°F), so bringing boots is probably also not a bad idea. As for the slides, I don't think I can ditch those as I'll need them for shared showers in Copenhagen. But I'll see whether I can find some other slides that are more packable.\n\nOh yes, I'll do that this afternoon! Thanks for your suggestions!",
                "score": 3,
                "created": 1710832369
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/q3jtweyecrke1.jpg?width=3072&format=pjpg&auto=webp&s=2a5237684282375d03d6d43477f4004957fa2f4c",
      "thread": {
        "title": "Eagle Creek 40L Tour Travel Pack",
        "url": "https://www.reddit.com/r/backpacks/comments/1ivtfvn/eagle_creek_40l_tour_travel_pack/",
        "selftext": "I was so excited when I saw the launch of this new pack from Eagle Creek, I thought it was my saviour to all my onebag problems. But, I've had it for half an hour and I'm already massively disappointed.\n\nI'm comparing this to my Matador Globerider that I bought at the same time...\n\nFabrics - I'm shocked how cheap this Eagle Creek bag feels, so plasticy and rough\n\nThis applies to the outer shell of the bag as well as the cheap feeling netting in the suitcase compartment.\n\nThe Duffel System - in their promo videos this seemed like a genius invention and it still probably could be, but I'm struggling to look past the super long strap that flaps on the bag when its pulled tight, it's ugly and should have been designed better.\n\nThe Strap Compartment - firstly this wasn't intuitive to use, I unzipped the straps, pulled them out and then there's no clear direction on where to stow this bag flappy unzipped fabric, so I showed it at the bottom with the hip belt.\n\nBut as you can see in one of the images, this leaves 2 noisy zippers at the bottom of the bag which are very likely to boucnce around in use.\n\nThe Pull Handles - lastly I was shocked how thin and cheap the handles are on the top and side, no padding, just cheap canvas that will hurt after about 20 seconds of carrying.\n\nAll this has made me glad I bought the Matador Globerider, I'll be keeping that and sending this sad bag back.",
        "author": "JFFIASCO",
        "score": 32,
        "numComments": 0,
        "created": 1740259317,
        "comments": []
      }
    },
    {
      "image": "https://preview.redd.it/lb1i8pqecrke1.jpg?width=3072&format=pjpg&auto=webp&s=3dd1e19ccd532846ee4fd4c098a43d3f9271ac27",
      "thread": {
        "title": "Eagle Creek 40L Tour Travel Pack",
        "url": "https://www.reddit.com/r/backpacks/comments/1ivtfvn/eagle_creek_40l_tour_travel_pack/",
        "selftext": "I was so excited when I saw the launch of this new pack from Eagle Creek, I thought it was my saviour to all my onebag problems. But, I've had it for half an hour and I'm already massively disappointed.\n\nI'm comparing this to my Matador Globerider that I bought at the same time...\n\nFabrics - I'm shocked how cheap this Eagle Creek bag feels, so plasticy and rough\n\nThis applies to the outer shell of the bag as well as the cheap feeling netting in the suitcase compartment.\n\nThe Duffel System - in their promo videos this seemed like a genius invention and it still probably could be, but I'm struggling to look past the super long strap that flaps on the bag when its pulled tight, it's ugly and should have been designed better.\n\nThe Strap Compartment - firstly this wasn't intuitive to use, I unzipped the straps, pulled them out and then there's no clear direction on where to stow this bag flappy unzipped fabric, so I showed it at the bottom with the hip belt.\n\nBut as you can see in one of the images, this leaves 2 noisy zippers at the bottom of the bag which are very likely to boucnce around in use.\n\nThe Pull Handles - lastly I was shocked how thin and cheap the handles are on the top and side, no padding, just cheap canvas that will hurt after about 20 seconds of carrying.\n\nAll this has made me glad I bought the Matador Globerider, I'll be keeping that and sending this sad bag back.",
        "author": "JFFIASCO",
        "score": 32,
        "numComments": 0,
        "created": 1740259317,
        "comments": []
      }
    },
    {
      "image": "https://preview.redd.it/t3pms7bfcrke1.jpg?width=3072&format=pjpg&auto=webp&s=2dc3eb44360c532070083c0bc66107df0f73c67a",
      "thread": {
        "title": "Eagle Creek 40L Tour Travel Pack",
        "url": "https://www.reddit.com/r/backpacks/comments/1ivtfvn/eagle_creek_40l_tour_travel_pack/",
        "selftext": "I was so excited when I saw the launch of this new pack from Eagle Creek, I thought it was my saviour to all my onebag problems. But, I've had it for half an hour and I'm already massively disappointed.\n\nI'm comparing this to my Matador Globerider that I bought at the same time...\n\nFabrics - I'm shocked how cheap this Eagle Creek bag feels, so plasticy and rough\n\nThis applies to the outer shell of the bag as well as the cheap feeling netting in the suitcase compartment.\n\nThe Duffel System - in their promo videos this seemed like a genius invention and it still probably could be, but I'm struggling to look past the super long strap that flaps on the bag when its pulled tight, it's ugly and should have been designed better.\n\nThe Strap Compartment - firstly this wasn't intuitive to use, I unzipped the straps, pulled them out and then there's no clear direction on where to stow this bag flappy unzipped fabric, so I showed it at the bottom with the hip belt.\n\nBut as you can see in one of the images, this leaves 2 noisy zippers at the bottom of the bag which are very likely to boucnce around in use.\n\nThe Pull Handles - lastly I was shocked how thin and cheap the handles are on the top and side, no padding, just cheap canvas that will hurt after about 20 seconds of carrying.\n\nAll this has made me glad I bought the Matador Globerider, I'll be keeping that and sending this sad bag back.",
        "author": "JFFIASCO",
        "score": 32,
        "numComments": 0,
        "created": 1740259317,
        "comments": []
      }
    },
    {
      "image": "https://preview.redd.it/64acjh4fcrke1.jpg?width=3072&format=pjpg&auto=webp&s=cf740f7cb5303fb7a260c21154a43b4fb30fe3cb",
      "thread": {
        "title": "Eagle Creek 40L Tour Travel Pack",
        "url": "https://www.reddit.com/r/backpacks/comments/1ivtfvn/eagle_creek_40l_tour_travel_pack/",
        "selftext": "I was so excited when I saw the launch of this new pack from Eagle Creek, I thought it was my saviour to all my onebag problems. But, I've had it for half an hour and I'm already massively disappointed.\n\nI'm comparing this to my Matador Globerider that I bought at the same time...\n\nFabrics - I'm shocked how cheap this Eagle Creek bag feels, so plasticy and rough\n\nThis applies to the outer shell of the bag as well as the cheap feeling netting in the suitcase compartment.\n\nThe Duffel System - in their promo videos this seemed like a genius invention and it still probably could be, but I'm struggling to look past the super long strap that flaps on the bag when its pulled tight, it's ugly and should have been designed better.\n\nThe Strap Compartment - firstly this wasn't intuitive to use, I unzipped the straps, pulled them out and then there's no clear direction on where to stow this bag flappy unzipped fabric, so I showed it at the bottom with the hip belt.\n\nBut as you can see in one of the images, this leaves 2 noisy zippers at the bottom of the bag which are very likely to boucnce around in use.\n\nThe Pull Handles - lastly I was shocked how thin and cheap the handles are on the top and side, no padding, just cheap canvas that will hurt after about 20 seconds of carrying.\n\nAll this has made me glad I bought the Matador Globerider, I'll be keeping that and sending this sad bag back.",
        "author": "JFFIASCO",
        "score": 32,
        "numComments": 0,
        "created": 1740259317,
        "comments": []
      }
    },
    {
      "image": "https://preview.redd.it/8842yw1z1ard1.jpg?width=3024&format=pjpg&auto=webp&s=b372131ed78a15c6a0316379d56a59c1ba0562b1",
      "thread": {
        "title": "Two months in Europe in October and November, starting in Estonia and ending in Greece",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1fqfewn/two_months_in_europe_in_october_and_november/",
        "selftext": "Instead of the blundstones I’ll probably bring hoka tennis shoes because the boots take up so much room!\n2 sweaters \n1 cardigan \n1 jeans \n1 stretchy wide leg pants \n1 tencel blend comfy pants \n3 t shirts \n1 long sleeve tee\n1 midi silk dress\n1 pajama shorts\n1 swimsuit \n4 socks\n7 underwear \nToiletries, makeup, medication, contacts, glasses\nPatagonia puffer\nKindle\nUniqlo purse \nNot pictured: chargers, power adapter, earbuds, sleeping mask, scarf, sunglasses, tevas, nanobag",
        "author": "Mountain_Nose6487",
        "score": 65,
        "numComments": 24,
        "created": 1727410395,
        "comments": [
          {
            "author": "Gurlfrommars",
            "body": "I think you'll need a rain coat or umbrella.\n\nIf Blundstones are taking up a lot of room I'd wear those while moving around and pack the trainers.",
            "score": 26,
            "created": 1727422306,
            "replies": [
              {
                "author": "EmbarrassedPatient61",
                "body": "I’d keep the Blundstones. Estonia in October is pretty cold and rainy. I was there last year at that time and lived in my waterproof Sorels or my waterproof Salomons.",
                "score": 6,
                "created": 1727444409
              },
              {
                "author": "Mountain_Nose6487",
                "body": "I worry that the blundstones won’t be comfortable for walking a lot. They kind of give me blisters on my ankle.",
                "score": 1,
                "created": 1727460845
              }
            ]
          },
          {
            "author": "lovely-pickle",
            "body": "Second the comment about a rain coat- you'll definitely need it.\n\n\nAre you anticipating lots of walking in the Tevas? What are your imagined use-cases. Even in Greece I feel like you're already out of season (although it probably depends where). If they're just to have a sandal for pebbly beaches, then I'd probably suggest a smaller plastic flipflop.",
            "score": 11,
            "created": 1727426013,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I was hoping I wouldn’t have to bring it. My rain jacket doesn’t pack up very small…",
                "score": 1,
                "created": 1727460869
              }
            ]
          },
          {
            "author": "writemoreletters",
            "body": "If you wanted to trim space, you could also look at leaving one sweater or cardigan. If you need it, you can pick up one as a souvenir while traveling.",
            "score": 2,
            "created": 1727444327,
            "replies": []
          },
          {
            "author": "SpecialistFlaky8480",
            "body": "Looks solid! How big is your bag?",
            "score": 2,
            "created": 1727414525,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "40 liters! It’s the Eagle creek tour 40",
                "score": 6,
                "created": 1727414664
              }
            ]
          },
          {
            "author": "starsdonttakesides",
            "body": "How do you like the uniqlo bag? I see everyone raving about it and it does look nice but I have too many purses already.",
            "score": 1,
            "created": 1727427325,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I love it! I plan on using it as my personal item for the plane. It fits my kindle perfectly",
                "score": 2,
                "created": 1727460893
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/9oj37x1z1ard1.jpg?width=3024&format=pjpg&auto=webp&s=af34d307a5efe484afa4cec6da5ee1a79728c7fb",
      "thread": {
        "title": "Two months in Europe in October and November, starting in Estonia and ending in Greece",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1fqfewn/two_months_in_europe_in_october_and_november/",
        "selftext": "Instead of the blundstones I’ll probably bring hoka tennis shoes because the boots take up so much room!\n2 sweaters \n1 cardigan \n1 jeans \n1 stretchy wide leg pants \n1 tencel blend comfy pants \n3 t shirts \n1 long sleeve tee\n1 midi silk dress\n1 pajama shorts\n1 swimsuit \n4 socks\n7 underwear \nToiletries, makeup, medication, contacts, glasses\nPatagonia puffer\nKindle\nUniqlo purse \nNot pictured: chargers, power adapter, earbuds, sleeping mask, scarf, sunglasses, tevas, nanobag",
        "author": "Mountain_Nose6487",
        "score": 65,
        "numComments": 24,
        "created": 1727410395,
        "comments": [
          {
            "author": "Gurlfrommars",
            "body": "I think you'll need a rain coat or umbrella.\n\nIf Blundstones are taking up a lot of room I'd wear those while moving around and pack the trainers.",
            "score": 26,
            "created": 1727422306,
            "replies": [
              {
                "author": "EmbarrassedPatient61",
                "body": "I’d keep the Blundstones. Estonia in October is pretty cold and rainy. I was there last year at that time and lived in my waterproof Sorels or my waterproof Salomons.",
                "score": 6,
                "created": 1727444409
              },
              {
                "author": "Mountain_Nose6487",
                "body": "I worry that the blundstones won’t be comfortable for walking a lot. They kind of give me blisters on my ankle.",
                "score": 1,
                "created": 1727460845
              }
            ]
          },
          {
            "author": "lovely-pickle",
            "body": "Second the comment about a rain coat- you'll definitely need it.\n\n\nAre you anticipating lots of walking in the Tevas? What are your imagined use-cases. Even in Greece I feel like you're already out of season (although it probably depends where). If they're just to have a sandal for pebbly beaches, then I'd probably suggest a smaller plastic flipflop.",
            "score": 11,
            "created": 1727426013,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I was hoping I wouldn’t have to bring it. My rain jacket doesn’t pack up very small…",
                "score": 1,
                "created": 1727460869
              }
            ]
          },
          {
            "author": "writemoreletters",
            "body": "If you wanted to trim space, you could also look at leaving one sweater or cardigan. If you need it, you can pick up one as a souvenir while traveling.",
            "score": 2,
            "created": 1727444327,
            "replies": []
          },
          {
            "author": "SpecialistFlaky8480",
            "body": "Looks solid! How big is your bag?",
            "score": 2,
            "created": 1727414525,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "40 liters! It’s the Eagle creek tour 40",
                "score": 6,
                "created": 1727414664
              }
            ]
          },
          {
            "author": "starsdonttakesides",
            "body": "How do you like the uniqlo bag? I see everyone raving about it and it does look nice but I have too many purses already.",
            "score": 1,
            "created": 1727427325,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I love it! I plan on using it as my personal item for the plane. It fits my kindle perfectly",
                "score": 2,
                "created": 1727460893
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/eqff9x1z1ard1.jpg?width=3024&format=pjpg&auto=webp&s=44504971fb2c511e5cc5177095a5883eee87e90d",
      "thread": {
        "title": "Two months in Europe in October and November, starting in Estonia and ending in Greece",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1fqfewn/two_months_in_europe_in_october_and_november/",
        "selftext": "Instead of the blundstones I’ll probably bring hoka tennis shoes because the boots take up so much room!\n2 sweaters \n1 cardigan \n1 jeans \n1 stretchy wide leg pants \n1 tencel blend comfy pants \n3 t shirts \n1 long sleeve tee\n1 midi silk dress\n1 pajama shorts\n1 swimsuit \n4 socks\n7 underwear \nToiletries, makeup, medication, contacts, glasses\nPatagonia puffer\nKindle\nUniqlo purse \nNot pictured: chargers, power adapter, earbuds, sleeping mask, scarf, sunglasses, tevas, nanobag",
        "author": "Mountain_Nose6487",
        "score": 65,
        "numComments": 24,
        "created": 1727410395,
        "comments": [
          {
            "author": "Gurlfrommars",
            "body": "I think you'll need a rain coat or umbrella.\n\nIf Blundstones are taking up a lot of room I'd wear those while moving around and pack the trainers.",
            "score": 26,
            "created": 1727422306,
            "replies": [
              {
                "author": "EmbarrassedPatient61",
                "body": "I’d keep the Blundstones. Estonia in October is pretty cold and rainy. I was there last year at that time and lived in my waterproof Sorels or my waterproof Salomons.",
                "score": 6,
                "created": 1727444409
              },
              {
                "author": "Mountain_Nose6487",
                "body": "I worry that the blundstones won’t be comfortable for walking a lot. They kind of give me blisters on my ankle.",
                "score": 1,
                "created": 1727460845
              }
            ]
          },
          {
            "author": "lovely-pickle",
            "body": "Second the comment about a rain coat- you'll definitely need it.\n\n\nAre you anticipating lots of walking in the Tevas? What are your imagined use-cases. Even in Greece I feel like you're already out of season (although it probably depends where). If they're just to have a sandal for pebbly beaches, then I'd probably suggest a smaller plastic flipflop.",
            "score": 11,
            "created": 1727426013,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I was hoping I wouldn’t have to bring it. My rain jacket doesn’t pack up very small…",
                "score": 1,
                "created": 1727460869
              }
            ]
          },
          {
            "author": "writemoreletters",
            "body": "If you wanted to trim space, you could also look at leaving one sweater or cardigan. If you need it, you can pick up one as a souvenir while traveling.",
            "score": 2,
            "created": 1727444327,
            "replies": []
          },
          {
            "author": "SpecialistFlaky8480",
            "body": "Looks solid! How big is your bag?",
            "score": 2,
            "created": 1727414525,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "40 liters! It’s the Eagle creek tour 40",
                "score": 6,
                "created": 1727414664
              }
            ]
          },
          {
            "author": "starsdonttakesides",
            "body": "How do you like the uniqlo bag? I see everyone raving about it and it does look nice but I have too many purses already.",
            "score": 1,
            "created": 1727427325,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I love it! I plan on using it as my personal item for the plane. It fits my kindle perfectly",
                "score": 2,
                "created": 1727460893
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/2eiwlx1z1ard1.jpg?width=3024&format=pjpg&auto=webp&s=344bbfaa77653b9d0a06567158a0b07769c9cd51",
      "thread": {
        "title": "Two months in Europe in October and November, starting in Estonia and ending in Greece",
        "url": "https://www.reddit.com/r/HerOneBag/comments/1fqfewn/two_months_in_europe_in_october_and_november/",
        "selftext": "Instead of the blundstones I’ll probably bring hoka tennis shoes because the boots take up so much room!\n2 sweaters \n1 cardigan \n1 jeans \n1 stretchy wide leg pants \n1 tencel blend comfy pants \n3 t shirts \n1 long sleeve tee\n1 midi silk dress\n1 pajama shorts\n1 swimsuit \n4 socks\n7 underwear \nToiletries, makeup, medication, contacts, glasses\nPatagonia puffer\nKindle\nUniqlo purse \nNot pictured: chargers, power adapter, earbuds, sleeping mask, scarf, sunglasses, tevas, nanobag",
        "author": "Mountain_Nose6487",
        "score": 65,
        "numComments": 24,
        "created": 1727410395,
        "comments": [
          {
            "author": "Gurlfrommars",
            "body": "I think you'll need a rain coat or umbrella.\n\nIf Blundstones are taking up a lot of room I'd wear those while moving around and pack the trainers.",
            "score": 26,
            "created": 1727422306,
            "replies": [
              {
                "author": "EmbarrassedPatient61",
                "body": "I’d keep the Blundstones. Estonia in October is pretty cold and rainy. I was there last year at that time and lived in my waterproof Sorels or my waterproof Salomons.",
                "score": 6,
                "created": 1727444409
              },
              {
                "author": "Mountain_Nose6487",
                "body": "I worry that the blundstones won’t be comfortable for walking a lot. They kind of give me blisters on my ankle.",
                "score": 1,
                "created": 1727460845
              }
            ]
          },
          {
            "author": "lovely-pickle",
            "body": "Second the comment about a rain coat- you'll definitely need it.\n\n\nAre you anticipating lots of walking in the Tevas? What are your imagined use-cases. Even in Greece I feel like you're already out of season (although it probably depends where). If they're just to have a sandal for pebbly beaches, then I'd probably suggest a smaller plastic flipflop.",
            "score": 11,
            "created": 1727426013,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I was hoping I wouldn’t have to bring it. My rain jacket doesn’t pack up very small…",
                "score": 1,
                "created": 1727460869
              }
            ]
          },
          {
            "author": "writemoreletters",
            "body": "If you wanted to trim space, you could also look at leaving one sweater or cardigan. If you need it, you can pick up one as a souvenir while traveling.",
            "score": 2,
            "created": 1727444327,
            "replies": []
          },
          {
            "author": "SpecialistFlaky8480",
            "body": "Looks solid! How big is your bag?",
            "score": 2,
            "created": 1727414525,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "40 liters! It’s the Eagle creek tour 40",
                "score": 6,
                "created": 1727414664
              }
            ]
          },
          {
            "author": "starsdonttakesides",
            "body": "How do you like the uniqlo bag? I see everyone raving about it and it does look nice but I have too many purses already.",
            "score": 1,
            "created": 1727427325,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I love it! I plan on using it as my personal item for the plane. It fits my kindle perfectly",
                "score": 2,
                "created": 1727460893
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/44p8j2ylf49a1.jpg?width=1868&format=pjpg&auto=webp&s=16d5d6c183b0fd53e83dfb4c20b270df82e5df55",
      "thread": {
        "title": "What are these loop and plastic hooks for in my Eagle Creek Tour 40 L?",
        "url": "https://www.reddit.com/r/onebag/comments/zzf5t3/what_are_these_loop_and_plastic_hooks_for_in_my/",
        "selftext": "Documentation says “attachment for Pack-it integration “, but I have Eagle Creek packing cubes and can’t figure out how to use that loop and plastic hooks exactly. Thanks.",
        "author": "dodsferd22",
        "score": 7,
        "numComments": 12,
        "created": 1672443481,
        "comments": [
          {
            "author": "SeattleHikeBike",
            "body": "“ Use interior toggles to attach Pack-It™ solutions inside your bag, we recommend checking out the Pack-It™ Reveal E-Organizer Panel”\n\nhttps://www.eaglecreek.com/products/pack-it-reveal-e-organizer-panel\n\nThere are a couple other pouches with loops on the side to mate with those toggles. \n\nhttps://www.eaglecreek.com/products/pack-it-reveal-e-tools-organizer-pro",
            "score": 7,
            "created": 1672505788,
            "replies": [
              {
                "author": "dodsferd22",
                "body": "I see, some cubes have two loops for the plastic thingies. Mine don’t. I still can’t imagine how to use the loop, except with a carabiner, which still wouldn’t be very helpful.",
                "score": 1,
                "created": 1672509408
              }
            ]
          },
          {
            "author": "GiraffeBiscuit8",
            "body": "Oooh finally a bag that has the toggles! I've been wondering which models actually come with it. I highly recommend the [Eagle Creek Pack-it Reveal Org Convertible Backpack](https://www.eaglecreek.com/products/pack-it-reveal-org-convertible-pack) if you wanted a little daypack / tech organizer, and it would stay neatly at the top of your pack. Love it in both organizer and pack form.",
            "score": 3,
            "created": 1672528028,
            "replies": [
              {
                "author": "[deleted]",
                "body": "The Caldera luggage range has it and the Explore backpack has them too.",
                "score": 2,
                "created": 1672581826
              }
            ]
          },
          {
            "author": "dodsferd22",
            "body": "I just received my new Eagle Creek Tour 40 L backpack. Liking it so far but haven’t tested it for real yet. I’m wondering about the pictured plastic straps and the loop/handle on the inside. Feels like they have a specific purpose but I can’t figure out what for exactly. I have their packing cubes, but I still don’t get it. Any help is appreciated. Thanks.",
            "score": 1,
            "created": 1672443637,
            "replies": [
              {
                "author": "ship90",
                "body": "They sell some accessories that you can attach I believe like an organizer panel.",
                "score": 3,
                "created": 1672494268
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "See note 5.",
            "score": 0,
            "created": 1672520292,
            "replies": [
              {
                "author": "dodsferd22",
                "body": "I saw that, but I have a “pack-it” packing cube set and have no way to attach it there. I believe it’s for some models. I still don’t see how to use the loop.",
                "score": 1,
                "created": 1672521383
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/48h2r2ylf49a1.jpg?width=1348&format=pjpg&auto=webp&s=94bad1bd193fad143cd9f94898b8f0d08c522fac",
      "thread": {
        "title": "What are these loop and plastic hooks for in my Eagle Creek Tour 40 L?",
        "url": "https://www.reddit.com/r/onebag/comments/zzf5t3/what_are_these_loop_and_plastic_hooks_for_in_my/",
        "selftext": "Documentation says “attachment for Pack-it integration “, but I have Eagle Creek packing cubes and can’t figure out how to use that loop and plastic hooks exactly. Thanks.",
        "author": "dodsferd22",
        "score": 7,
        "numComments": 12,
        "created": 1672443481,
        "comments": [
          {
            "author": "SeattleHikeBike",
            "body": "“ Use interior toggles to attach Pack-It™ solutions inside your bag, we recommend checking out the Pack-It™ Reveal E-Organizer Panel”\n\nhttps://www.eaglecreek.com/products/pack-it-reveal-e-organizer-panel\n\nThere are a couple other pouches with loops on the side to mate with those toggles. \n\nhttps://www.eaglecreek.com/products/pack-it-reveal-e-tools-organizer-pro",
            "score": 7,
            "created": 1672505788,
            "replies": [
              {
                "author": "dodsferd22",
                "body": "I see, some cubes have two loops for the plastic thingies. Mine don’t. I still can’t imagine how to use the loop, except with a carabiner, which still wouldn’t be very helpful.",
                "score": 1,
                "created": 1672509408
              }
            ]
          },
          {
            "author": "GiraffeBiscuit8",
            "body": "Oooh finally a bag that has the toggles! I've been wondering which models actually come with it. I highly recommend the [Eagle Creek Pack-it Reveal Org Convertible Backpack](https://www.eaglecreek.com/products/pack-it-reveal-org-convertible-pack) if you wanted a little daypack / tech organizer, and it would stay neatly at the top of your pack. Love it in both organizer and pack form.",
            "score": 3,
            "created": 1672528028,
            "replies": [
              {
                "author": "[deleted]",
                "body": "The Caldera luggage range has it and the Explore backpack has them too.",
                "score": 2,
                "created": 1672581826
              }
            ]
          },
          {
            "author": "dodsferd22",
            "body": "I just received my new Eagle Creek Tour 40 L backpack. Liking it so far but haven’t tested it for real yet. I’m wondering about the pictured plastic straps and the loop/handle on the inside. Feels like they have a specific purpose but I can’t figure out what for exactly. I have their packing cubes, but I still don’t get it. Any help is appreciated. Thanks.",
            "score": 1,
            "created": 1672443637,
            "replies": [
              {
                "author": "ship90",
                "body": "They sell some accessories that you can attach I believe like an organizer panel.",
                "score": 3,
                "created": 1672494268
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "See note 5.",
            "score": 0,
            "created": 1672520292,
            "replies": [
              {
                "author": "dodsferd22",
                "body": "I saw that, but I have a “pack-it” packing cube set and have no way to attach it there. I believe it’s for some models. I still don’t see how to use the loop.",
                "score": 1,
                "created": 1672521383
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/rjehicrkhika1.jpg?width=4032&format=pjpg&auto=webp&s=8633c6eed3788eb8e1099c6841767026e6a8f501",
      "thread": {
        "title": "His&amp;Hers packing list: 2 weeks in India",
        "url": "https://www.reddit.com/r/onebag/comments/11ccs3s/hishers_packing_list_2_weeks_in_india/",
        "selftext": "",
        "author": "birdinthesky12",
        "score": 228,
        "numComments": 27,
        "created": 1677407970,
        "comments": [
          {
            "author": "birdinthesky12",
            "body": "We (31M &amp; 30F) are off on a two week trip to India, including a multi-day wedding and Holi. Given there are so many events, our list is a bit larger than it would have otherwise been. \n\nReally happy with this packing strategy over packing cubes. This way one can see everything *at a glance* when one opens the top, plus it saves some weight and it’s more flexible (aka allows for packing tetris)! \n\n——\nCLOTHES:\n*includes outfits worn on plane\n\nHis:\n- 1x suit (jacket &amp; trousers)\n- 1x shalwar kameez (shirt &amp; trousers)\n- 1x jeans\n- 1x zip off pants/shorts\n- 1x cotton shorts \n- 1x swim shorts\n- 1x long sleeve rashguard \n- 4x t-shirts \n- 2x polo shirts \n- 3x dress shirts \n- 6x boxers \n- 4x socks \n- 1x running shoes\n- 1x dress shoes \n- 1x flip flops\n- 1x zippable fleece \n- 1x light down jacket \n- 1x rain jacket \n\nHers:\n- 1x t-shirt\n- 1x half sleeve blouse \n- 1x long sleeve shirt  \n- 1x short sleeved crop top\n- 1x long sleeve rashguard \n- 1x swim shorts \n- 1x cotton shorts \n- 1x trousers \n- 2x sleeved midi dresses \n- 1x sleeveless maxi dress \n- 1x shalwar kameez (tunic, pants, scarf)\n- 1x lehenga (blouse, skirt, scarf)\n- 2x bikini \n- 1x socks\n- 6x underwear \n- 1x running shoes \n- 1x heeled sandals\n- 1x flip flop sandals\n- 1x zippable fleece \n- 1x light down jacket \n- 1x rain jacket  \n\n——\nFLUIDS: \n- 2x deodorant (his &amp; hers) \n- Sunscreen \n- Toothpaste\n- Anti-mosquito spray\n- Voltaren (anti-pain cream)\n- Antiseptic cream\n- Deep conditioner \n- Lipstick, mascara, eyeshadow, foundation \n\n——\nMEDICAL KIT:\n- Ibuprofen\n- Immodium\n- Anti-acid tablets \n- Ricola lozenges \n- Bite away\n- Band-aids\n\n——\nELECTRONICS:\n- 2x iPhones \n- Laptop &amp; charger \n- iPad &amp; charger \n- Travel adaptor \n\n——\nMISCELLANEOUS:\n- 17l daypack\n- 2x water bottles \n- Electronic toothbrush w/ 2 heads\n- Mini travel towel \n- Sunglasses \n- Jewelry \n- Sleeping mask\n- 2x passports \n- 2x slim wallets \n\n——\nBAGS:\n- 40L Thule Chasm duffel\n- 40L Eagle Creek Tour Travel \n\nWe took the Thule duffel because we already had it. We originally bought it for a sailing trip and for that and other boat trips, it’s great: the bag is waterproof, and for such trips we’re not doing a lot of walking with the bag. With more walking, like on this trip, it is definitely annoying to carry it around: although there are backpack straps, since there is no hip belt, it’s uncomfortable to wear on the back. Because it’s a duffel though, there is no place “wasted” for back padding and this bag is just so, so roomy.\n\nThe Eagle Creek is a new purchase and very happy with it so far! Can highly recommend it. It is a clamshell, is very lightweight (compared to most other clamshell backpacks), has an integrated hip belt, side laptop pocket AND side water bottle pocket, anti theft features, and an integrated rain cover that can go over the front or the back. The only thing is it’s more like a 35L than the specified 40L.",
            "score": 28,
            "created": 1677407992,
            "replies": [
              {
                "author": "shim12",
                "body": "How are you planning to get wrinkles out of your suit? Will you have access to an iron or steamer?",
                "score": 10,
                "created": 1677433123
              },
              {
                "author": "birlin01",
                "body": "More like a 35L even when the Eagle Creek is expanded?",
                "score": 2,
                "created": 1677467233
              }
            ]
          },
          {
            "author": "doctorkat",
            "body": "I noticed anti mosquito cream and bite away, but no malaria tablets - you may want to check if you're going to a risk area",
            "score": 24,
            "created": 1677421670,
            "replies": [
              {
                "author": "birdinthesky12",
                "body": "Yes, good point! We checked &amp; won’t be: we will be in the “golden triangle” and in Goa. Most of India is thankfully malaria-free.",
                "score": 24,
                "created": 1677424016
              }
            ]
          },
          {
            "author": "mehtamorphosis",
            "body": "impressive! how do you pack the suit in your backpack?",
            "score": 13,
            "created": 1677425270,
            "replies": [
              {
                "author": "birdinthesky12",
                "body": "It’s packed in a suit garment bag, which protects it. The bag is at the bottom of the duffel: because the duffel doesn’t have a rigid structure, we could put the garment bag in and then curve it around the sides of the duffel. The other clothing &amp; shoes get stacked on top.",
                "score": 3,
                "created": 1677504947
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 13,
            "created": 1677421990,
            "replies": [
              {
                "author": "birdinthesky12",
                "body": "Thank you — we are very excited!",
                "score": 9,
                "created": 1677424041
              }
            ]
          },
          {
            "author": "stiina22",
            "body": "This is a very exciting trip! Have a great time at the wedding and celebrating Holi! The eagle Creek pack looks super sleek. Love it.",
            "score": 5,
            "created": 1677427552,
            "replies": [
              {
                "author": "birdinthesky12",
                "body": "Thank you! And the eagle creek pack is both sleek and comfortable so far. Really happy with the purchase.",
                "score": 2,
                "created": 1677505019
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/whlj0drkhika1.jpg?width=4032&format=pjpg&auto=webp&s=ec0e49e14d5a03b8a99d40679e86ad11033a2268",
      "thread": {
        "title": "His&amp;Hers packing list: 2 weeks in India",
        "url": "https://www.reddit.com/r/onebag/comments/11ccs3s/hishers_packing_list_2_weeks_in_india/",
        "selftext": "",
        "author": "birdinthesky12",
        "score": 228,
        "numComments": 27,
        "created": 1677407970,
        "comments": [
          {
            "author": "birdinthesky12",
            "body": "We (31M &amp; 30F) are off on a two week trip to India, including a multi-day wedding and Holi. Given there are so many events, our list is a bit larger than it would have otherwise been. \n\nReally happy with this packing strategy over packing cubes. This way one can see everything *at a glance* when one opens the top, plus it saves some weight and it’s more flexible (aka allows for packing tetris)! \n\n——\nCLOTHES:\n*includes outfits worn on plane\n\nHis:\n- 1x suit (jacket &amp; trousers)\n- 1x shalwar kameez (shirt &amp; trousers)\n- 1x jeans\n- 1x zip off pants/shorts\n- 1x cotton shorts \n- 1x swim shorts\n- 1x long sleeve rashguard \n- 4x t-shirts \n- 2x polo shirts \n- 3x dress shirts \n- 6x boxers \n- 4x socks \n- 1x running shoes\n- 1x dress shoes \n- 1x flip flops\n- 1x zippable fleece \n- 1x light down jacket \n- 1x rain jacket \n\nHers:\n- 1x t-shirt\n- 1x half sleeve blouse \n- 1x long sleeve shirt  \n- 1x short sleeved crop top\n- 1x long sleeve rashguard \n- 1x swim shorts \n- 1x cotton shorts \n- 1x trousers \n- 2x sleeved midi dresses \n- 1x sleeveless maxi dress \n- 1x shalwar kameez (tunic, pants, scarf)\n- 1x lehenga (blouse, skirt, scarf)\n- 2x bikini \n- 1x socks\n- 6x underwear \n- 1x running shoes \n- 1x heeled sandals\n- 1x flip flop sandals\n- 1x zippable fleece \n- 1x light down jacket \n- 1x rain jacket  \n\n——\nFLUIDS: \n- 2x deodorant (his &amp; hers) \n- Sunscreen \n- Toothpaste\n- Anti-mosquito spray\n- Voltaren (anti-pain cream)\n- Antiseptic cream\n- Deep conditioner \n- Lipstick, mascara, eyeshadow, foundation \n\n——\nMEDICAL KIT:\n- Ibuprofen\n- Immodium\n- Anti-acid tablets \n- Ricola lozenges \n- Bite away\n- Band-aids\n\n——\nELECTRONICS:\n- 2x iPhones \n- Laptop &amp; charger \n- iPad &amp; charger \n- Travel adaptor \n\n——\nMISCELLANEOUS:\n- 17l daypack\n- 2x water bottles \n- Electronic toothbrush w/ 2 heads\n- Mini travel towel \n- Sunglasses \n- Jewelry \n- Sleeping mask\n- 2x passports \n- 2x slim wallets \n\n——\nBAGS:\n- 40L Thule Chasm duffel\n- 40L Eagle Creek Tour Travel \n\nWe took the Thule duffel because we already had it. We originally bought it for a sailing trip and for that and other boat trips, it’s great: the bag is waterproof, and for such trips we’re not doing a lot of walking with the bag. With more walking, like on this trip, it is definitely annoying to carry it around: although there are backpack straps, since there is no hip belt, it’s uncomfortable to wear on the back. Because it’s a duffel though, there is no place “wasted” for back padding and this bag is just so, so roomy.\n\nThe Eagle Creek is a new purchase and very happy with it so far! Can highly recommend it. It is a clamshell, is very lightweight (compared to most other clamshell backpacks), has an integrated hip belt, side laptop pocket AND side water bottle pocket, anti theft features, and an integrated rain cover that can go over the front or the back. The only thing is it’s more like a 35L than the specified 40L.",
            "score": 28,
            "created": 1677407992,
            "replies": [
              {
                "author": "shim12",
                "body": "How are you planning to get wrinkles out of your suit? Will you have access to an iron or steamer?",
                "score": 10,
                "created": 1677433123
              },
              {
                "author": "birlin01",
                "body": "More like a 35L even when the Eagle Creek is expanded?",
                "score": 2,
                "created": 1677467233
              }
            ]
          },
          {
            "author": "doctorkat",
            "body": "I noticed anti mosquito cream and bite away, but no malaria tablets - you may want to check if you're going to a risk area",
            "score": 24,
            "created": 1677421670,
            "replies": [
              {
                "author": "birdinthesky12",
                "body": "Yes, good point! We checked &amp; won’t be: we will be in the “golden triangle” and in Goa. Most of India is thankfully malaria-free.",
                "score": 24,
                "created": 1677424016
              }
            ]
          },
          {
            "author": "mehtamorphosis",
            "body": "impressive! how do you pack the suit in your backpack?",
            "score": 13,
            "created": 1677425270,
            "replies": [
              {
                "author": "birdinthesky12",
                "body": "It’s packed in a suit garment bag, which protects it. The bag is at the bottom of the duffel: because the duffel doesn’t have a rigid structure, we could put the garment bag in and then curve it around the sides of the duffel. The other clothing &amp; shoes get stacked on top.",
                "score": 3,
                "created": 1677504947
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 13,
            "created": 1677421990,
            "replies": [
              {
                "author": "birdinthesky12",
                "body": "Thank you — we are very excited!",
                "score": 9,
                "created": 1677424041
              }
            ]
          },
          {
            "author": "stiina22",
            "body": "This is a very exciting trip! Have a great time at the wedding and celebrating Holi! The eagle Creek pack looks super sleek. Love it.",
            "score": 5,
            "created": 1677427552,
            "replies": [
              {
                "author": "birdinthesky12",
                "body": "Thank you! And the eagle creek pack is both sleek and comfortable so far. Really happy with the purchase.",
                "score": 2,
                "created": 1677505019
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/s6fzo0p1i4v81.jpg?width=1080&crop=smart&auto=webp&s=3a066ff0b0fe762abbf3d1132aeb3d501f728783",
      "thread": {
        "title": "Comparison of Eagle Creek Tour 40L and Osprey Farpoint 40L",
        "url": "https://www.reddit.com/r/onebag/comments/u9n2rz/comparison_of_eagle_creek_tour_40l_and_osprey/",
        "selftext": "",
        "author": "KidneyLand",
        "score": 80,
        "numComments": 37,
        "created": 1650656994,
        "comments": [
          {
            "author": "KidneyLand",
            "body": "I'm getting ready for a couple overseas and domestic trips in the next few months. I've been looking for a suitable bag to meet my needs, which lead me to the selection of either the Eagle Creek Tour 40L or the popular Osprey Farpoint 40L. Both fit within my criteria of quality bags at the same exact price point with lifetime warranties, along with various other desirable traits.\n\nFor this comparison, I will mostly be adding pictures of the Eagle Creek as it is a newer bag with not a lot of information out there. Hopefully it can help people make up their decisions.\n\n**Internal Structure:**\n\nBoth Eagle Creek and Farpoint comes with a book (clam) style opening with easy access to the internals. Whereas the Farpoint 40L opens from top to bottom, and the EC opens up at from right to left. The Farpoint comes with a nice bright green high visibility interior, while the Eagle Creek is just black. Although on the EC it varies depending on the color you choose.\n\n[Comparison side by side](https://imgur.com/hYmY1NQ)\n\nIn terms of internal organization, both are very similar in terms of sizing. Both also come with internal clips. Here is a image where I quickly stuff the bag with a fully loaded EC Medium and Small packing cube, Marmot Precip, and 7 pairs of socks. Also in the internal pocket is an REI Co-op Flash 18L with my bladder, and 1 quart bag with toiletries.\n\n[Farpoint - Interior Loaded Up](https://imgur.com/3Gglzpm)\n\n[EC - Interior Loaded Up](https://imgur.com/SRbxE5P)\n\n**Size and Measurements:**\n\nBoth are rated at 40L, and I would say the measurement dimensions provided by both Farpoint and EC on their websites are correct. Although, in terms of capacity it seems the Farpoint can definitely hold more due to the outside pockets.\n\n[Picture of both bags side by side fully stuffed with clothes and towels](https://imgur.com/h4bb0VS)\n\nThe EC comes with a single side water bottle pouch, while the Farpoint comes with two back water bottle pouches. The EC bottle pouch seems to hold more. Here is an [image of the Farpoint](https://imgur.com/SiCa8lj) and [EC](https://imgur.com/wtWvdzQ) using my 18 oz Hydroflask. Not a fan of the Farpoint water bottle holders on the back, but not a dealbreaker.\n\nThe EC has the capability to expand to 43L according to the outside tag. I feel once you unzip the bag to provide the expanded capacity their sizes are more evenly matched.\n\n**Shoulder straps, hip belt, and sternum strap:**\n\nBoth come with a foam shoulder straps. The Farpoint shoulder straps are a bit wider, but the edgeless design on the EC make carrying the bag much more comfortable, at least for me. Also the EC has a more pronounced S curve as compared to the Farpoint which adds to the overall comfortable.\n\nBoth bags come with a sternum strap with a built in whistle. Although the EC is a stretchy material versus the Farpoint non-stretchy.\n\n[Side by side view](https://imgur.com/RREsfSN)\n\nThe Farpoint's hip belt is much better and provides more surface and cushion to wrap around your body. The straps are also wider than the 1 inch straps of the EC. The EC hip strap is pretty thin in comparison, but is also stowable which the Farpoint is not.\n\n[Image side by side](https://imgur.com/W8Nu6YB)\n\n[Hipbelt side by side](https://imgur.com/IP4zISJ)\n\nI also like to mention both bags have the ability to stow away the straps. The Farpoint has a wrap which can cover the shoulder and hip straps. The EC also has a type of strap and waist belt [cover](https://imgur.com/NVhO47V), but it also doubles as a [rain cover](https://imgur.com/lyNHOiR)! The EC also has an adjustable yoke that is secured to the back padded area using velcro.\n\n**External Features:**\n\nBoth the EC and Farpoint come with a top handle and side handle. [The Farpoint](https://imgur.com/SD0gIIX) handles are larger and have more cushion, but the [EC](https://imgur.com/mL4QUm1) is adequate in terms of sizing.\n\n[Side Handles](https://imgur.com/mhlGFf7)\n\nFarpoint has a one large external pocket with a laptop organizer which sits in the back, so it sits to the outside of the bag. Apparently a lot of people hate this feature, but I don't plan on carrying a laptop.\n\nEC has two minimalist pockets on the [outside](https://imgur.com/s0ZR9T0) with no organization. The bottom pocket does have a key leash. EC bag is the traditional laptop organization near the back of the bag with a side opening zipper. \n\nSpeaking of the [zippers](https://imgur.com/5dr1CF3), the Farpoint uses a larger YKK zipper and EC uses their own brand of zippers. I don't know why, but I expected the Farpoint zippers to be much smoother. It was quite the opposite, I found the EC to be smoother and easier to open. Opening the Farpoint was a bit of a pain, as the rain cover would often add resistance to the pulling of the zippers.\n\n**Comfort**\n\nYMMV! Everyone's body is ***DIFFERENT***. I got the M/L torso size for both bags as their respective sizing seem to match my body type. For this I thought the Farpoint would have been the clear winner here, but surprisingly I found the Eagle Creek to be much more comfortable even with the puny waist strap. Both bags seem to sit on my hip shelf well, but the [back lower padding](https://imgur.com/vJOMX5N) of the EC adds a lot of comfortable to my lower back. I feel the Farpoint adds more strain on my lower back over longer periods of time. I tested this by wearing the bag for about an hour or so.\n\n**Conclusion**\nAnyway, I hope this helps anyone out consider either of these two bags.  I'm about to put in my Amazon return, as I've tested these bags for a month now. In you are wondering, I am picking the Eagle Creek Tour 40L. But that is just my preference in terms of comfortable, organization, and aesthetic. Both bags are not perfect, but I feel more comfortable with the Eagle Creek. If I could just combine the high visibility interior and waist belt of the Farpoint with the Eagle Creek, it would have been near perfect.",
            "score": 38,
            "created": 1650657001,
            "replies": [
              {
                "author": "San_Marino",
                "body": "Thanks for the post. This is great info. I'm in a similar boat as you and have been considering picking up the farpoint (because it's a fan favorite), but now I'm interested in trying out the eagle creek. Can you share a link where you picked this up?",
                "score": 7,
                "created": 1650980385
              },
              {
                "author": "FatFingerHelperBot",
                "body": "It seems that your comment contains 1 or more links that are hard to tap for mobile users. \nI will extend those so they're easier for our sausage fingers to click!\n\n\n[Here is link number 1 - Previous text \"EC\"](https://imgur.com/wtWvdzQ)\n\n[Here is link number 2 - Previous text \"EC\"](https://imgur.com/mL4QUm1)\n\n\n\n----\n^Please ^PM ^[\\/u\\/eganwall](http://reddit.com/user/eganwall) ^with ^issues ^or ^feedback! ^| ^[Code](https://github.com/eganwall/FatFingerHelperBot) ^| ^[Delete](https://reddit.com/message/compose/?to=FatFingerHelperBot&amp;subject=delete&amp;message=delete%20i5sh1hz)",
                "score": 3,
                "created": 1650657014
              }
            ]
          },
          {
            "author": "jadeforrester",
            "body": "thanks for the great review! I ended up getting the eagle creek one too :)",
            "score": 10,
            "created": 1650984121,
            "replies": [
              {
                "author": "[deleted]",
                "body": "Please share your thoughts when you get it, because I am ambivalent which one to choose from these two..",
                "score": 10,
                "created": 1651301992
              },
              {
                "author": "keepitpono",
                "body": "Hi! I would love to hear your thoughts on what you thought about the bag!!",
                "score": 3,
                "created": 1705603068
              }
            ]
          },
          {
            "author": "CryptographerNo7137",
            "body": "I am very glad I stumbled onto this thread. I am stuck at these two as well. How is lockability? Can you lock all zippered areas on both bags?",
            "score": 3,
            "created": 1664217652,
            "replies": [
              {
                "author": "KidneyLand",
                "body": "Both offer lockable zippers for the main compartment. Both don't offer lockable zippers for the outside pockets though.",
                "score": 3,
                "created": 1664222294
              }
            ]
          },
          {
            "author": "athumans",
            "body": "Hi, can anyone comment on the size of the Tour Travel external pockets. From what I see one is a passport size and another could handle a small paperback book or something. I travel with kids and need to keep some things at hand so I need to consider extra pockets. The EC has most of the features I want but may be a bit too minimal.",
            "score": 2,
            "created": 1654799873,
            "replies": [
              {
                "author": "KidneyLand",
                "body": "I would say your assessment is about right. There are two exterior pockets. I can fit my passport wallet into the top portion with additional space for a couple small items. The one on the bottom is larger. I can fit a Kindle, and book or two in there. I could probably fit a external battery charger too. The bottom has a key leash too.\n\nI made some measurements with my tape to the best of my ability:\n\nTop pocket: 4.5\" x 7\"\nBottom pocket: 11\" x 7\"",
                "score": 6,
                "created": 1654825314
              }
            ]
          },
          {
            "author": "scotttttie",
            "body": "Are the backpack straps storable on the EC or just the waist straps?",
            "score": 2,
            "created": 1663939601,
            "replies": [
              {
                "author": "KidneyLand",
                "body": "Yes. The raincover acts as a way to stow the shoulder straps",
                "score": 4,
                "created": 1663967320
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/658r849hv6sd1.jpeg?width=1080&crop=smart&auto=webp&s=3a219d501085025c55b806eef8342eb165ccffdc",
      "thread": {
        "title": "Eagle creek tour 40L under seat",
        "url": "https://www.reddit.com/r/onebag/comments/1ftvfuh/eagle_creek_tour_40l_under_seat/",
        "selftext": "Fits pretty well under the seat on American Airlines. Just a little long but not too bad. ",
        "author": "Mountain_Nose6487",
        "score": 171,
        "numComments": 46,
        "created": 1727807741,
        "comments": [
          {
            "author": "Mountain_Nose6487",
            "body": "2 months packed for Europe. I wanted to see if it would fit under the seat on American Airlines in case they run out of overhead storage because I’m the last boarding group.",
            "score": 41,
            "created": 1727807821,
            "replies": [
              {
                "author": "Conscious_Wolf",
                "body": "Did you put it over head? There’s no leg room :(",
                "score": 9,
                "created": 1727831659
              }
            ]
          },
          {
            "author": "nutterz13",
            "body": "unrelated but those have to be the cleanest blunies I've ever seen.",
            "score": 25,
            "created": 1727837778,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "I just put some waterproofing stuff on them and it made them look very shiny and new!",
                "score": 11,
                "created": 1727875331
              }
            ]
          },
          {
            "author": "SeattleHikeBike",
            "body": "Interesting that it’s just 1/2” longer than the Mini MLC that so many want use as a personal item. (20.5 x 13 x 8.75 in. / 52 x 34 x 22.5 cm vs 20\" x 12\" x 7\"). \n\nNice bag and comes in two torso sizes. One of a very few carry on compliant bags that do come in sizes.",
            "score": 15,
            "created": 1727825633,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "Yeah, it fits way better than most backpacks! You can also adjust the torso length/harness on the backpack so it’s even more customizable",
                "score": 7,
                "created": 1727826491
              }
            ]
          },
          {
            "author": "Boo-Koo",
            "body": "Just FYI if you're traveling around Europe on budget airlines (wizzair, Ryanair, easyJet) you may have to pay extra as that won't fit in the smaller luggage compartments.",
            "score": 9,
            "created": 1727857662,
            "replies": [
              {
                "author": "Money-Literature-738",
                "body": "Yep! Also the I've found the underseats (on english budget airlines) to have varying widths... window has the widest and isle seat has the narrowest",
                "score": 4,
                "created": 1727873502
              },
              {
                "author": "Mountain_Nose6487",
                "body": "Yeah. I bought the bigger size carry on for Europe flights!",
                "score": 1,
                "created": 1727874156
              }
            ]
          },
          {
            "author": "Astrocat9",
            "body": "I got this bag for my first real international trip! It has a great balance of useful features for the money. Really can't go wrong with it.\n\nHad a long layover in Seattle and was able to check it all the way to London using the built in strap hiding system. It even has a built-in rain fly! Organization is minimal so packing cubes are a nice addition (I really like the old Spectre cubes from Eagle Creek).\n\nMy friend who brought a huge checked size rolling suitcase struggled walking up/down stairs in old towns and transit stations- hoping to convert them 😁",
            "score": 8,
            "created": 1727834362,
            "replies": [
              {
                "author": "Mountain_Nose6487",
                "body": "It Is a great bag! It feels a lot more low key than my other 40 liter bag, the REI trail. Both are great but this blends in a little more as a normal backpack and not a big “backpacking” bag",
                "score": 2,
                "created": 1727875663
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://external-preview.redd.it/fvrhLaCXjJ2wvFRquwZ0kb_Pc7ytQ-0SkbLLWaXb1X0.jpg?width=320&crop=smart&auto=webp&s=81aa61b24d02bc2be7879fa3429c4c2d098ff659",
      "thread": {
        "title": "New Eagle Creek Tour 40L backpack/duffel",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1hxudut/new_eagle_creek_tour_40l_backpackduffel/",
        "selftext": "",
        "author": "[deleted]",
        "score": 4,
        "numComments": 3,
        "created": 1736476835,
        "comments": [
          {
            "author": "Accomplished-Fig745",
            "body": "I don't think it's an improvement over the previous version. The new exterior opening seems complicated compared to just opening a zipper. And it looks like it lost the ability to expand and also compress. I'm sure someone will like it but it doesn't look like a net positive to me.",
            "score": 1,
            "created": 1736573269,
            "replies": [
              {
                "author": "[deleted]",
                "body": "I agree, I like quite a few of EC's products, but this is a bit...meh.",
                "score": 1,
                "created": 1736573456
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "And surprising noone - there is also a 55L version that looks just as awful: https://www.rei.com/product/245595/eagle-creek-tour-travel-pack-55-l",
            "score": 1,
            "created": 1737094538,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/fu6j8yxpf4je1.png?width=960&crop=smart&auto=webp&s=a44faae619a2d07da76ee43231130e9b55f431c7",
      "thread": {
        "title": "Anyone have experience with this bag?",
        "url": "https://www.reddit.com/r/backpacks/comments/1ipcsh2/anyone_have_experience_with_this_bag/",
        "selftext": "It's a new release from Eagle Creek and it seems to tick every box but I can't find any reviews on it",
        "author": "JFFIASCO",
        "score": 3,
        "numComments": 5,
        "created": 1739546118,
        "comments": [
          {
            "author": "[deleted]",
            "body": "[removed]",
            "score": 2,
            "created": 1739570187,
            "replies": [
              {
                "author": "JFFIASCO",
                "body": "Thank you!",
                "score": 1,
                "created": 1739575210
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "It's only just been released, suspect not many people have even had a chance to use it, let alone review it.",
            "score": 2,
            "created": 1739579319,
            "replies": [
              {
                "author": "JFFIASCO",
                "body": "Yeah that's what I was thinking. Wonder if I should wait for the YouTube reviewers",
                "score": 2,
                "created": 1739580013
              }
            ]
          },
          {
            "author": "allaspiaggia",
            "body": "I really like Eagle Creek products.  They’re a bit old school, a lot of their designs are borderline archaic, but in a generally good way.  Nice quality, price is reasonable, and very well thought out design.  I don’t know this backpack specifically, but the company makes solid products and if you like this style then I’d say go for it.",
            "score": 2,
            "created": 1739590044,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/kk2xg6c6i2371.jpg?width=1080&crop=smart&auto=webp&s=6f20f9876da381c3ca01f5b342f97b8f829da70d",
      "thread": {
        "title": "Visiting this subreddit a year before my next trip got me a little over eager",
        "url": "https://www.reddit.com/r/onebag/comments/nrfxvi/visiting_this_subreddit_a_year_before_my_next/",
        "selftext": "",
        "author": "[deleted]",
        "score": 409,
        "numComments": 43,
        "created": 1622733454,
        "comments": [
          {
            "author": "[deleted]",
            "body": "Never one bagged before and planning a trip to Amsterdam/Berlin/Reykjavik for ~11 days next spring (assuming that's possible)",
            "score": 45,
            "created": 1622745052,
            "replies": [
              {
                "author": "MrDenly",
                "body": "Iceland can be very cold/wet/windy even late spring, make sure you layer up.  That is a nice looking bag at a good price, my osprey 55L is getting too big for my like maybe I will pick this up as replacement.",
                "score": 3,
                "created": 1622815532
              }
            ]
          },
          {
            "author": "woolgatheringeyes",
            "body": "Was at one point interested in it, but didn't pull the trigger due to a lack of reviews. Let me know how this works. Care to write up a small first impression/review of it?",
            "score": 28,
            "created": 1622748305,
            "replies": [
              {
                "author": "[deleted]",
                "body": "I almost didn't pull the trigger either for the same reason but the sale was too tempting. I'll try and remember to post some updates after I get a chance to use it.\n\nI packed it initially yesterday with the following\n\nMain clamshell (medium and small packing cube)\n- 6x socks\n- 6x underwear\n- 2 pairs of pants\n- 2 overshirts (bottom of bag under cubes)\n\nIncluded mesh compartments\n- kindle Paperwhite \n- phone charger\n- Toothbrush\n- antiperspirant\n- Jabra over hear headphone hard case\n\nOuter zippered pocket\n- rains long rain jacket\n\nHidden pocket\n- wallet\n- cellphone\n\nInitial impressions\n- the bag was nearing capacity but I still had room in the main compartment for a few smaller items\n- no water bottle holder but included paracord strap that I could tie on to and lots of attachment points if I wanted to go that route\n- hip straps stowed to the point of not being able to see them at all if you didn't know they were there but not sure about comfort long term without using them but seemed comfortable initially\n- I didn't use the laptop sleeve in that seperate compartment so also could be room in that pouch as well but I wouldn't use it for much as it would be pressed directly against the back padding",
                "score": 31,
                "created": 1622751371
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "My Eagle Creek Utility 40L arrived yesterday and I am stoked to use for my next trip!",
            "score": 13,
            "created": 1622735849,
            "replies": [
              {
                "author": "fleamarketguy",
                "body": "Do you have a link of where you got it? I can't find it.",
                "score": 4,
                "created": 1622749559
              }
            ]
          },
          {
            "author": "PopularZero",
            "body": "Oh hey, I have this bag in black!\n\nI was so disappointed that I couldn't adjust it to fit my frame... My torso is too long to wear it comfortably while hiking. It works extremely well as a travel bag/carry on though. Be prepared for people to ask if you work for National Geographic lol.",
            "score": 13,
            "created": 1622767281,
            "replies": [
              {
                "author": "[deleted]",
                "body": "The black one looks rad. Yeah I feel like you would probably want load lifters for this one if your torso doesn't fit it super well but for travel and walking around cities it will probably alright with less jostling (I hope)",
                "score": 4,
                "created": 1622768523
              },
              {
                "author": "dimensiation",
                "body": "How tall are you? I'm looking at this as an EDC/commute bag, plus when I'm doing wet outdoorsy stuff or the occasional travel.\n\nEdit: realized this is the 40L and I'm looking at the 25. Hmmm.",
                "score": 2,
                "created": 1622828454
              }
            ]
          },
          {
            "author": "foggyotter",
            "body": "I have this bag in black and I honestly really like it. Have used it as a carry on. I find the hip belt sufficient for reducing the load on the shoulders, I have issues with chronic pain and cannot carry a lot on one shoulder. I got it from REI outlet over a year ago for around $85, though I don't think this deal is available anymore, perhaps keep your eye out for it.\n\nI noticed someone complained about it not working with them because they're too tall. I'm 5'3/4 ish and have a shorter torso. If you're shorter this bag might work for you. \n\nSome of my favorite things are the following: \n\n- laptop sleeve is really good for protecting devices and has a false bottom. It also seems it could fit that 16 inch MacBook Pro, as my 13 inch had lots of breathing room in there. \n- there are two small loops near the top handle and I put my Chico bag on one of them (compressible reusable shopping bags). \n- I really like the side buckles as a security from pick pocketing feature. If you keep the zippers above the top two you can easily access items in the smaller top mesh pouch inside the bag and items in the top of the back without undoing tons of stuff. \n- the outside is insanely easy to clean, just wipe with a wet cloth and it's good to go. \n\nIf you have any questions about it feel free to ask btw :)",
            "score": 8,
            "created": 1622782488,
            "replies": [
              {
                "author": "nickname2469",
                "body": "Looking at the layout of this bag it seems like a more affordable alternative to the 30L Heimplanet Transit Line that I bought earlier this year. I’m interested to see if this works out, I may start recommending it to friends",
                "score": 2,
                "created": 1622791509
              },
              {
                "author": "[deleted]",
                "body": "Great tip on the zippers above the compression straps!",
                "score": 1,
                "created": 1622801267
              }
            ]
          }
        ]
      }
    }
  ]
}