{
  "name": "Eagle Creek Global Companion 40L",
  "imageThreads": [
    {
      "image": "https://preview.redd.it/x0hgr52vs3la1.jpg?width=3024&format=pjpg&auto=webp&s=feb33e760d03dbde4af99ce53112efe96ca65dce",
      "thread": {
        "title": "Decathlon Forclaz 40L - “Backpack Travel 500 Organiser” RPP £59.99. Initial thoughts and similarities to Allpa 42L",
        "url": "https://www.reddit.com/r/onebag/comments/11f08c2/decathlon_forclaz_40l_backpack_travel_500/?tl=fr",
        "selftext": "I’m planning on a RTW trip (from London to SE Asia / Australia by land and sea) next year, and am using a 3 week trip to Cuba in April as my practice run for Onebagging. \n\nI‘ve had my eye on the Cotopaxi Allpa 42L for a while but has been out of stock in the UK since I began searching. Yesterday it came back into stock and I pulled the trigger. However I had also coincidentally yesterday stumbled across this Decathlon Forclaz bag, at a much cheaper price (£220 vs £59.99). I’m not an expert on these types of bags, but to me it felt like the Forclaz was aiming for a lot of things that the Allpa had (see link below). \n\nhttps://www.decathlon.co.uk/p/backpack-travel-500-organizer-40-l/_/R-p-338564?mc=8787845\n\nThey both have a clamshell opening, a small pocket at the top, a separate laptop compartment, a water bottle holder (the Forclaz holder also unzips to expand, and has a stretchy pocket on the other side too), the same 3 internal compartments and safety zippers. Some might say the Forclaz took a lot of inspiration from the Allpa…\n\nAnyway, I live very close to a large Decathlon and went to pick up the Forclaz yesterday. I’m yet to pack it properly but on first inspection it does look very promising for the price. \n\nThe Allpa should be arriving this week and I’ll be comparing the two - I imagine the Allpa will feel slightly better, but whether it is £160 better is another question! Updates to come…\n\nPictures attached.",
        "author": "jayg2468",
        "score": 235,
        "numComments": 106,
        "created": 1677666031,
        "comments": [
          {
            "author": "usernameunavaliable",
            "body": "I really like Decathlon. They are affordable and their products are usually really good quality. Keep in mind that this sub usually gravitates towards super specialized (and more expensive) gear.    \n\n\nI travel a lot for work, and i have also backpacked a fair amount. I always use Decathlon´s stuff and I never felt like the quality was lacking.",
            "score": 155,
            "created": 1677682176,
            "replies": [
              {
                "author": "PhoenixRisingtw",
                "body": "Decathlon is the best value out there. Granted, you won't get as much street cred as with something like  Arc'teryx, but the price-performance ratio is really sweet.",
                "score": 43,
                "created": 1677690218
              },
              {
                "author": "jayg2468",
                "body": "I agree - I bought a Decathlon ski rucksack last year and I love it so much I’ve ended up using it for day to day activities. Great value and great quality.",
                "score": 11,
                "created": 1677706196
              }
            ]
          },
          {
            "author": "jayg2468",
            "body": "Allpa 42L vs Forclaz 40L side by side comparison:\n\n1. Size:\n\nAllpa: My first thought when opening the Allpa was that it looks a lot longer and wider than the Forclaz when basically the same weight.\n\nForclaz: It seems to be deeper which is where it gets the room \n\n2. Main packing pocket:\n\nSimilar set up. Again the Allpa pocket is a bit bigger, although the Forclaz seems a bit deeper. The Allpa also has has a very small side pocket within this pocket for valuables. The Allpa also has a long zip that means you can directly access this pocket from the outside if you need, although not entirely sure why you would need that regularly. The Forclaz does not have either feature.\n\nVerdict: ALLPA\n\n3. Packing pocket #2:\n\nBoth have a pocket about half the size of the main pocket on the other side, and both have an extra zip pocket on the front of the mesh for small items. The Forclaz pocket definitely feels deeper and I guess this is where it regains some ground on the length of the Allpa. \n\nVerdict: FORCLAZ\n\n4. Packing pocket #3:\n\nThe Allpa pocket is very shallow - probably only able to store documents here.\n\nThe Forclaz pocket on the other hand is as deep as pocket #2, making it the perfect toiletries pocket. I’m a bit surprised at the almost pointlessness of the Allpa pocket #3.\n\nVerdict: FORCLAZ\n\n5. Internal zippers:\n\nThe Allpa definitely has better feeling zips - neither of them are as good quality as the outer zips obviously. Allpa is YKK and Forclaz is SBS.\n\nVerdict: ALLPA\n\n6. Overall internal appearance:\n\nThe Allpa does look more expensive than the Forclaz unsurprisingly and feels a bit more premium. \n\nVerdict: ALLPA\n\n7. External appearance:\n\nObviously the Cotopaxi is undeniably stylish, and I do like the colour way (Cavern). That said, I really like the orangey colour of the Forclaz and it does look a bit more traveller whereas the Cotopaxi maybe shouts tourist a bit more? Small margins though. I like the material of both and both come with a raincover.\n\nVerdict: DRAW\n\n8. External pockets:\n\nThe Allpa has a water bottle holder, but it does feel quite tight, and I’m not sure how much do space there would be when the bag is completely full.\n\nThe Forclaz has two external pockets - a water bottle pocket that can be unzipped to expand the pocket (using an elastic layer fabric to keep it in place), which is great. It also cuffed pocket on the other side made out of that same material  which would be useful for all sorts of stuff.\n\nVerdict: FORCLAZ\n\n9. External zippers:\n\nI really like both external zippers - both are heavy duty. I feel like the Forclaz is a bit easier to open and close but it might be that the Allpa YKK zippers just need warming up a bit?\n\nThe zipper for the main pockets on the Allpa has a security loop which I’m finding quite fiddly to get fully shut. The Forclaz doesn’t have this loop but actually has a hole for a padlock to go through both zippers when together which is a neat feature \n\nVerdict: FORCLAZ\n\n10. Top pocket: \n\nThe Allpa has a really great top pocket. It feels really big and it’s easy to access (also has a less fiddly security loop). It’s also located on the far side of the bag. In the pocket, there are 3 cuffed slip in pockets, the main area, and then there is a zipped mesh pocket (which has two slip in pockets within that). A lot of space in here, and makes up for the internal pocket #3 being much smaller (it’s in the same space)\n\nThe Forclaz top pocket is on the back side of the bag, and is a lot smaller. It has a nice and easily workable security zipper. However, the Forclaz only has one general pocket with no extra compartments which is disappointing. Again it’s a trade off between this and pocket #3 inside. \n\nBoth have carabiners inside, but the allpa’s is more substantial.\n\nVerdict: ALLPA EASILY\n\n11. Laptop pocket:\n\nBoth have essentially the same size laptop pocket on the back side of the bag.\n\nForclaz: There is nothing extra to add here, it’s just a side pocket with no more features\n\nAllpa: The Allpa has two slip in pockets in this section - one large one with a Velcro strap, and a cuffed pocket (presumably for a charger). The pocket with the Velcro fits my iPad Air perfectly and it feels a lot more secure in there than in the Forclaz where it might be able to get knocked around a bit more due to the space it has.\n\nVerdict: ALLPA\n\n12. Extra pockets: \n\nThe Forclaz has an extra zipped pocket along the front of the bag which is well hidden, but looks like it could fit some handy extra things in there. The Allpa has no more pockets.\n\nVerdict: FORCLAZ\n\n13. Handles:\n\nAllpa: It has a detachable shoulder strap which looks nice and good quality - not sure how often it would be used though. It also has a side handle which seems fine\n\nForclaz: It has a handle at the top of the bag like a more traditional rucksack. No other handles\n\nVerdict: ALLPA, but minor win\n\n14. Straps: \n\nAllpa: Shoulder straps feel and look comfortable, same with chest straps. I don’t think the hip straps were as comfortable as they could be but it might just need some adjusting when the bag is full. The hip strap is also removable with Velcro which is a good feature \n\nForclaz: Shoulder straps feel and look comfortable. Hip strap feels much better quality as the padding comes much further of the  way round, whereas the Allpa padding ends a lot sooner. It is not removeable however isn’t great\n\nVerdict: DRAW (removable hip strap Vs comfortable strap, tricky to decide)\n\n15. Value:\n\nClearly the Forclaz wins here, £ for £ it is a better bag than the Allpa. £60 vs £220, and the Allpa is not over 3 times better! The question is though, is it still worth paying more…\n\n16. Overall verdict: I DON’T KNOW!! I was hoping when I had them side by side it would be clear which was the best option. The Forclaz feels better for the compartments internally, but the Allpa features like the top pocket and laptop pocket are real pluses. I’m going to need to fill them both up and have another think then.\n\nHopefully this was useful for people - I’m not an expert in this area at all so it’s quite an unrefined review and there’s probably things I missed too!",
            "score": 45,
            "created": 1677855421,
            "replies": [
              {
                "author": "jayg2468",
                "body": "ADDITION: I’ve just packed the Forclaz to 90% of capacity and must say I’m surprised with how much I could get in there. It also has compression straps on the side of the bag that I hadn’t fully appreciated before. I’m leaning towards the Forclaz",
                "score": 23,
                "created": 1677861352
              },
              {
                "author": "Radiologer",
                "body": "There are no Allpas anywhere near me except the 28L but I can get the Forclaz when I go overseas and buy it on arrival.\n\n&amp;#x200B;\n\nI mainly want to stow my stuff in the seat infront of me so was tossing up the Allpa 35 L vs the Forclaz. Do you think the Forclaz can fit under a seat? Thanks for your write-up!",
                "score": 3,
                "created": 1677858637
              }
            ]
          },
          {
            "author": "blanchinator",
            "body": "I've just packed this for 1-2 months in Italy and Morocco. Will report back but so far it's an excellent onebag. Well thought out organisation, and that massive side pocket is great for stashing all sort of things.\n\nMy only question at the moment is what the loops on the shoulder straps are for? And why they only put a pocket on one side of the waist belt.",
            "score": 28,
            "created": 1677687877,
            "replies": [
              {
                "author": "tealheart",
                "body": "I think they might be thumb loops / hand loops? Some hiking packs occasionally have them as an alternative to tucking your hands under the straps to take the weight off. I think anyway! :)",
                "score": 4,
                "created": 1677706348
              },
              {
                "author": "mrjaytothecee",
                "body": "Hey, how was it? How comfy are the straps? Just tried it on in store and the straps didn't  feel great. Also the zippers felt low build quality. Any issues there?",
                "score": 4,
                "created": 1695724954
              }
            ]
          },
          {
            "author": "Bigardo",
            "body": "I saw it the other day at Decathlon and one issue with this bag is that the laptop compartment is not suspended.\n\nEverything else seems solid, especially at that price.",
            "score": 27,
            "created": 1677674806,
            "replies": [
              {
                "author": "Broutythecat",
                "body": "What does suspended mean in this context?",
                "score": 15,
                "created": 1677677969
              },
              {
                "author": "tealheart",
                "body": "So, still testing with different load shapes, but so far the placement of the lower compression strap seems to create a bit of a shelf/narrow point that my laptop (~13 inch) sits above. Even after a short jog, it still prevented the laptop sliding completely to the bottom. I might still add a foam strip for peace of mind and might not work with a larger laptop, but interesting design if this keeps up!",
                "score": 6,
                "created": 1677750954
              }
            ]
          },
          {
            "author": "facciabrutta",
            "body": "Omg I’m so happy to see this! I’m non-western and I can’t get my hands on the bags mentioned in this subreddit unless someone sends it to me from abroad. But we have Decathlon here and it’s very popular. I’ve been emailing them asking for a cabin-size travel backpack, they never responded lol but they’re finally moving in the right direction. I couldn’t tell from the pictures, where’s the laptop compartment? I really hope it’s against the back of the bag and protected. Otherwise the bag wouldn’t be any different than their hiking bags - useless for digital nomads.",
            "score": 24,
            "created": 1677699629,
            "replies": [
              {
                "author": "jayg2468",
                "body": "Can confirm it’s on the back - whether it’s protected or not is a different question as someone above has noted it’s not a suspended pocket (must admit I wasn’t aware of that as an issue). I’ll inspect it a bit more and get back to you",
                "score": 10,
                "created": 1677706401
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/x2hv242vs3la1.jpg?width=4032&format=pjpg&auto=webp&s=78ea7cf53cab452592b69e63bf920c9ead01ca6e",
      "thread": {
        "title": "Decathlon Forclaz 40L - “Backpack Travel 500 Organiser” RPP £59.99. Initial thoughts and similarities to Allpa 42L",
        "url": "https://www.reddit.com/r/onebag/comments/11f08c2/decathlon_forclaz_40l_backpack_travel_500/?tl=fr",
        "selftext": "I’m planning on a RTW trip (from London to SE Asia / Australia by land and sea) next year, and am using a 3 week trip to Cuba in April as my practice run for Onebagging. \n\nI‘ve had my eye on the Cotopaxi Allpa 42L for a while but has been out of stock in the UK since I began searching. Yesterday it came back into stock and I pulled the trigger. However I had also coincidentally yesterday stumbled across this Decathlon Forclaz bag, at a much cheaper price (£220 vs £59.99). I’m not an expert on these types of bags, but to me it felt like the Forclaz was aiming for a lot of things that the Allpa had (see link below). \n\nhttps://www.decathlon.co.uk/p/backpack-travel-500-organizer-40-l/_/R-p-338564?mc=8787845\n\nThey both have a clamshell opening, a small pocket at the top, a separate laptop compartment, a water bottle holder (the Forclaz holder also unzips to expand, and has a stretchy pocket on the other side too), the same 3 internal compartments and safety zippers. Some might say the Forclaz took a lot of inspiration from the Allpa…\n\nAnyway, I live very close to a large Decathlon and went to pick up the Forclaz yesterday. I’m yet to pack it properly but on first inspection it does look very promising for the price. \n\nThe Allpa should be arriving this week and I’ll be comparing the two - I imagine the Allpa will feel slightly better, but whether it is £160 better is another question! Updates to come…\n\nPictures attached.",
        "author": "jayg2468",
        "score": 235,
        "numComments": 106,
        "created": 1677666031,
        "comments": [
          {
            "author": "usernameunavaliable",
            "body": "I really like Decathlon. They are affordable and their products are usually really good quality. Keep in mind that this sub usually gravitates towards super specialized (and more expensive) gear.    \n\n\nI travel a lot for work, and i have also backpacked a fair amount. I always use Decathlon´s stuff and I never felt like the quality was lacking.",
            "score": 155,
            "created": 1677682176,
            "replies": [
              {
                "author": "PhoenixRisingtw",
                "body": "Decathlon is the best value out there. Granted, you won't get as much street cred as with something like  Arc'teryx, but the price-performance ratio is really sweet.",
                "score": 43,
                "created": 1677690218
              },
              {
                "author": "jayg2468",
                "body": "I agree - I bought a Decathlon ski rucksack last year and I love it so much I’ve ended up using it for day to day activities. Great value and great quality.",
                "score": 11,
                "created": 1677706196
              }
            ]
          },
          {
            "author": "jayg2468",
            "body": "Allpa 42L vs Forclaz 40L side by side comparison:\n\n1. Size:\n\nAllpa: My first thought when opening the Allpa was that it looks a lot longer and wider than the Forclaz when basically the same weight.\n\nForclaz: It seems to be deeper which is where it gets the room \n\n2. Main packing pocket:\n\nSimilar set up. Again the Allpa pocket is a bit bigger, although the Forclaz seems a bit deeper. The Allpa also has has a very small side pocket within this pocket for valuables. The Allpa also has a long zip that means you can directly access this pocket from the outside if you need, although not entirely sure why you would need that regularly. The Forclaz does not have either feature.\n\nVerdict: ALLPA\n\n3. Packing pocket #2:\n\nBoth have a pocket about half the size of the main pocket on the other side, and both have an extra zip pocket on the front of the mesh for small items. The Forclaz pocket definitely feels deeper and I guess this is where it regains some ground on the length of the Allpa. \n\nVerdict: FORCLAZ\n\n4. Packing pocket #3:\n\nThe Allpa pocket is very shallow - probably only able to store documents here.\n\nThe Forclaz pocket on the other hand is as deep as pocket #2, making it the perfect toiletries pocket. I’m a bit surprised at the almost pointlessness of the Allpa pocket #3.\n\nVerdict: FORCLAZ\n\n5. Internal zippers:\n\nThe Allpa definitely has better feeling zips - neither of them are as good quality as the outer zips obviously. Allpa is YKK and Forclaz is SBS.\n\nVerdict: ALLPA\n\n6. Overall internal appearance:\n\nThe Allpa does look more expensive than the Forclaz unsurprisingly and feels a bit more premium. \n\nVerdict: ALLPA\n\n7. External appearance:\n\nObviously the Cotopaxi is undeniably stylish, and I do like the colour way (Cavern). That said, I really like the orangey colour of the Forclaz and it does look a bit more traveller whereas the Cotopaxi maybe shouts tourist a bit more? Small margins though. I like the material of both and both come with a raincover.\n\nVerdict: DRAW\n\n8. External pockets:\n\nThe Allpa has a water bottle holder, but it does feel quite tight, and I’m not sure how much do space there would be when the bag is completely full.\n\nThe Forclaz has two external pockets - a water bottle pocket that can be unzipped to expand the pocket (using an elastic layer fabric to keep it in place), which is great. It also cuffed pocket on the other side made out of that same material  which would be useful for all sorts of stuff.\n\nVerdict: FORCLAZ\n\n9. External zippers:\n\nI really like both external zippers - both are heavy duty. I feel like the Forclaz is a bit easier to open and close but it might be that the Allpa YKK zippers just need warming up a bit?\n\nThe zipper for the main pockets on the Allpa has a security loop which I’m finding quite fiddly to get fully shut. The Forclaz doesn’t have this loop but actually has a hole for a padlock to go through both zippers when together which is a neat feature \n\nVerdict: FORCLAZ\n\n10. Top pocket: \n\nThe Allpa has a really great top pocket. It feels really big and it’s easy to access (also has a less fiddly security loop). It’s also located on the far side of the bag. In the pocket, there are 3 cuffed slip in pockets, the main area, and then there is a zipped mesh pocket (which has two slip in pockets within that). A lot of space in here, and makes up for the internal pocket #3 being much smaller (it’s in the same space)\n\nThe Forclaz top pocket is on the back side of the bag, and is a lot smaller. It has a nice and easily workable security zipper. However, the Forclaz only has one general pocket with no extra compartments which is disappointing. Again it’s a trade off between this and pocket #3 inside. \n\nBoth have carabiners inside, but the allpa’s is more substantial.\n\nVerdict: ALLPA EASILY\n\n11. Laptop pocket:\n\nBoth have essentially the same size laptop pocket on the back side of the bag.\n\nForclaz: There is nothing extra to add here, it’s just a side pocket with no more features\n\nAllpa: The Allpa has two slip in pockets in this section - one large one with a Velcro strap, and a cuffed pocket (presumably for a charger). The pocket with the Velcro fits my iPad Air perfectly and it feels a lot more secure in there than in the Forclaz where it might be able to get knocked around a bit more due to the space it has.\n\nVerdict: ALLPA\n\n12. Extra pockets: \n\nThe Forclaz has an extra zipped pocket along the front of the bag which is well hidden, but looks like it could fit some handy extra things in there. The Allpa has no more pockets.\n\nVerdict: FORCLAZ\n\n13. Handles:\n\nAllpa: It has a detachable shoulder strap which looks nice and good quality - not sure how often it would be used though. It also has a side handle which seems fine\n\nForclaz: It has a handle at the top of the bag like a more traditional rucksack. No other handles\n\nVerdict: ALLPA, but minor win\n\n14. Straps: \n\nAllpa: Shoulder straps feel and look comfortable, same with chest straps. I don’t think the hip straps were as comfortable as they could be but it might just need some adjusting when the bag is full. The hip strap is also removable with Velcro which is a good feature \n\nForclaz: Shoulder straps feel and look comfortable. Hip strap feels much better quality as the padding comes much further of the  way round, whereas the Allpa padding ends a lot sooner. It is not removeable however isn’t great\n\nVerdict: DRAW (removable hip strap Vs comfortable strap, tricky to decide)\n\n15. Value:\n\nClearly the Forclaz wins here, £ for £ it is a better bag than the Allpa. £60 vs £220, and the Allpa is not over 3 times better! The question is though, is it still worth paying more…\n\n16. Overall verdict: I DON’T KNOW!! I was hoping when I had them side by side it would be clear which was the best option. The Forclaz feels better for the compartments internally, but the Allpa features like the top pocket and laptop pocket are real pluses. I’m going to need to fill them both up and have another think then.\n\nHopefully this was useful for people - I’m not an expert in this area at all so it’s quite an unrefined review and there’s probably things I missed too!",
            "score": 45,
            "created": 1677855421,
            "replies": [
              {
                "author": "jayg2468",
                "body": "ADDITION: I’ve just packed the Forclaz to 90% of capacity and must say I’m surprised with how much I could get in there. It also has compression straps on the side of the bag that I hadn’t fully appreciated before. I’m leaning towards the Forclaz",
                "score": 23,
                "created": 1677861352
              },
              {
                "author": "Radiologer",
                "body": "There are no Allpas anywhere near me except the 28L but I can get the Forclaz when I go overseas and buy it on arrival.\n\n&amp;#x200B;\n\nI mainly want to stow my stuff in the seat infront of me so was tossing up the Allpa 35 L vs the Forclaz. Do you think the Forclaz can fit under a seat? Thanks for your write-up!",
                "score": 3,
                "created": 1677858637
              }
            ]
          },
          {
            "author": "blanchinator",
            "body": "I've just packed this for 1-2 months in Italy and Morocco. Will report back but so far it's an excellent onebag. Well thought out organisation, and that massive side pocket is great for stashing all sort of things.\n\nMy only question at the moment is what the loops on the shoulder straps are for? And why they only put a pocket on one side of the waist belt.",
            "score": 28,
            "created": 1677687877,
            "replies": [
              {
                "author": "tealheart",
                "body": "I think they might be thumb loops / hand loops? Some hiking packs occasionally have them as an alternative to tucking your hands under the straps to take the weight off. I think anyway! :)",
                "score": 4,
                "created": 1677706348
              },
              {
                "author": "mrjaytothecee",
                "body": "Hey, how was it? How comfy are the straps? Just tried it on in store and the straps didn't  feel great. Also the zippers felt low build quality. Any issues there?",
                "score": 4,
                "created": 1695724954
              }
            ]
          },
          {
            "author": "Bigardo",
            "body": "I saw it the other day at Decathlon and one issue with this bag is that the laptop compartment is not suspended.\n\nEverything else seems solid, especially at that price.",
            "score": 27,
            "created": 1677674806,
            "replies": [
              {
                "author": "Broutythecat",
                "body": "What does suspended mean in this context?",
                "score": 15,
                "created": 1677677969
              },
              {
                "author": "tealheart",
                "body": "So, still testing with different load shapes, but so far the placement of the lower compression strap seems to create a bit of a shelf/narrow point that my laptop (~13 inch) sits above. Even after a short jog, it still prevented the laptop sliding completely to the bottom. I might still add a foam strip for peace of mind and might not work with a larger laptop, but interesting design if this keeps up!",
                "score": 6,
                "created": 1677750954
              }
            ]
          },
          {
            "author": "facciabrutta",
            "body": "Omg I’m so happy to see this! I’m non-western and I can’t get my hands on the bags mentioned in this subreddit unless someone sends it to me from abroad. But we have Decathlon here and it’s very popular. I’ve been emailing them asking for a cabin-size travel backpack, they never responded lol but they’re finally moving in the right direction. I couldn’t tell from the pictures, where’s the laptop compartment? I really hope it’s against the back of the bag and protected. Otherwise the bag wouldn’t be any different than their hiking bags - useless for digital nomads.",
            "score": 24,
            "created": 1677699629,
            "replies": [
              {
                "author": "jayg2468",
                "body": "Can confirm it’s on the back - whether it’s protected or not is a different question as someone above has noted it’s not a suspended pocket (must admit I wasn’t aware of that as an issue). I’ll inspect it a bit more and get back to you",
                "score": 10,
                "created": 1677706401
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/9n7t462vs3la1.jpg?width=3024&format=pjpg&auto=webp&s=f091fd7a883723da04a9b517de27018aee348df1",
      "thread": {
        "title": "Decathlon Forclaz 40L - “Backpack Travel 500 Organiser” RPP £59.99. Initial thoughts and similarities to Allpa 42L",
        "url": "https://www.reddit.com/r/onebag/comments/11f08c2/decathlon_forclaz_40l_backpack_travel_500/?tl=fr",
        "selftext": "I’m planning on a RTW trip (from London to SE Asia / Australia by land and sea) next year, and am using a 3 week trip to Cuba in April as my practice run for Onebagging. \n\nI‘ve had my eye on the Cotopaxi Allpa 42L for a while but has been out of stock in the UK since I began searching. Yesterday it came back into stock and I pulled the trigger. However I had also coincidentally yesterday stumbled across this Decathlon Forclaz bag, at a much cheaper price (£220 vs £59.99). I’m not an expert on these types of bags, but to me it felt like the Forclaz was aiming for a lot of things that the Allpa had (see link below). \n\nhttps://www.decathlon.co.uk/p/backpack-travel-500-organizer-40-l/_/R-p-338564?mc=8787845\n\nThey both have a clamshell opening, a small pocket at the top, a separate laptop compartment, a water bottle holder (the Forclaz holder also unzips to expand, and has a stretchy pocket on the other side too), the same 3 internal compartments and safety zippers. Some might say the Forclaz took a lot of inspiration from the Allpa…\n\nAnyway, I live very close to a large Decathlon and went to pick up the Forclaz yesterday. I’m yet to pack it properly but on first inspection it does look very promising for the price. \n\nThe Allpa should be arriving this week and I’ll be comparing the two - I imagine the Allpa will feel slightly better, but whether it is £160 better is another question! Updates to come…\n\nPictures attached.",
        "author": "jayg2468",
        "score": 235,
        "numComments": 106,
        "created": 1677666031,
        "comments": [
          {
            "author": "usernameunavaliable",
            "body": "I really like Decathlon. They are affordable and their products are usually really good quality. Keep in mind that this sub usually gravitates towards super specialized (and more expensive) gear.    \n\n\nI travel a lot for work, and i have also backpacked a fair amount. I always use Decathlon´s stuff and I never felt like the quality was lacking.",
            "score": 155,
            "created": 1677682176,
            "replies": [
              {
                "author": "PhoenixRisingtw",
                "body": "Decathlon is the best value out there. Granted, you won't get as much street cred as with something like  Arc'teryx, but the price-performance ratio is really sweet.",
                "score": 43,
                "created": 1677690218
              },
              {
                "author": "jayg2468",
                "body": "I agree - I bought a Decathlon ski rucksack last year and I love it so much I’ve ended up using it for day to day activities. Great value and great quality.",
                "score": 11,
                "created": 1677706196
              }
            ]
          },
          {
            "author": "jayg2468",
            "body": "Allpa 42L vs Forclaz 40L side by side comparison:\n\n1. Size:\n\nAllpa: My first thought when opening the Allpa was that it looks a lot longer and wider than the Forclaz when basically the same weight.\n\nForclaz: It seems to be deeper which is where it gets the room \n\n2. Main packing pocket:\n\nSimilar set up. Again the Allpa pocket is a bit bigger, although the Forclaz seems a bit deeper. The Allpa also has has a very small side pocket within this pocket for valuables. The Allpa also has a long zip that means you can directly access this pocket from the outside if you need, although not entirely sure why you would need that regularly. The Forclaz does not have either feature.\n\nVerdict: ALLPA\n\n3. Packing pocket #2:\n\nBoth have a pocket about half the size of the main pocket on the other side, and both have an extra zip pocket on the front of the mesh for small items. The Forclaz pocket definitely feels deeper and I guess this is where it regains some ground on the length of the Allpa. \n\nVerdict: FORCLAZ\n\n4. Packing pocket #3:\n\nThe Allpa pocket is very shallow - probably only able to store documents here.\n\nThe Forclaz pocket on the other hand is as deep as pocket #2, making it the perfect toiletries pocket. I’m a bit surprised at the almost pointlessness of the Allpa pocket #3.\n\nVerdict: FORCLAZ\n\n5. Internal zippers:\n\nThe Allpa definitely has better feeling zips - neither of them are as good quality as the outer zips obviously. Allpa is YKK and Forclaz is SBS.\n\nVerdict: ALLPA\n\n6. Overall internal appearance:\n\nThe Allpa does look more expensive than the Forclaz unsurprisingly and feels a bit more premium. \n\nVerdict: ALLPA\n\n7. External appearance:\n\nObviously the Cotopaxi is undeniably stylish, and I do like the colour way (Cavern). That said, I really like the orangey colour of the Forclaz and it does look a bit more traveller whereas the Cotopaxi maybe shouts tourist a bit more? Small margins though. I like the material of both and both come with a raincover.\n\nVerdict: DRAW\n\n8. External pockets:\n\nThe Allpa has a water bottle holder, but it does feel quite tight, and I’m not sure how much do space there would be when the bag is completely full.\n\nThe Forclaz has two external pockets - a water bottle pocket that can be unzipped to expand the pocket (using an elastic layer fabric to keep it in place), which is great. It also cuffed pocket on the other side made out of that same material  which would be useful for all sorts of stuff.\n\nVerdict: FORCLAZ\n\n9. External zippers:\n\nI really like both external zippers - both are heavy duty. I feel like the Forclaz is a bit easier to open and close but it might be that the Allpa YKK zippers just need warming up a bit?\n\nThe zipper for the main pockets on the Allpa has a security loop which I’m finding quite fiddly to get fully shut. The Forclaz doesn’t have this loop but actually has a hole for a padlock to go through both zippers when together which is a neat feature \n\nVerdict: FORCLAZ\n\n10. Top pocket: \n\nThe Allpa has a really great top pocket. It feels really big and it’s easy to access (also has a less fiddly security loop). It’s also located on the far side of the bag. In the pocket, there are 3 cuffed slip in pockets, the main area, and then there is a zipped mesh pocket (which has two slip in pockets within that). A lot of space in here, and makes up for the internal pocket #3 being much smaller (it’s in the same space)\n\nThe Forclaz top pocket is on the back side of the bag, and is a lot smaller. It has a nice and easily workable security zipper. However, the Forclaz only has one general pocket with no extra compartments which is disappointing. Again it’s a trade off between this and pocket #3 inside. \n\nBoth have carabiners inside, but the allpa’s is more substantial.\n\nVerdict: ALLPA EASILY\n\n11. Laptop pocket:\n\nBoth have essentially the same size laptop pocket on the back side of the bag.\n\nForclaz: There is nothing extra to add here, it’s just a side pocket with no more features\n\nAllpa: The Allpa has two slip in pockets in this section - one large one with a Velcro strap, and a cuffed pocket (presumably for a charger). The pocket with the Velcro fits my iPad Air perfectly and it feels a lot more secure in there than in the Forclaz where it might be able to get knocked around a bit more due to the space it has.\n\nVerdict: ALLPA\n\n12. Extra pockets: \n\nThe Forclaz has an extra zipped pocket along the front of the bag which is well hidden, but looks like it could fit some handy extra things in there. The Allpa has no more pockets.\n\nVerdict: FORCLAZ\n\n13. Handles:\n\nAllpa: It has a detachable shoulder strap which looks nice and good quality - not sure how often it would be used though. It also has a side handle which seems fine\n\nForclaz: It has a handle at the top of the bag like a more traditional rucksack. No other handles\n\nVerdict: ALLPA, but minor win\n\n14. Straps: \n\nAllpa: Shoulder straps feel and look comfortable, same with chest straps. I don’t think the hip straps were as comfortable as they could be but it might just need some adjusting when the bag is full. The hip strap is also removable with Velcro which is a good feature \n\nForclaz: Shoulder straps feel and look comfortable. Hip strap feels much better quality as the padding comes much further of the  way round, whereas the Allpa padding ends a lot sooner. It is not removeable however isn’t great\n\nVerdict: DRAW (removable hip strap Vs comfortable strap, tricky to decide)\n\n15. Value:\n\nClearly the Forclaz wins here, £ for £ it is a better bag than the Allpa. £60 vs £220, and the Allpa is not over 3 times better! The question is though, is it still worth paying more…\n\n16. Overall verdict: I DON’T KNOW!! I was hoping when I had them side by side it would be clear which was the best option. The Forclaz feels better for the compartments internally, but the Allpa features like the top pocket and laptop pocket are real pluses. I’m going to need to fill them both up and have another think then.\n\nHopefully this was useful for people - I’m not an expert in this area at all so it’s quite an unrefined review and there’s probably things I missed too!",
            "score": 45,
            "created": 1677855421,
            "replies": [
              {
                "author": "jayg2468",
                "body": "ADDITION: I’ve just packed the Forclaz to 90% of capacity and must say I’m surprised with how much I could get in there. It also has compression straps on the side of the bag that I hadn’t fully appreciated before. I’m leaning towards the Forclaz",
                "score": 23,
                "created": 1677861352
              },
              {
                "author": "Radiologer",
                "body": "There are no Allpas anywhere near me except the 28L but I can get the Forclaz when I go overseas and buy it on arrival.\n\n&amp;#x200B;\n\nI mainly want to stow my stuff in the seat infront of me so was tossing up the Allpa 35 L vs the Forclaz. Do you think the Forclaz can fit under a seat? Thanks for your write-up!",
                "score": 3,
                "created": 1677858637
              }
            ]
          },
          {
            "author": "blanchinator",
            "body": "I've just packed this for 1-2 months in Italy and Morocco. Will report back but so far it's an excellent onebag. Well thought out organisation, and that massive side pocket is great for stashing all sort of things.\n\nMy only question at the moment is what the loops on the shoulder straps are for? And why they only put a pocket on one side of the waist belt.",
            "score": 28,
            "created": 1677687877,
            "replies": [
              {
                "author": "tealheart",
                "body": "I think they might be thumb loops / hand loops? Some hiking packs occasionally have them as an alternative to tucking your hands under the straps to take the weight off. I think anyway! :)",
                "score": 4,
                "created": 1677706348
              },
              {
                "author": "mrjaytothecee",
                "body": "Hey, how was it? How comfy are the straps? Just tried it on in store and the straps didn't  feel great. Also the zippers felt low build quality. Any issues there?",
                "score": 4,
                "created": 1695724954
              }
            ]
          },
          {
            "author": "Bigardo",
            "body": "I saw it the other day at Decathlon and one issue with this bag is that the laptop compartment is not suspended.\n\nEverything else seems solid, especially at that price.",
            "score": 27,
            "created": 1677674806,
            "replies": [
              {
                "author": "Broutythecat",
                "body": "What does suspended mean in this context?",
                "score": 15,
                "created": 1677677969
              },
              {
                "author": "tealheart",
                "body": "So, still testing with different load shapes, but so far the placement of the lower compression strap seems to create a bit of a shelf/narrow point that my laptop (~13 inch) sits above. Even after a short jog, it still prevented the laptop sliding completely to the bottom. I might still add a foam strip for peace of mind and might not work with a larger laptop, but interesting design if this keeps up!",
                "score": 6,
                "created": 1677750954
              }
            ]
          },
          {
            "author": "facciabrutta",
            "body": "Omg I’m so happy to see this! I’m non-western and I can’t get my hands on the bags mentioned in this subreddit unless someone sends it to me from abroad. But we have Decathlon here and it’s very popular. I’ve been emailing them asking for a cabin-size travel backpack, they never responded lol but they’re finally moving in the right direction. I couldn’t tell from the pictures, where’s the laptop compartment? I really hope it’s against the back of the bag and protected. Otherwise the bag wouldn’t be any different than their hiking bags - useless for digital nomads.",
            "score": 24,
            "created": 1677699629,
            "replies": [
              {
                "author": "jayg2468",
                "body": "Can confirm it’s on the back - whether it’s protected or not is a different question as someone above has noted it’s not a suspended pocket (must admit I wasn’t aware of that as an issue). I’ll inspect it a bit more and get back to you",
                "score": 10,
                "created": 1677706401
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/c6tzk52vs3la1.jpg?width=3024&format=pjpg&auto=webp&s=483bbb4a881327a913c36be4b2b5986898317cfa",
      "thread": {
        "title": "Decathlon Forclaz 40L - “Backpack Travel 500 Organiser” RPP £59.99. Initial thoughts and similarities to Allpa 42L",
        "url": "https://www.reddit.com/r/onebag/comments/11f08c2/decathlon_forclaz_40l_backpack_travel_500/?tl=fr",
        "selftext": "I’m planning on a RTW trip (from London to SE Asia / Australia by land and sea) next year, and am using a 3 week trip to Cuba in April as my practice run for Onebagging. \n\nI‘ve had my eye on the Cotopaxi Allpa 42L for a while but has been out of stock in the UK since I began searching. Yesterday it came back into stock and I pulled the trigger. However I had also coincidentally yesterday stumbled across this Decathlon Forclaz bag, at a much cheaper price (£220 vs £59.99). I’m not an expert on these types of bags, but to me it felt like the Forclaz was aiming for a lot of things that the Allpa had (see link below). \n\nhttps://www.decathlon.co.uk/p/backpack-travel-500-organizer-40-l/_/R-p-338564?mc=8787845\n\nThey both have a clamshell opening, a small pocket at the top, a separate laptop compartment, a water bottle holder (the Forclaz holder also unzips to expand, and has a stretchy pocket on the other side too), the same 3 internal compartments and safety zippers. Some might say the Forclaz took a lot of inspiration from the Allpa…\n\nAnyway, I live very close to a large Decathlon and went to pick up the Forclaz yesterday. I’m yet to pack it properly but on first inspection it does look very promising for the price. \n\nThe Allpa should be arriving this week and I’ll be comparing the two - I imagine the Allpa will feel slightly better, but whether it is £160 better is another question! Updates to come…\n\nPictures attached.",
        "author": "jayg2468",
        "score": 235,
        "numComments": 106,
        "created": 1677666031,
        "comments": [
          {
            "author": "usernameunavaliable",
            "body": "I really like Decathlon. They are affordable and their products are usually really good quality. Keep in mind that this sub usually gravitates towards super specialized (and more expensive) gear.    \n\n\nI travel a lot for work, and i have also backpacked a fair amount. I always use Decathlon´s stuff and I never felt like the quality was lacking.",
            "score": 155,
            "created": 1677682176,
            "replies": [
              {
                "author": "PhoenixRisingtw",
                "body": "Decathlon is the best value out there. Granted, you won't get as much street cred as with something like  Arc'teryx, but the price-performance ratio is really sweet.",
                "score": 43,
                "created": 1677690218
              },
              {
                "author": "jayg2468",
                "body": "I agree - I bought a Decathlon ski rucksack last year and I love it so much I’ve ended up using it for day to day activities. Great value and great quality.",
                "score": 11,
                "created": 1677706196
              }
            ]
          },
          {
            "author": "jayg2468",
            "body": "Allpa 42L vs Forclaz 40L side by side comparison:\n\n1. Size:\n\nAllpa: My first thought when opening the Allpa was that it looks a lot longer and wider than the Forclaz when basically the same weight.\n\nForclaz: It seems to be deeper which is where it gets the room \n\n2. Main packing pocket:\n\nSimilar set up. Again the Allpa pocket is a bit bigger, although the Forclaz seems a bit deeper. The Allpa also has has a very small side pocket within this pocket for valuables. The Allpa also has a long zip that means you can directly access this pocket from the outside if you need, although not entirely sure why you would need that regularly. The Forclaz does not have either feature.\n\nVerdict: ALLPA\n\n3. Packing pocket #2:\n\nBoth have a pocket about half the size of the main pocket on the other side, and both have an extra zip pocket on the front of the mesh for small items. The Forclaz pocket definitely feels deeper and I guess this is where it regains some ground on the length of the Allpa. \n\nVerdict: FORCLAZ\n\n4. Packing pocket #3:\n\nThe Allpa pocket is very shallow - probably only able to store documents here.\n\nThe Forclaz pocket on the other hand is as deep as pocket #2, making it the perfect toiletries pocket. I’m a bit surprised at the almost pointlessness of the Allpa pocket #3.\n\nVerdict: FORCLAZ\n\n5. Internal zippers:\n\nThe Allpa definitely has better feeling zips - neither of them are as good quality as the outer zips obviously. Allpa is YKK and Forclaz is SBS.\n\nVerdict: ALLPA\n\n6. Overall internal appearance:\n\nThe Allpa does look more expensive than the Forclaz unsurprisingly and feels a bit more premium. \n\nVerdict: ALLPA\n\n7. External appearance:\n\nObviously the Cotopaxi is undeniably stylish, and I do like the colour way (Cavern). That said, I really like the orangey colour of the Forclaz and it does look a bit more traveller whereas the Cotopaxi maybe shouts tourist a bit more? Small margins though. I like the material of both and both come with a raincover.\n\nVerdict: DRAW\n\n8. External pockets:\n\nThe Allpa has a water bottle holder, but it does feel quite tight, and I’m not sure how much do space there would be when the bag is completely full.\n\nThe Forclaz has two external pockets - a water bottle pocket that can be unzipped to expand the pocket (using an elastic layer fabric to keep it in place), which is great. It also cuffed pocket on the other side made out of that same material  which would be useful for all sorts of stuff.\n\nVerdict: FORCLAZ\n\n9. External zippers:\n\nI really like both external zippers - both are heavy duty. I feel like the Forclaz is a bit easier to open and close but it might be that the Allpa YKK zippers just need warming up a bit?\n\nThe zipper for the main pockets on the Allpa has a security loop which I’m finding quite fiddly to get fully shut. The Forclaz doesn’t have this loop but actually has a hole for a padlock to go through both zippers when together which is a neat feature \n\nVerdict: FORCLAZ\n\n10. Top pocket: \n\nThe Allpa has a really great top pocket. It feels really big and it’s easy to access (also has a less fiddly security loop). It’s also located on the far side of the bag. In the pocket, there are 3 cuffed slip in pockets, the main area, and then there is a zipped mesh pocket (which has two slip in pockets within that). A lot of space in here, and makes up for the internal pocket #3 being much smaller (it’s in the same space)\n\nThe Forclaz top pocket is on the back side of the bag, and is a lot smaller. It has a nice and easily workable security zipper. However, the Forclaz only has one general pocket with no extra compartments which is disappointing. Again it’s a trade off between this and pocket #3 inside. \n\nBoth have carabiners inside, but the allpa’s is more substantial.\n\nVerdict: ALLPA EASILY\n\n11. Laptop pocket:\n\nBoth have essentially the same size laptop pocket on the back side of the bag.\n\nForclaz: There is nothing extra to add here, it’s just a side pocket with no more features\n\nAllpa: The Allpa has two slip in pockets in this section - one large one with a Velcro strap, and a cuffed pocket (presumably for a charger). The pocket with the Velcro fits my iPad Air perfectly and it feels a lot more secure in there than in the Forclaz where it might be able to get knocked around a bit more due to the space it has.\n\nVerdict: ALLPA\n\n12. Extra pockets: \n\nThe Forclaz has an extra zipped pocket along the front of the bag which is well hidden, but looks like it could fit some handy extra things in there. The Allpa has no more pockets.\n\nVerdict: FORCLAZ\n\n13. Handles:\n\nAllpa: It has a detachable shoulder strap which looks nice and good quality - not sure how often it would be used though. It also has a side handle which seems fine\n\nForclaz: It has a handle at the top of the bag like a more traditional rucksack. No other handles\n\nVerdict: ALLPA, but minor win\n\n14. Straps: \n\nAllpa: Shoulder straps feel and look comfortable, same with chest straps. I don’t think the hip straps were as comfortable as they could be but it might just need some adjusting when the bag is full. The hip strap is also removable with Velcro which is a good feature \n\nForclaz: Shoulder straps feel and look comfortable. Hip strap feels much better quality as the padding comes much further of the  way round, whereas the Allpa padding ends a lot sooner. It is not removeable however isn’t great\n\nVerdict: DRAW (removable hip strap Vs comfortable strap, tricky to decide)\n\n15. Value:\n\nClearly the Forclaz wins here, £ for £ it is a better bag than the Allpa. £60 vs £220, and the Allpa is not over 3 times better! The question is though, is it still worth paying more…\n\n16. Overall verdict: I DON’T KNOW!! I was hoping when I had them side by side it would be clear which was the best option. The Forclaz feels better for the compartments internally, but the Allpa features like the top pocket and laptop pocket are real pluses. I’m going to need to fill them both up and have another think then.\n\nHopefully this was useful for people - I’m not an expert in this area at all so it’s quite an unrefined review and there’s probably things I missed too!",
            "score": 45,
            "created": 1677855421,
            "replies": [
              {
                "author": "jayg2468",
                "body": "ADDITION: I’ve just packed the Forclaz to 90% of capacity and must say I’m surprised with how much I could get in there. It also has compression straps on the side of the bag that I hadn’t fully appreciated before. I’m leaning towards the Forclaz",
                "score": 23,
                "created": 1677861352
              },
              {
                "author": "Radiologer",
                "body": "There are no Allpas anywhere near me except the 28L but I can get the Forclaz when I go overseas and buy it on arrival.\n\n&amp;#x200B;\n\nI mainly want to stow my stuff in the seat infront of me so was tossing up the Allpa 35 L vs the Forclaz. Do you think the Forclaz can fit under a seat? Thanks for your write-up!",
                "score": 3,
                "created": 1677858637
              }
            ]
          },
          {
            "author": "blanchinator",
            "body": "I've just packed this for 1-2 months in Italy and Morocco. Will report back but so far it's an excellent onebag. Well thought out organisation, and that massive side pocket is great for stashing all sort of things.\n\nMy only question at the moment is what the loops on the shoulder straps are for? And why they only put a pocket on one side of the waist belt.",
            "score": 28,
            "created": 1677687877,
            "replies": [
              {
                "author": "tealheart",
                "body": "I think they might be thumb loops / hand loops? Some hiking packs occasionally have them as an alternative to tucking your hands under the straps to take the weight off. I think anyway! :)",
                "score": 4,
                "created": 1677706348
              },
              {
                "author": "mrjaytothecee",
                "body": "Hey, how was it? How comfy are the straps? Just tried it on in store and the straps didn't  feel great. Also the zippers felt low build quality. Any issues there?",
                "score": 4,
                "created": 1695724954
              }
            ]
          },
          {
            "author": "Bigardo",
            "body": "I saw it the other day at Decathlon and one issue with this bag is that the laptop compartment is not suspended.\n\nEverything else seems solid, especially at that price.",
            "score": 27,
            "created": 1677674806,
            "replies": [
              {
                "author": "Broutythecat",
                "body": "What does suspended mean in this context?",
                "score": 15,
                "created": 1677677969
              },
              {
                "author": "tealheart",
                "body": "So, still testing with different load shapes, but so far the placement of the lower compression strap seems to create a bit of a shelf/narrow point that my laptop (~13 inch) sits above. Even after a short jog, it still prevented the laptop sliding completely to the bottom. I might still add a foam strip for peace of mind and might not work with a larger laptop, but interesting design if this keeps up!",
                "score": 6,
                "created": 1677750954
              }
            ]
          },
          {
            "author": "facciabrutta",
            "body": "Omg I’m so happy to see this! I’m non-western and I can’t get my hands on the bags mentioned in this subreddit unless someone sends it to me from abroad. But we have Decathlon here and it’s very popular. I’ve been emailing them asking for a cabin-size travel backpack, they never responded lol but they’re finally moving in the right direction. I couldn’t tell from the pictures, where’s the laptop compartment? I really hope it’s against the back of the bag and protected. Otherwise the bag wouldn’t be any different than their hiking bags - useless for digital nomads.",
            "score": 24,
            "created": 1677699629,
            "replies": [
              {
                "author": "jayg2468",
                "body": "Can confirm it’s on the back - whether it’s protected or not is a different question as someone above has noted it’s not a suspended pocket (must admit I wasn’t aware of that as an issue). I’ll inspect it a bit more and get back to you",
                "score": 10,
                "created": 1677706401
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/j38rw62vs3la1.jpg?width=3024&format=pjpg&auto=webp&s=c04288020e349eb4e07049669f2bcc52a40658c7",
      "thread": {
        "title": "Decathlon Forclaz 40L - “Backpack Travel 500 Organiser” RPP £59.99. Initial thoughts and similarities to Allpa 42L",
        "url": "https://www.reddit.com/r/onebag/comments/11f08c2/decathlon_forclaz_40l_backpack_travel_500/?tl=fr",
        "selftext": "I’m planning on a RTW trip (from London to SE Asia / Australia by land and sea) next year, and am using a 3 week trip to Cuba in April as my practice run for Onebagging. \n\nI‘ve had my eye on the Cotopaxi Allpa 42L for a while but has been out of stock in the UK since I began searching. Yesterday it came back into stock and I pulled the trigger. However I had also coincidentally yesterday stumbled across this Decathlon Forclaz bag, at a much cheaper price (£220 vs £59.99). I’m not an expert on these types of bags, but to me it felt like the Forclaz was aiming for a lot of things that the Allpa had (see link below). \n\nhttps://www.decathlon.co.uk/p/backpack-travel-500-organizer-40-l/_/R-p-338564?mc=8787845\n\nThey both have a clamshell opening, a small pocket at the top, a separate laptop compartment, a water bottle holder (the Forclaz holder also unzips to expand, and has a stretchy pocket on the other side too), the same 3 internal compartments and safety zippers. Some might say the Forclaz took a lot of inspiration from the Allpa…\n\nAnyway, I live very close to a large Decathlon and went to pick up the Forclaz yesterday. I’m yet to pack it properly but on first inspection it does look very promising for the price. \n\nThe Allpa should be arriving this week and I’ll be comparing the two - I imagine the Allpa will feel slightly better, but whether it is £160 better is another question! Updates to come…\n\nPictures attached.",
        "author": "jayg2468",
        "score": 235,
        "numComments": 106,
        "created": 1677666031,
        "comments": [
          {
            "author": "usernameunavaliable",
            "body": "I really like Decathlon. They are affordable and their products are usually really good quality. Keep in mind that this sub usually gravitates towards super specialized (and more expensive) gear.    \n\n\nI travel a lot for work, and i have also backpacked a fair amount. I always use Decathlon´s stuff and I never felt like the quality was lacking.",
            "score": 155,
            "created": 1677682176,
            "replies": [
              {
                "author": "PhoenixRisingtw",
                "body": "Decathlon is the best value out there. Granted, you won't get as much street cred as with something like  Arc'teryx, but the price-performance ratio is really sweet.",
                "score": 43,
                "created": 1677690218
              },
              {
                "author": "jayg2468",
                "body": "I agree - I bought a Decathlon ski rucksack last year and I love it so much I’ve ended up using it for day to day activities. Great value and great quality.",
                "score": 11,
                "created": 1677706196
              }
            ]
          },
          {
            "author": "jayg2468",
            "body": "Allpa 42L vs Forclaz 40L side by side comparison:\n\n1. Size:\n\nAllpa: My first thought when opening the Allpa was that it looks a lot longer and wider than the Forclaz when basically the same weight.\n\nForclaz: It seems to be deeper which is where it gets the room \n\n2. Main packing pocket:\n\nSimilar set up. Again the Allpa pocket is a bit bigger, although the Forclaz seems a bit deeper. The Allpa also has has a very small side pocket within this pocket for valuables. The Allpa also has a long zip that means you can directly access this pocket from the outside if you need, although not entirely sure why you would need that regularly. The Forclaz does not have either feature.\n\nVerdict: ALLPA\n\n3. Packing pocket #2:\n\nBoth have a pocket about half the size of the main pocket on the other side, and both have an extra zip pocket on the front of the mesh for small items. The Forclaz pocket definitely feels deeper and I guess this is where it regains some ground on the length of the Allpa. \n\nVerdict: FORCLAZ\n\n4. Packing pocket #3:\n\nThe Allpa pocket is very shallow - probably only able to store documents here.\n\nThe Forclaz pocket on the other hand is as deep as pocket #2, making it the perfect toiletries pocket. I’m a bit surprised at the almost pointlessness of the Allpa pocket #3.\n\nVerdict: FORCLAZ\n\n5. Internal zippers:\n\nThe Allpa definitely has better feeling zips - neither of them are as good quality as the outer zips obviously. Allpa is YKK and Forclaz is SBS.\n\nVerdict: ALLPA\n\n6. Overall internal appearance:\n\nThe Allpa does look more expensive than the Forclaz unsurprisingly and feels a bit more premium. \n\nVerdict: ALLPA\n\n7. External appearance:\n\nObviously the Cotopaxi is undeniably stylish, and I do like the colour way (Cavern). That said, I really like the orangey colour of the Forclaz and it does look a bit more traveller whereas the Cotopaxi maybe shouts tourist a bit more? Small margins though. I like the material of both and both come with a raincover.\n\nVerdict: DRAW\n\n8. External pockets:\n\nThe Allpa has a water bottle holder, but it does feel quite tight, and I’m not sure how much do space there would be when the bag is completely full.\n\nThe Forclaz has two external pockets - a water bottle pocket that can be unzipped to expand the pocket (using an elastic layer fabric to keep it in place), which is great. It also cuffed pocket on the other side made out of that same material  which would be useful for all sorts of stuff.\n\nVerdict: FORCLAZ\n\n9. External zippers:\n\nI really like both external zippers - both are heavy duty. I feel like the Forclaz is a bit easier to open and close but it might be that the Allpa YKK zippers just need warming up a bit?\n\nThe zipper for the main pockets on the Allpa has a security loop which I’m finding quite fiddly to get fully shut. The Forclaz doesn’t have this loop but actually has a hole for a padlock to go through both zippers when together which is a neat feature \n\nVerdict: FORCLAZ\n\n10. Top pocket: \n\nThe Allpa has a really great top pocket. It feels really big and it’s easy to access (also has a less fiddly security loop). It’s also located on the far side of the bag. In the pocket, there are 3 cuffed slip in pockets, the main area, and then there is a zipped mesh pocket (which has two slip in pockets within that). A lot of space in here, and makes up for the internal pocket #3 being much smaller (it’s in the same space)\n\nThe Forclaz top pocket is on the back side of the bag, and is a lot smaller. It has a nice and easily workable security zipper. However, the Forclaz only has one general pocket with no extra compartments which is disappointing. Again it’s a trade off between this and pocket #3 inside. \n\nBoth have carabiners inside, but the allpa’s is more substantial.\n\nVerdict: ALLPA EASILY\n\n11. Laptop pocket:\n\nBoth have essentially the same size laptop pocket on the back side of the bag.\n\nForclaz: There is nothing extra to add here, it’s just a side pocket with no more features\n\nAllpa: The Allpa has two slip in pockets in this section - one large one with a Velcro strap, and a cuffed pocket (presumably for a charger). The pocket with the Velcro fits my iPad Air perfectly and it feels a lot more secure in there than in the Forclaz where it might be able to get knocked around a bit more due to the space it has.\n\nVerdict: ALLPA\n\n12. Extra pockets: \n\nThe Forclaz has an extra zipped pocket along the front of the bag which is well hidden, but looks like it could fit some handy extra things in there. The Allpa has no more pockets.\n\nVerdict: FORCLAZ\n\n13. Handles:\n\nAllpa: It has a detachable shoulder strap which looks nice and good quality - not sure how often it would be used though. It also has a side handle which seems fine\n\nForclaz: It has a handle at the top of the bag like a more traditional rucksack. No other handles\n\nVerdict: ALLPA, but minor win\n\n14. Straps: \n\nAllpa: Shoulder straps feel and look comfortable, same with chest straps. I don’t think the hip straps were as comfortable as they could be but it might just need some adjusting when the bag is full. The hip strap is also removable with Velcro which is a good feature \n\nForclaz: Shoulder straps feel and look comfortable. Hip strap feels much better quality as the padding comes much further of the  way round, whereas the Allpa padding ends a lot sooner. It is not removeable however isn’t great\n\nVerdict: DRAW (removable hip strap Vs comfortable strap, tricky to decide)\n\n15. Value:\n\nClearly the Forclaz wins here, £ for £ it is a better bag than the Allpa. £60 vs £220, and the Allpa is not over 3 times better! The question is though, is it still worth paying more…\n\n16. Overall verdict: I DON’T KNOW!! I was hoping when I had them side by side it would be clear which was the best option. The Forclaz feels better for the compartments internally, but the Allpa features like the top pocket and laptop pocket are real pluses. I’m going to need to fill them both up and have another think then.\n\nHopefully this was useful for people - I’m not an expert in this area at all so it’s quite an unrefined review and there’s probably things I missed too!",
            "score": 45,
            "created": 1677855421,
            "replies": [
              {
                "author": "jayg2468",
                "body": "ADDITION: I’ve just packed the Forclaz to 90% of capacity and must say I’m surprised with how much I could get in there. It also has compression straps on the side of the bag that I hadn’t fully appreciated before. I’m leaning towards the Forclaz",
                "score": 23,
                "created": 1677861352
              },
              {
                "author": "Radiologer",
                "body": "There are no Allpas anywhere near me except the 28L but I can get the Forclaz when I go overseas and buy it on arrival.\n\n&amp;#x200B;\n\nI mainly want to stow my stuff in the seat infront of me so was tossing up the Allpa 35 L vs the Forclaz. Do you think the Forclaz can fit under a seat? Thanks for your write-up!",
                "score": 3,
                "created": 1677858637
              }
            ]
          },
          {
            "author": "blanchinator",
            "body": "I've just packed this for 1-2 months in Italy and Morocco. Will report back but so far it's an excellent onebag. Well thought out organisation, and that massive side pocket is great for stashing all sort of things.\n\nMy only question at the moment is what the loops on the shoulder straps are for? And why they only put a pocket on one side of the waist belt.",
            "score": 28,
            "created": 1677687877,
            "replies": [
              {
                "author": "tealheart",
                "body": "I think they might be thumb loops / hand loops? Some hiking packs occasionally have them as an alternative to tucking your hands under the straps to take the weight off. I think anyway! :)",
                "score": 4,
                "created": 1677706348
              },
              {
                "author": "mrjaytothecee",
                "body": "Hey, how was it? How comfy are the straps? Just tried it on in store and the straps didn't  feel great. Also the zippers felt low build quality. Any issues there?",
                "score": 4,
                "created": 1695724954
              }
            ]
          },
          {
            "author": "Bigardo",
            "body": "I saw it the other day at Decathlon and one issue with this bag is that the laptop compartment is not suspended.\n\nEverything else seems solid, especially at that price.",
            "score": 27,
            "created": 1677674806,
            "replies": [
              {
                "author": "Broutythecat",
                "body": "What does suspended mean in this context?",
                "score": 15,
                "created": 1677677969
              },
              {
                "author": "tealheart",
                "body": "So, still testing with different load shapes, but so far the placement of the lower compression strap seems to create a bit of a shelf/narrow point that my laptop (~13 inch) sits above. Even after a short jog, it still prevented the laptop sliding completely to the bottom. I might still add a foam strip for peace of mind and might not work with a larger laptop, but interesting design if this keeps up!",
                "score": 6,
                "created": 1677750954
              }
            ]
          },
          {
            "author": "facciabrutta",
            "body": "Omg I’m so happy to see this! I’m non-western and I can’t get my hands on the bags mentioned in this subreddit unless someone sends it to me from abroad. But we have Decathlon here and it’s very popular. I’ve been emailing them asking for a cabin-size travel backpack, they never responded lol but they’re finally moving in the right direction. I couldn’t tell from the pictures, where’s the laptop compartment? I really hope it’s against the back of the bag and protected. Otherwise the bag wouldn’t be any different than their hiking bags - useless for digital nomads.",
            "score": 24,
            "created": 1677699629,
            "replies": [
              {
                "author": "jayg2468",
                "body": "Can confirm it’s on the back - whether it’s protected or not is a different question as someone above has noted it’s not a suspended pocket (must admit I wasn’t aware of that as an issue). I’ll inspect it a bit more and get back to you",
                "score": 10,
                "created": 1677706401
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/99rn4qb2dvde1.jpg?width=1125&format=pjpg&auto=webp&s=4a69f7e5b223e507bc5eaf83beea82ad7a70ae2d",
      "thread": {
        "title": "Better Packing Cube Bundle?",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1i4ozu7/better_packing_cube_bundle/",
        "selftext": "purchasing travel gear for family of 4 (2 adults 2 young children) flight, this trip consists of 4 personal item back packs (~osprey 26+6 size) and a checked suitcase. Travel a few times times a year and never used packing cubes before and now seems like a great time to start. This trip is kind of a one off in luggage we’re bringing, usually only carryon size bags and no checked luggage. Looking at Eagle Creek packing cube bundles both isolate compression and trying to decide which is best for my situation both this trip and beyond. any info/tips would be extremely appreciated. \n\n1. back country: 2 large, 2 medium, 1 medium split clean/dirty, and shoe bag $138.37 (pic was before tax)\n\n2. Eagle Creek: 2 medium, 2 medium split, and 4 small 193.16",
        "author": "J_Culla23",
        "score": 4,
        "numComments": 2,
        "created": 1737257023,
        "comments": [
          {
            "author": "iserane",
            "body": "Sierra Trading Post has lots of Eagle Creek cube sets for $20-30, and individual cubes for $6-13. I went that route, got a few different sets, to mix and match. They have basically the prior version of what you posted and would run you like $50 per set of 4 instead.\n\nPreviously had used the Peak Design packing cubes, and would also recommend.",
            "score": 9,
            "created": 1737258281,
            "replies": [
              {
                "author": "J_Culla23",
                "body": "wow you weren’t kidding. thanks for the recommendation, any you particularly like more than the others?",
                "score": 1,
                "created": 1737258996
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/scj71qb2dvde1.jpg?width=1125&format=pjpg&auto=webp&s=7f03a17418f605438c20af0d163d31d95f243037",
      "thread": {
        "title": "Better Packing Cube Bundle?",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1i4ozu7/better_packing_cube_bundle/",
        "selftext": "purchasing travel gear for family of 4 (2 adults 2 young children) flight, this trip consists of 4 personal item back packs (~osprey 26+6 size) and a checked suitcase. Travel a few times times a year and never used packing cubes before and now seems like a great time to start. This trip is kind of a one off in luggage we’re bringing, usually only carryon size bags and no checked luggage. Looking at Eagle Creek packing cube bundles both isolate compression and trying to decide which is best for my situation both this trip and beyond. any info/tips would be extremely appreciated. \n\n1. back country: 2 large, 2 medium, 1 medium split clean/dirty, and shoe bag $138.37 (pic was before tax)\n\n2. Eagle Creek: 2 medium, 2 medium split, and 4 small 193.16",
        "author": "J_Culla23",
        "score": 4,
        "numComments": 2,
        "created": 1737257023,
        "comments": [
          {
            "author": "iserane",
            "body": "Sierra Trading Post has lots of Eagle Creek cube sets for $20-30, and individual cubes for $6-13. I went that route, got a few different sets, to mix and match. They have basically the prior version of what you posted and would run you like $50 per set of 4 instead.\n\nPreviously had used the Peak Design packing cubes, and would also recommend.",
            "score": 9,
            "created": 1737258281,
            "replies": [
              {
                "author": "J_Culla23",
                "body": "wow you weren’t kidding. thanks for the recommendation, any you particularly like more than the others?",
                "score": 1,
                "created": 1737258996
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/s6fzo0p1i4v81.jpg?width=1080&crop=smart&auto=webp&s=3a066ff0b0fe762abbf3d1132aeb3d501f728783",
      "thread": {
        "title": "Comparison of Eagle Creek Tour 40L and Osprey Farpoint 40L",
        "url": "https://www.reddit.com/r/onebag/comments/u9n2rz/comparison_of_eagle_creek_tour_40l_and_osprey/",
        "selftext": "",
        "author": "KidneyLand",
        "score": 81,
        "numComments": 37,
        "created": 1650656994,
        "comments": [
          {
            "author": "KidneyLand",
            "body": "I'm getting ready for a couple overseas and domestic trips in the next few months. I've been looking for a suitable bag to meet my needs, which lead me to the selection of either the Eagle Creek Tour 40L or the popular Osprey Farpoint 40L. Both fit within my criteria of quality bags at the same exact price point with lifetime warranties, along with various other desirable traits.\n\nFor this comparison, I will mostly be adding pictures of the Eagle Creek as it is a newer bag with not a lot of information out there. Hopefully it can help people make up their decisions.\n\n**Internal Structure:**\n\nBoth Eagle Creek and Farpoint comes with a book (clam) style opening with easy access to the internals. Whereas the Farpoint 40L opens from top to bottom, and the EC opens up at from right to left. The Farpoint comes with a nice bright green high visibility interior, while the Eagle Creek is just black. Although on the EC it varies depending on the color you choose.\n\n[Comparison side by side](https://imgur.com/hYmY1NQ)\n\nIn terms of internal organization, both are very similar in terms of sizing. Both also come with internal clips. Here is a image where I quickly stuff the bag with a fully loaded EC Medium and Small packing cube, Marmot Precip, and 7 pairs of socks. Also in the internal pocket is an REI Co-op Flash 18L with my bladder, and 1 quart bag with toiletries.\n\n[Farpoint - Interior Loaded Up](https://imgur.com/3Gglzpm)\n\n[EC - Interior Loaded Up](https://imgur.com/SRbxE5P)\n\n**Size and Measurements:**\n\nBoth are rated at 40L, and I would say the measurement dimensions provided by both Farpoint and EC on their websites are correct. Although, in terms of capacity it seems the Farpoint can definitely hold more due to the outside pockets.\n\n[Picture of both bags side by side fully stuffed with clothes and towels](https://imgur.com/h4bb0VS)\n\nThe EC comes with a single side water bottle pouch, while the Farpoint comes with two back water bottle pouches. The EC bottle pouch seems to hold more. Here is an [image of the Farpoint](https://imgur.com/SiCa8lj) and [EC](https://imgur.com/wtWvdzQ) using my 18 oz Hydroflask. Not a fan of the Farpoint water bottle holders on the back, but not a dealbreaker.\n\nThe EC has the capability to expand to 43L according to the outside tag. I feel once you unzip the bag to provide the expanded capacity their sizes are more evenly matched.\n\n**Shoulder straps, hip belt, and sternum strap:**\n\nBoth come with a foam shoulder straps. The Farpoint shoulder straps are a bit wider, but the edgeless design on the EC make carrying the bag much more comfortable, at least for me. Also the EC has a more pronounced S curve as compared to the Farpoint which adds to the overall comfortable.\n\nBoth bags come with a sternum strap with a built in whistle. Although the EC is a stretchy material versus the Farpoint non-stretchy.\n\n[Side by side view](https://imgur.com/RREsfSN)\n\nThe Farpoint's hip belt is much better and provides more surface and cushion to wrap around your body. The straps are also wider than the 1 inch straps of the EC. The EC hip strap is pretty thin in comparison, but is also stowable which the Farpoint is not.\n\n[Image side by side](https://imgur.com/W8Nu6YB)\n\n[Hipbelt side by side](https://imgur.com/IP4zISJ)\n\nI also like to mention both bags have the ability to stow away the straps. The Farpoint has a wrap which can cover the shoulder and hip straps. The EC also has a type of strap and waist belt [cover](https://imgur.com/NVhO47V), but it also doubles as a [rain cover](https://imgur.com/lyNHOiR)! The EC also has an adjustable yoke that is secured to the back padded area using velcro.\n\n**External Features:**\n\nBoth the EC and Farpoint come with a top handle and side handle. [The Farpoint](https://imgur.com/SD0gIIX) handles are larger and have more cushion, but the [EC](https://imgur.com/mL4QUm1) is adequate in terms of sizing.\n\n[Side Handles](https://imgur.com/mhlGFf7)\n\nFarpoint has a one large external pocket with a laptop organizer which sits in the back, so it sits to the outside of the bag. Apparently a lot of people hate this feature, but I don't plan on carrying a laptop.\n\nEC has two minimalist pockets on the [outside](https://imgur.com/s0ZR9T0) with no organization. The bottom pocket does have a key leash. EC bag is the traditional laptop organization near the back of the bag with a side opening zipper. \n\nSpeaking of the [zippers](https://imgur.com/5dr1CF3), the Farpoint uses a larger YKK zipper and EC uses their own brand of zippers. I don't know why, but I expected the Farpoint zippers to be much smoother. It was quite the opposite, I found the EC to be smoother and easier to open. Opening the Farpoint was a bit of a pain, as the rain cover would often add resistance to the pulling of the zippers.\n\n**Comfort**\n\nYMMV! Everyone's body is ***DIFFERENT***. I got the M/L torso size for both bags as their respective sizing seem to match my body type. For this I thought the Farpoint would have been the clear winner here, but surprisingly I found the Eagle Creek to be much more comfortable even with the puny waist strap. Both bags seem to sit on my hip shelf well, but the [back lower padding](https://imgur.com/vJOMX5N) of the EC adds a lot of comfortable to my lower back. I feel the Farpoint adds more strain on my lower back over longer periods of time. I tested this by wearing the bag for about an hour or so.\n\n**Conclusion**\nAnyway, I hope this helps anyone out consider either of these two bags.  I'm about to put in my Amazon return, as I've tested these bags for a month now. In you are wondering, I am picking the Eagle Creek Tour 40L. But that is just my preference in terms of comfortable, organization, and aesthetic. Both bags are not perfect, but I feel more comfortable with the Eagle Creek. If I could just combine the high visibility interior and waist belt of the Farpoint with the Eagle Creek, it would have been near perfect.",
            "score": 41,
            "created": 1650657001,
            "replies": [
              {
                "author": "San_Marino",
                "body": "Thanks for the post. This is great info. I'm in a similar boat as you and have been considering picking up the farpoint (because it's a fan favorite), but now I'm interested in trying out the eagle creek. Can you share a link where you picked this up?",
                "score": 7,
                "created": 1650980385
              },
              {
                "author": "FatFingerHelperBot",
                "body": "It seems that your comment contains 1 or more links that are hard to tap for mobile users. \nI will extend those so they're easier for our sausage fingers to click!\n\n\n[Here is link number 1 - Previous text \"EC\"](https://imgur.com/wtWvdzQ)\n\n[Here is link number 2 - Previous text \"EC\"](https://imgur.com/mL4QUm1)\n\n\n\n----\n^Please ^PM ^[\\/u\\/eganwall](http://reddit.com/user/eganwall) ^with ^issues ^or ^feedback! ^| ^[Code](https://github.com/eganwall/FatFingerHelperBot) ^| ^[Delete](https://reddit.com/message/compose/?to=FatFingerHelperBot&amp;subject=delete&amp;message=delete%20i5sh1hz)",
                "score": 3,
                "created": 1650657014
              }
            ]
          },
          {
            "author": "jadeforrester",
            "body": "thanks for the great review! I ended up getting the eagle creek one too :)",
            "score": 10,
            "created": 1650984121,
            "replies": [
              {
                "author": "[deleted]",
                "body": "Please share your thoughts when you get it, because I am ambivalent which one to choose from these two..",
                "score": 9,
                "created": 1651301992
              },
              {
                "author": "keepitpono",
                "body": "Hi! I would love to hear your thoughts on what you thought about the bag!!",
                "score": 3,
                "created": 1705603068
              }
            ]
          },
          {
            "author": "CryptographerNo7137",
            "body": "I am very glad I stumbled onto this thread. I am stuck at these two as well. How is lockability? Can you lock all zippered areas on both bags?",
            "score": 3,
            "created": 1664217652,
            "replies": [
              {
                "author": "KidneyLand",
                "body": "Both offer lockable zippers for the main compartment. Both don't offer lockable zippers for the outside pockets though.",
                "score": 3,
                "created": 1664222294
              }
            ]
          },
          {
            "author": "athumans",
            "body": "Hi, can anyone comment on the size of the Tour Travel external pockets. From what I see one is a passport size and another could handle a small paperback book or something. I travel with kids and need to keep some things at hand so I need to consider extra pockets. The EC has most of the features I want but may be a bit too minimal.",
            "score": 2,
            "created": 1654799873,
            "replies": [
              {
                "author": "KidneyLand",
                "body": "I would say your assessment is about right. There are two exterior pockets. I can fit my passport wallet into the top portion with additional space for a couple small items. The one on the bottom is larger. I can fit a Kindle, and book or two in there. I could probably fit a external battery charger too. The bottom has a key leash too.\n\nI made some measurements with my tape to the best of my ability:\n\nTop pocket: 4.5\" x 7\"\nBottom pocket: 11\" x 7\"",
                "score": 6,
                "created": 1654825314
              }
            ]
          },
          {
            "author": "scotttttie",
            "body": "Are the backpack straps storable on the EC or just the waist straps?",
            "score": 2,
            "created": 1663939601,
            "replies": [
              {
                "author": "KidneyLand",
                "body": "Yes. The raincover acts as a way to stow the shoulder straps",
                "score": 5,
                "created": 1663967320
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/oj3z73jdcove1.jpeg?width=640&crop=smart&auto=webp&s=a07be50e817cefee64b81d2667a6102dad672c8c",
      "thread": {
        "title": "Thought I'd ask about backpacks from the best backpackers I know",
        "url": "https://www.reddit.com/r/USMC/comments/1k2i5rj/thought_id_ask_about_backpacks_from_the_best/?tl=es-es",
        "selftext": "I bought this here backpack - the Eagle Creek Global Companion, with a 65L capacity and a laptop compartment - back when it launched in like 2017. It's starting to fall apart now. The netting is torn a bit inside and outside, the waist buckle is broken. I think it's time to look for an upgrade.\n\nAny suggestions for a 50L+ laptop backpack that wouldn't give Staffy any consternations if I wore it in uniform while moving to and from the shop?",
        "author": "jhm-grose",
        "score": 6,
        "numComments": 15,
        "created": 1745017308,
        "comments": [
          {
            "author": "Sorta_jewy_with_it",
            "body": "I just discovered that this sub has its own emojis so enjoy some of this ![img](emote|t5_2qswv|7526)![img](emote|t5_2qswv|7526)![img](emote|t5_2qswv|7526)",
            "score": 18,
            "created": 1745020097,
            "replies": [
              {
                "author": "Illustrious_Ad_4939",
                "body": "![img](emote|t5_2qswv|7528)![img](emote|t5_2qswv|7529)![img](emote|t5_2qswv|7530)![img](emote|t5_2qswv|7531)![img](emote|t5_2qswv|7526)![img](emote|t5_2qswv|7527)![img](emote|t5_2qswv|7533)",
                "score": 4,
                "created": 1745037452
              }
            ]
          },
          {
            "author": "psyb3r0",
            "body": "https://preview.redd.it/l4c32fu2iove1.png?width=800&amp;format=png&amp;auto=webp&amp;s=0daf0d9fa4cb4d96d26a84c1e65482bb367f4ed6",
            "score": 11,
            "created": 1745019251,
            "replies": []
          },
          {
            "author": "Jodies-9-inch-leg",
            "body": "https://preview.redd.it/fgdj6gnqqove1.jpeg?width=748&amp;format=pjpg&amp;auto=webp&amp;s=1f59f92660498b098cb2d23f07871697128d22fb",
            "score": 7,
            "created": 1745022140,
            "replies": []
          },
          {
            "author": "idontknowmaybenot",
            "body": "Idk where you’re at, but if you’re close to an REI they have “garage sales” where they sell slightly used gear (usually from their rental department) for wayyyy less. Got a sick day pack, snowshoes, and a tent from there and have had them for years. ",
            "score": 5,
            "created": 1745021958,
            "replies": []
          },
          {
            "author": "surelythisisoriginal",
            "body": "I'm a big fan of Osprey because they have a dope warranty. The best advice I can give is buy something that fits well and feels good. Brand name don't mean nothing if it don't feel good.",
            "score": 3,
            "created": 1745031938,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/0hx73yog98wb1.jpg?width=640&crop=smart&auto=webp&s=0a6fffa2d9194eaa7206dc2e121fb01d0592d4e8",
      "thread": {
        "title": "Any opinions about the travel 900 backpack by forclaz ?",
        "url": "https://www.reddit.com/r/backpacking/comments/17fpja8/any_opinions_about_the_travel_900_backpack_by/?tl=fr",
        "selftext": "I will soon be backpacking for the first time and I am therefore looking for a suitable bag. I don't want it too big to hope to be able to keep it in cabin luggage sometimes. this one is a 50L and the upper part is 6L and can be detached to be worn as a small backpack. is this really useful?",
        "author": "D3xlo",
        "score": 9,
        "numComments": 23,
        "created": 1698186880,
        "comments": [
          {
            "author": "whiskey_bud",
            "body": "For figuring out cabin bags, you need to ignore the volume capacity (50L) and look at the spatial dimensions (length, width, and depth). There is also not really a standard way for measuring the volume - some companies just consider the main compartment, while others add in each little pocket. Generally, 50L is too big for carry on, but you should actually look up the fully packed dimensions rather than the capacity. [Looking on the site](https://www.decathlon.com/products/forclaz-travel-trekking-backpack-900-506l-with-suitcase-opening-324146?variant=39980312035390#product-features), the height is 65cm (25.6\"), which is much too big for a carryon (it normally maxes out at 20\" - 22\"). \n\nOverall, I really like Decathlon's bags, including the Forclaz. I've used them extensively for both wilderness backpacking, as well as traveling. But this probably is too big for a carry on, for pretty much any airline. Go find a 40L bag and you'll have more luck.",
            "score": 7,
            "created": 1698222350,
            "replies": [
              {
                "author": "D3xlo",
                "body": "Indeed, I suspect that this one will be complicated for a carry on. Is 40L enough for backpacking for several weeks/months while roaming?",
                "score": 1,
                "created": 1698253057
              },
              {
                "author": "Ewhore69",
                "body": "thats the height with 6l compartment included without it is around 55 cm wich approves of most airlines maximum height of hand lugage",
                "score": 1,
                "created": 1704622204
              }
            ]
          },
          {
            "author": "Archimedes_00",
            "body": "Backpacking in the form of camping or traveling? It’s a perfect size for traveling. The detachable day bag is gem too. Big aspects in a bag, for me, are zippers to access the bottom and/or sides so you don’t have to dig through the top. An aluminum frame for lightweight bag strength that distributes the weight. A belly strap with pockets, I like to snack on the go. Finally a built in rain tarp. \n\nThe tarp is nice but you can buy one separately. If this is for camping, it’ll be a great 2 season. In my experience, 3/4 season camping requires more bulky equipment and 50L may not make the cut",
            "score": 5,
            "created": 1698189342,
            "replies": [
              {
                "author": "D3xlo",
                "body": "Backpacking like travelling ! Thanks for all your tips I’ll consider it for my choice \nThis bag has a built in rain tarp",
                "score": 2,
                "created": 1698191021
              }
            ]
          },
          {
            "author": "Lukozade2507",
            "body": "Reminds me of my (discontinued) Decathlon Arpenaz 40L and it's one of the best little UL style backpacks in its price range. Decathlon/Forclaz gets an unfairly bad rep around here, I say go for it, I really like the colour too.",
            "score": 3,
            "created": 1698190673,
            "replies": [
              {
                "author": "whiskey_bud",
                "body": "Decathlon bags are phenomenal when it comes to value. They're a fraction of the cost of Osprey etc, and perform quite well. If you're going to thru hike the PCT or something, sure, spend the extra $400USD on an Osprey. But if you're doing weekend trips, or are willing to carry a bit of extra weight to save that money, they're fantastic. I bought one 10 years ago, that I still prefer for day hikes over a similar Osprey pack that I also have.",
                "score": 4,
                "created": 1698222507
              },
              {
                "author": "D3xlo",
                "body": "what are the arguments used around here that justify its bad reputation?",
                "score": 1,
                "created": 1698191156
              }
            ]
          },
          {
            "author": "AutoModerator",
            "body": "Please remember to post a short paragraph as a comment in the post explaining your photo or link. Ideally at least 150 characters with trip details. Tell us something about your trip. How long did it take to get there? How did you get there? How was the weather that day? Would you go back again? \n\nSubmitted content should be of high-quality. Low effort posting of very general information is not useful. If you don't add a short explanation in the comments, your post may be removed. \n\nNo information posted? Please report low-effort posts if there is still nothing after about 30 minutes.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/backpacking) if you have any questions or concerns.*",
            "score": 2,
            "created": 1698186880,
            "replies": []
          },
          {
            "author": "mopmop1234",
            "body": "Check back to see if you ended up buying the bag and liking it. I'm headed for 3 months backpacking in Thailand and considering this bag",
            "score": 1,
            "created": 1719332766,
            "replies": [
              {
                "author": "D3xlo",
                "body": "I finally bought the stratos 44L by Osprey, which I would recommend 100% for so many reasons. I saw the travel 900 in shop and the small backpack was too small, so if you need a day bag bigger than 6L you'll have to take your big one. For the secondary backpack I had the compact 20L one by forclaz, it takes such a small space in your bag, it's very light and easy to wash. \n\n44L was enough for me, I left for more than 3 months and I had 10-15L margin, it depends on how minimalist you can be. On top of that, i was still able to use my compact secondary backpack if i needed more space for a few transportations.\n\nLet me know if you need more infos ;)",
                "score": 2,
                "created": 1719593361
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/oj3z73jdcove1.jpeg?width=640&crop=smart&auto=webp&s=a07be50e817cefee64b81d2667a6102dad672c8c",
      "thread": {
        "title": "Thought I'd ask about backpacks from the best backpackers I know",
        "url": "https://www.reddit.com/r/USMC/comments/1k2i5rj/thought_id_ask_about_backpacks_from_the_best/?tl=th",
        "selftext": "I bought this here backpack - the Eagle Creek Global Companion, with a 65L capacity and a laptop compartment - back when it launched in like 2017. It's starting to fall apart now. The netting is torn a bit inside and outside, the waist buckle is broken. I think it's time to look for an upgrade.\n\nAny suggestions for a 50L+ laptop backpack that wouldn't give Staffy any consternations if I wore it in uniform while moving to and from the shop?",
        "author": "jhm-grose",
        "score": 5,
        "numComments": 15,
        "created": 1745017308,
        "comments": [
          {
            "author": "Sorta_jewy_with_it",
            "body": "I just discovered that this sub has its own emojis so enjoy some of this ![img](emote|t5_2qswv|7526)![img](emote|t5_2qswv|7526)![img](emote|t5_2qswv|7526)",
            "score": 18,
            "created": 1745020097,
            "replies": [
              {
                "author": "Illustrious_Ad_4939",
                "body": "![img](emote|t5_2qswv|7528)![img](emote|t5_2qswv|7529)![img](emote|t5_2qswv|7530)![img](emote|t5_2qswv|7531)![img](emote|t5_2qswv|7526)![img](emote|t5_2qswv|7527)![img](emote|t5_2qswv|7533)",
                "score": 4,
                "created": 1745037452
              }
            ]
          },
          {
            "author": "psyb3r0",
            "body": "https://preview.redd.it/l4c32fu2iove1.png?width=800&amp;format=png&amp;auto=webp&amp;s=0daf0d9fa4cb4d96d26a84c1e65482bb367f4ed6",
            "score": 12,
            "created": 1745019251,
            "replies": []
          },
          {
            "author": "idontknowmaybenot",
            "body": "Idk where you’re at, but if you’re close to an REI they have “garage sales” where they sell slightly used gear (usually from their rental department) for wayyyy less. Got a sick day pack, snowshoes, and a tent from there and have had them for years. ",
            "score": 5,
            "created": 1745021958,
            "replies": []
          },
          {
            "author": "Jodies-9-inch-leg",
            "body": "https://preview.redd.it/fgdj6gnqqove1.jpeg?width=748&amp;format=pjpg&amp;auto=webp&amp;s=1f59f92660498b098cb2d23f07871697128d22fb",
            "score": 5,
            "created": 1745022140,
            "replies": []
          },
          {
            "author": "surelythisisoriginal",
            "body": "I'm a big fan of Osprey because they have a dope warranty. The best advice I can give is buy something that fits well and feels good. Brand name don't mean nothing if it don't feel good.",
            "score": 3,
            "created": 1745031938,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/wy1kajanh7md1.png?width=320&crop=smart&auto=webp&s=d756ed875a3f3501a7cfd5b88b2619568871b173",
      "thread": {
        "title": "Mountain Smith Scream 55 @ $75 Opinions ",
        "url": "https://www.reddit.com/r/CampingandHiking/comments/1f6fg5t/mountain_smith_scream_55_75_opinions/",
        "selftext": "The waterproofing in my old REI Flash 65  is disintegrating and it's time for a new bag. I'm looking for something a little smaller and lighter. I'm looking at this thinking it's going to be a long time till I find a better bag for so cheap (5'10\" 155 lbs). Thoughts?\n\nhttps://www.rei.com/product/243110/mountainsmith-scream-55-pack?sku=2431100001",
        "author": "FredJonesPt1",
        "score": 5,
        "numComments": 4,
        "created": 1725200101,
        "comments": [
          {
            "author": "Wonderful_Tackle_579",
            "body": "I use MountainSmith lumbar packs and have gone through 3 since the late 90s ... Only upgraded, not because they were unusable.  I love their quality and thoughtful design.  When it's time for a new pack, they will be high on my list to consider.  $75 for their pack is a great deal",
            "score": 2,
            "created": 1725203890,
            "replies": []
          },
          {
            "author": "rexeditrex",
            "body": "I have a Mountainsmith tent and have no complaints.  I think they're a solid brand but don't know about their packs.",
            "score": 1,
            "created": 1725209388,
            "replies": []
          },
          {
            "author": "madefromtechnetium",
            "body": "I nearly bought the blue one, but have the lumbar pack and it's been solid for a few years. $75 seems a no brainer as long as it fits.\n\nI considered that before I bought my REI pack and can't remember why the REI won...",
            "score": 1,
            "created": 1725214667,
            "replies": []
          },
          {
            "author": "DumbHuskies",
            "body": "I have two of their camera packs, and outside of the functionality of how I like to pack my cameras, I have no complaints. They've lasted over seven years of abuse, and I'm not easy on my gear nor do I shy from taking it into tough enviornments.",
            "score": 1,
            "created": 1725264320,
            "replies": []
          }
        ]
      }
    }
  ]
}