{
  "name": "Heimplanet Transit Line Travel Pack",
  "imageThreads": [
    {
      "image": "https://preview.redd.it/stxpkjl3vem61.jpg?width=3648&format=pjpg&auto=webp&s=6089f6fd066b8d748023bee0ed2211f972594fef",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/lyhpxgl3vem61.jpg?width=5222&format=pjpg&auto=webp&s=a162adc102bb7ddc03e00789cb9cc3c5e28a1008",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/vnrid9l3vem61.jpg?width=5472&format=pjpg&auto=webp&s=e17d9139a5c405442c8590d2a04da22f36349def",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/w4nfkgl3vem61.jpg?width=3177&format=pjpg&auto=webp&s=fca6acf04ec711c198c32adcb9131ea372760b17",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/a55y8il3vem61.jpg?width=5472&format=pjpg&auto=webp&s=3cc5dda96d15f0f75b922bf8f0637422da37d46d",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/0skdjgl3vem61.jpg?width=5472&format=pjpg&auto=webp&s=24bd1ff927eaca7d5b755b826cf4b5cf887346e1",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/ci2bwkl3vem61.jpg?width=5472&format=pjpg&auto=webp&s=f6f87d52fbf0f9f692ba026ead433635ac4d24e5",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/zwf0gil3vem61.jpg?width=3648&format=pjpg&auto=webp&s=42301247eebfd7d7cf8d037a47e188f77c2deaa7",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/1y1lcfl3vem61.jpg?width=5472&format=pjpg&auto=webp&s=be71c84a361a609d2ab6814b9e585006bcecaa4e",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/jizsefl3vem61.jpg?width=5472&format=pjpg&auto=webp&s=8fd738aef043766c668cbc744661303ea7bd69dc",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/6uhqfgl3vem61.jpg?width=5472&format=pjpg&auto=webp&s=ea5558ef0c31542bfcf665bb90e47214a3bdcd2c",
      "thread": {
        "title": "REVIEW : HEIMPLANET TRANSIT LINE TRAVEL PACK 34L",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/m2rn6u/review_heimplanet_transit_line_travel_pack_34l/",
        "selftext": "",
        "author": "Truedots",
        "score": 117,
        "numComments": 20,
        "created": 1615473716,
        "comments": [
          {
            "author": "Truedots",
            "body": "Hey folks, below is my full review for Heimplanet Travel Pack 34L. You can check my blog for more pictures at [https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review](https://wanderingdots.me/blog/heimplanet-transit-line-travel-pack-34l-review)\n\nLet me know if you have any questions!\n\n&amp;#x200B;\n\n**FOREWORD**\n\n&amp;#x200B;\n\nBased in Hamburg, Germany, Heimplanet is a fascinating company. Founded over a decade ago, it pursued a simple goal: to improve your travel experience. The first product they launched was an innovative, futuristic-looking inflatable tent cleverly called The Cave. With time, the company diversified and created a rich and sophisticated product line ranging from apparel, to accessories and of course bags.\n\nToday I have one of the most popular and fine-tuned products Heimplanet has released to date, the Transit Line Travel Pack 34L backpack.\n\nHow does it fare against intense competition? Should you consider it as your trusty travel bag?\n\nRead on to find out.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT SUITS**\n\n&amp;#x200B;\n\n* Anyone looking for a well-built and smartly organized carry-on backpack would quickly grow to love the pragmatic yet efficient built-in organization of the Transit Line.\n\n&amp;#x200B;\n\n* Those who appreciate innovative materials that are also eco-friendly and sustainable.\n\n&amp;#x200B;\n\n* If you like easy packing, you will find the clamshell opening of the Transit Line to be perfect for both visibility and accessibility.\n\n&amp;#x200B;\n\n* People with a larger frame who like oversized EDC bags will find the Transit Line a very capable daily pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHO IT DOESN’T**\n\n&amp;#x200B;\n\n* The 34L version might look too big on people with smaller frames, luckily there is also a 28L version of the bag.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**ABOUT THE BAG**\n\n&amp;#x200B;\n\n\\* PRICE: 233 EUR (\\~$280)\n\n\\* DIMENSIONS: 53 x 34 x 19 cm (21 x 13 x 7 inch)\n\n\\* WEIGHT: 1,66 kg (3.4 lbs)\n\n\\* CAPACITY: 34L\n\n\\* COLOR OPTIONS: Castle Rock Grey, Black\n\n&amp;#x200B;\n\n**COMFORT**\n\n&amp;#x200B;\n\nI found the overall comfort of the bag to be excellent. The straps are wide and lightly padded, the included load lifters help distribute the weight better and the removable waist belt helps secure the bag on your body and further enhances the weight distribution.\n\n&amp;#x200B;\n\nThe back of the Travel Pack features a nicely designed foam that looks cool but does not offer much air channel for ventilation. The bag was tested during winter so a sweaty back was not an issue, but should be considered during warmer weather.\n\n&amp;#x200B;\n\nAlso, the pack has one of the best sternum strap designs on the market: an elastic part for improved breathability and a nice WooJin magnetic buckle for effortless use. A small but very appreciated detail is the sternum strap that has an elastic strap keeper to prevent dangling of excess fabric.\n\nThe Travel Pack hits a delicate balance between the number of features and the actual usefulness/usability of those. Surprisingly, the bag ticks almost all the boxes one could imagine for a perfect travel pack:\n\n&amp;#x200B;\n\nClamshell opening has become the most convenient way to pack the back and unsurprisingly the Travel Pack utilizes this design. \n\nA side handle for convenient brief-mode carry \n\nOne external water bottle has a nice stretchy fabric that can accommodate larger water bottles (32 OZ nalgene fit just fine) and is barely noticeable when empty.\n\nA quick access pocket on top of the bag with also a front flat pocket is everything I could possibly ask to store my most commonly used items without the need to go inside the bag.\n\nThe separation of the main capacity into 2 compartments: one for tech organization and the other as a clothes compartment .\n\nThe ability to roll away the internal divider, making the bag a single compartment bag, is very useful when you need to maximise the capacity of the bag and simplify the layout further",
            "score": 9,
            "created": 1615473897,
            "replies": [
              {
                "author": "Truedots",
                "body": "**MATERIALS &amp; ORGANIZATION** \n\n&amp;#x200B;\n\nThe materials are superb across the board. Heimplanet went an extra mile to create a special fabric in-house, named DYECOSHELL, which is also dope dyed. Such fabric allows to save water, CO2, energy and chemicals thanks to the special process of adding colorant to the polymer melt during spinning.  Not only extremely sustainable, but the fabric also has excellent water and abrasion resistant properties.\n\n&amp;#x200B;\n\nThe hardware is great too, industry leading YKK zippers and custom metal hardware help reinforce the confidence in the bag and its durability.\n\nThe organization is just right:\n\nExternally, there are two zipped pockets at your disposal and also a number of attachment points that can be utilized to secure things outside the bag. A single water bottle pocket gives the bag an interesting asymmetrical shape.\n\nInternal organization features a nicely padded and suspended 15 inch laptop compartment and a number of pockets and small compartments to stay organized. I was glad to see a conservative number of pockets inside since forgetting where I put what is a frustrating experience that I don’t recommend to anyone.\n\n&amp;#x200B;\n\n**ALTERNATIVES TO CONSIDER**\n\n&amp;#x200B;\n\nAble Carry Max [https://ablecarry.com/products/max?variant=32104084013169](https://ablecarry.com/products/max?variant=32104084013169) is similarly priced  ($260), yet slightly smaller at 30L capacity. The Max also features 2 compartments (separating your office and your clothes), clamshell opening and thoughtful organization. It does have a more technical look, while Heimplanet Travel Pack is more formal and business-friendly.\n\n&amp;#x200B;\n\nGoruck GR2 34L  [https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652](https://www.goruck.com/collections/gr2/products/gr2-usa?variant=32880107159652) at $375 (for US-made version) and noticeably heavier, the GR2 has an external access to laptop, velcro panel on top front for personalization and a very rugged build that invites you to abuse the bag and be amazed by how much beating it can take and still look new. GR2 (and most Goruck bags) are notorious for being stiff out of the box requiring a breaking in period to become comfortable to carry. \n\n&amp;#x200B;\n\nBellroy Transit Line 28L and 38L [https://bellroy.com/products/transit-backpack-plus/dura\\_nylon\\_recycled/black#slide-7](https://bellroy.com/products/transit-backpack-plus/dura_nylon_recycled/black#slide-7)  is an excellent alternative if you are looking for a more business-friendly travel bag. Cleaner lines, a bit more organization and signature Bellroy design is easy to fall for. Unlike the Heimplanet Travel Pack I would not recommend taking the Bellroy on a hike or abusing it much.\n\n&amp;#x200B;\n\nBoundary Supply Arris [https://www.boundarysupply.com/products/arris-pack](https://www.boundarysupply.com/products/arris-pack) at 35L this modular pack offers a very clean and unmistakably technical look with some bright color options. At $399 it’s definitely an investment but the modular accessories allow more flexibility and personalization compared to Heimplanet Travel Pack.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**WHAT’S HOT**\n\n* Excellent build and materials throughout\n* Balanced and useful built-in organization with enough external access and somewhat configurable internal organization\n* Sustainable, eco-friendly materials used in the bag are a testament to the continuous innovation of Heimplanet\n* Extremely weather resistant\n\n&amp;#x200B;\n\n**WHAT’S NOT**\n\n&amp;#x200B;\n\nHypalon attachment points are finicky (if you need to remove or adjust the sternum strap or the waist strap)\n\nThe slanted bottom of the pack means it won't stand by itself and will topple over. This can be rectified by hanging the back via carabiner or simply getting used to leaning it against the wall/furniture.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n**VERDICT**\n\n&amp;#x200B;\n\nThe Heimplanet Travel Pack is an excellent bag that can be used for short trips and even as a larger everyday carry solution.\n\n&amp;#x200B;\n\nWith smart thoughtful organization, sustainable materials, a durable build without looking technical the bag can be used for business trips and can hold its own in the outdoors. Striking such a delicate balance is no small feat and Heimplanet nailed it.\n\n&amp;#x200B;\n\nDespite some fierce competition and very interesting alternatives, the Heimplanet Travel Pack remains a strong offering for anyone who is in the market for a versatile and comfortable travel bag.",
                "score": 6,
                "created": 1615473937
              }
            ]
          },
          {
            "author": "pacefire",
            "body": "Absolutely love mine, perfect work/travel bag.",
            "score": 5,
            "created": 1615478195,
            "replies": [
              {
                "author": "Truedots",
                "body": "I agree! It’s an awesome bag!\nI will be letting it go for a killer price if anyone is interested. Normally I do not keep review units :)",
                "score": 6,
                "created": 1615480493
              }
            ]
          },
          {
            "author": "DetailedVenom",
            "body": "I know it's been a while since you posted this but I have a small question.\n\nWhat is the function of the internal divider? That is the only part of the bag that I cannot understand. It doesn't look like it provides any compression. Any items that are stored in it would have to be incredibly thin or get crushed, making it pretty much useless. And rolling it up just takes away valuable space at the bottom of the bag.\n\nWithout owning the bag I can't get a better understanding of it's functionality, would you be able to provide some insight?",
            "score": 3,
            "created": 1642690244,
            "replies": [
              {
                "author": "Truedots",
                "body": "The divider plays similar function as in Peak Design Travel bag - it creates a separation between the compartments so if you prefer to create an extra compartment to organize your stuff it’s there. Also it does not take much space when stored at the bottom. Let me know if you have any more questions !",
                "score": 2,
                "created": 1642690936
              }
            ]
          },
          {
            "author": "Emotional-Ad3521",
            "body": "Just received the Heimplanet 34L bag a few days ago and have tried a number of pack outs.  I have a 45L and a few 30L and under, so was looking for something in the middle.  Agree with review, super high quality.  I am a bigger guy, so could very easily be used for EDC.  \n\nI am looking forward to using it for 1-2 night trips for sure, but I am not the most minimalist packer.  \n\nSomething about the peak design doesn’t suit my eye as well.  For me, I am going to use the HP 34L for shorter trips and some EDC and my 45L for longer trips.  Good luck!",
            "score": 3,
            "created": 1654345244,
            "replies": [
              {
                "author": "OnebagObsession",
                "body": "How's the HP 34L ?  Have you packed it full out?",
                "score": 1,
                "created": 1727220798
              }
            ]
          },
          {
            "author": "sztruhar",
            "body": "Thank you for your thourough review.\r  \n\r  \nI am looking for a travel backpack for 2-5 days trips in summer (train, maybe airplane). Currently I have an eye at this Heimplanet and also the Peak Design 30L and 45L travel backpacks. In addition I have checked the bellroy transit backpack. I am absolutely torn in between these, I dont like the bellroy as much as the Peak Design and Heimplanet though (I am from the EU so no AER for me).\r  \n\r  \nDo you think this heimplanet 34 would be suitable for edc at the destination or is it simply too big for that. I am also thinking of packing a smaller packable backpack for daily use. Another alternative is that I could pick up the Peak design 30L (27L closed, 33 expanded) and when needed I would combine it with their duffel bag or when not needed use it as a edc at destination withou secondary bags.\r  \n\r  \nMy main aim is to have a universal backpack for shorter trips but also to be able to pack it for the maximum of 4-5 days approx.\r  \n\r  \nWhat are your thoughts, which would suit me the best ? Thanks a lot :)",
            "score": 2,
            "created": 1654006333,
            "replies": [
              {
                "author": "bbqsmokedduck",
                "body": "Hi, digging up this old thread, but am curious what you ended up going with since I have a very similar use case. Thanks!\n\nI am also deciding between PD 45L and Heimplanet 34L. I like the flexibility, expandability, and features of PD, but it is heavier and many have complained it is not that comfortable. The Heimplanet feels like 80% of the features with better straps and comfort.\n\nI also struggle with a smaller daypack at the destination. I cannot imagine using even the smaller versions for daily EDC. And I hate those minimal packable/folding ones. Something like the Aer Go Pack or Tom Bihn Daylight might suffice, but would obviously take up more space and weight in the travel bag.",
                "score": 1,
                "created": 1725400188
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/jt89w806o98d1.jpg?width=3024&format=pjpg&auto=webp&s=798251fe330afc3fac90a0fd3c6c1341d0476067",
      "thread": {
        "title": "3 weeks business travel with Heimplanet 34",
        "url": "https://www.reddit.com/r/onebag/comments/1dmg009/3_weeks_business_travel_with_heimplanet_34/",
        "selftext": "Caught the one bag bug with a 3 week holiday last year. Trying to to do the same this year for a business trip. I have a conference on the US east coast in July followed by two weeks of meetings in the same area and Canada. Looks like it’ll be warm in the US (~30c) and coolish in Canada (~20-24c). \n\nPlan is to take everything in a Heimplanet 34L transit. Current packing list is:\n\nWearing:\n- navy blue blazer/jacket\n- black Arcteryx jumper\n- black button up shirt\n- grey Kuhl trousers\n- merino socks\n- On running shoes (bulkiest shoe I’m taking - plan on running four days a week so wanted comfortable shoes)\n\nIn the big bag:\n- khaki Patagonia chinos\n- navy blue button up shirt\n- light blue button up shirt\n- navy Lululemon polo\n- dark grey Lululemon polo\n- grey tshirt\n- running shirt\n- running shorts \n- navy blue shorts\n- two pairs running/shorts socks\n- two pairs socks (merino)\n- four pairs underwear\n- black Vivobarefoot boots\n- beanie\n- cap\n\nToiletries:\n- toothbrush\n- toothpaste\n- floss\n- deodorant\n- razor\n- sunscreen/moisturiser\n\nElectronics\n- laptop (needed for work)\n- Supernote (meeting notes and ebooks on the flights)\n- phone \n- Bluetooth headphones\n- USB charger and cables\n\nI should be able to do laundry every five days and rotate these clothes to have a selection of outfits. Meetings/evenings will be business casual so shouldn’t need a suit. I can fit all of the above with a small amount of room for souvenirs in the backpack. With layering I should be good for the warmer and cooler climates. \n\nAppreciate feedback on anything obvious I’ve missed or anything that might not be needed. \n\n",
        "author": "Odd-Guitar-7836",
        "score": 75,
        "numComments": 29,
        "created": 1719124640,
        "comments": [
          {
            "author": "akavth",
            "body": "Very cool. I think you and I are in two very different businesses!",
            "score": 13,
            "created": 1719147228,
            "replies": [
              {
                "author": "Odd-Guitar-7836",
                "body": "It’s nice not needing to suit up and getting away with smart casual most of the time.",
                "score": 1,
                "created": 1719224301
              }
            ]
          },
          {
            "author": "commentspanda",
            "body": "My only comment is that I think you only have two pairs of pants and presumably they are both for work. Would you want something to be social in? Or do you consider the chinos sufficient for that? Or is that what the navy blue shorts are for? \n\nMy hubby would take two pairs of “work pants” to rotate plus “social pants” like a pair of jeans. Then the running shorts for exercise.",
            "score": 5,
            "created": 1719147153,
            "replies": [
              {
                "author": "Odd-Guitar-7836",
                "body": "I usually wear chinos at work and play at home so feel comfortable rotating them for both situations. I was uncertain on the shorts - only included them for day’s off in hot weather. May follow your advice and drop them for a light pair of pants for extra versatility.",
                "score": 1,
                "created": 1719223421
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1719145062,
            "replies": [
              {
                "author": "halzen",
                "body": "Looks like a Kathmandu Classic Clear Cell and a Cotopaxi Cubos.",
                "score": 2,
                "created": 1719149990
              }
            ]
          },
          {
            "author": "Odd-Guitar-7836",
            "body": "Context comment: 3 week one bag business trip. Looking for advice to refine packing list so as not to miss anything important/take anything unnecessary.",
            "score": 3,
            "created": 1719128341,
            "replies": []
          },
          {
            "author": "Ok_Independent_943",
            "body": "What part of Canada are you going to?  Because if it’s in Ontario, it will be hotter than 20 in July.",
            "score": 3,
            "created": 1719155154,
            "replies": [
              {
                "author": "alibythesea",
                "body": "I’m in Halifax, Nova Scotia, and you can’t trust the old average temperature ranges. We just got out of the heat dome, and it was 37C on my back deck just a few days ago. Records were falling like drunk raccoons. \n\nIn July we now often hit the 25-30C range.",
                "score": 2,
                "created": 1719204177
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/x20av606o98d1.jpg?width=2938&format=pjpg&auto=webp&s=5141f8155793b32398a00e9de12ddc13a6d91c67",
      "thread": {
        "title": "3 weeks business travel with Heimplanet 34",
        "url": "https://www.reddit.com/r/onebag/comments/1dmg009/3_weeks_business_travel_with_heimplanet_34/",
        "selftext": "Caught the one bag bug with a 3 week holiday last year. Trying to to do the same this year for a business trip. I have a conference on the US east coast in July followed by two weeks of meetings in the same area and Canada. Looks like it’ll be warm in the US (~30c) and coolish in Canada (~20-24c). \n\nPlan is to take everything in a Heimplanet 34L transit. Current packing list is:\n\nWearing:\n- navy blue blazer/jacket\n- black Arcteryx jumper\n- black button up shirt\n- grey Kuhl trousers\n- merino socks\n- On running shoes (bulkiest shoe I’m taking - plan on running four days a week so wanted comfortable shoes)\n\nIn the big bag:\n- khaki Patagonia chinos\n- navy blue button up shirt\n- light blue button up shirt\n- navy Lululemon polo\n- dark grey Lululemon polo\n- grey tshirt\n- running shirt\n- running shorts \n- navy blue shorts\n- two pairs running/shorts socks\n- two pairs socks (merino)\n- four pairs underwear\n- black Vivobarefoot boots\n- beanie\n- cap\n\nToiletries:\n- toothbrush\n- toothpaste\n- floss\n- deodorant\n- razor\n- sunscreen/moisturiser\n\nElectronics\n- laptop (needed for work)\n- Supernote (meeting notes and ebooks on the flights)\n- phone \n- Bluetooth headphones\n- USB charger and cables\n\nI should be able to do laundry every five days and rotate these clothes to have a selection of outfits. Meetings/evenings will be business casual so shouldn’t need a suit. I can fit all of the above with a small amount of room for souvenirs in the backpack. With layering I should be good for the warmer and cooler climates. \n\nAppreciate feedback on anything obvious I’ve missed or anything that might not be needed. \n\n",
        "author": "Odd-Guitar-7836",
        "score": 75,
        "numComments": 29,
        "created": 1719124640,
        "comments": [
          {
            "author": "akavth",
            "body": "Very cool. I think you and I are in two very different businesses!",
            "score": 13,
            "created": 1719147228,
            "replies": [
              {
                "author": "Odd-Guitar-7836",
                "body": "It’s nice not needing to suit up and getting away with smart casual most of the time.",
                "score": 1,
                "created": 1719224301
              }
            ]
          },
          {
            "author": "commentspanda",
            "body": "My only comment is that I think you only have two pairs of pants and presumably they are both for work. Would you want something to be social in? Or do you consider the chinos sufficient for that? Or is that what the navy blue shorts are for? \n\nMy hubby would take two pairs of “work pants” to rotate plus “social pants” like a pair of jeans. Then the running shorts for exercise.",
            "score": 5,
            "created": 1719147153,
            "replies": [
              {
                "author": "Odd-Guitar-7836",
                "body": "I usually wear chinos at work and play at home so feel comfortable rotating them for both situations. I was uncertain on the shorts - only included them for day’s off in hot weather. May follow your advice and drop them for a light pair of pants for extra versatility.",
                "score": 1,
                "created": 1719223421
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1719145062,
            "replies": [
              {
                "author": "halzen",
                "body": "Looks like a Kathmandu Classic Clear Cell and a Cotopaxi Cubos.",
                "score": 2,
                "created": 1719149990
              }
            ]
          },
          {
            "author": "Odd-Guitar-7836",
            "body": "Context comment: 3 week one bag business trip. Looking for advice to refine packing list so as not to miss anything important/take anything unnecessary.",
            "score": 3,
            "created": 1719128341,
            "replies": []
          },
          {
            "author": "Ok_Independent_943",
            "body": "What part of Canada are you going to?  Because if it’s in Ontario, it will be hotter than 20 in July.",
            "score": 3,
            "created": 1719155154,
            "replies": [
              {
                "author": "alibythesea",
                "body": "I’m in Halifax, Nova Scotia, and you can’t trust the old average temperature ranges. We just got out of the heat dome, and it was 37C on my back deck just a few days ago. Records were falling like drunk raccoons. \n\nIn July we now often hit the 25-30C range.",
                "score": 2,
                "created": 1719204177
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/72w5i706o98d1.jpg?width=3398&format=pjpg&auto=webp&s=90bf5ef0ae917555f42e7ccbaaa3bcd0b418a920",
      "thread": {
        "title": "3 weeks business travel with Heimplanet 34",
        "url": "https://www.reddit.com/r/onebag/comments/1dmg009/3_weeks_business_travel_with_heimplanet_34/",
        "selftext": "Caught the one bag bug with a 3 week holiday last year. Trying to to do the same this year for a business trip. I have a conference on the US east coast in July followed by two weeks of meetings in the same area and Canada. Looks like it’ll be warm in the US (~30c) and coolish in Canada (~20-24c). \n\nPlan is to take everything in a Heimplanet 34L transit. Current packing list is:\n\nWearing:\n- navy blue blazer/jacket\n- black Arcteryx jumper\n- black button up shirt\n- grey Kuhl trousers\n- merino socks\n- On running shoes (bulkiest shoe I’m taking - plan on running four days a week so wanted comfortable shoes)\n\nIn the big bag:\n- khaki Patagonia chinos\n- navy blue button up shirt\n- light blue button up shirt\n- navy Lululemon polo\n- dark grey Lululemon polo\n- grey tshirt\n- running shirt\n- running shorts \n- navy blue shorts\n- two pairs running/shorts socks\n- two pairs socks (merino)\n- four pairs underwear\n- black Vivobarefoot boots\n- beanie\n- cap\n\nToiletries:\n- toothbrush\n- toothpaste\n- floss\n- deodorant\n- razor\n- sunscreen/moisturiser\n\nElectronics\n- laptop (needed for work)\n- Supernote (meeting notes and ebooks on the flights)\n- phone \n- Bluetooth headphones\n- USB charger and cables\n\nI should be able to do laundry every five days and rotate these clothes to have a selection of outfits. Meetings/evenings will be business casual so shouldn’t need a suit. I can fit all of the above with a small amount of room for souvenirs in the backpack. With layering I should be good for the warmer and cooler climates. \n\nAppreciate feedback on anything obvious I’ve missed or anything that might not be needed. \n\n",
        "author": "Odd-Guitar-7836",
        "score": 75,
        "numComments": 29,
        "created": 1719124640,
        "comments": [
          {
            "author": "akavth",
            "body": "Very cool. I think you and I are in two very different businesses!",
            "score": 13,
            "created": 1719147228,
            "replies": [
              {
                "author": "Odd-Guitar-7836",
                "body": "It’s nice not needing to suit up and getting away with smart casual most of the time.",
                "score": 1,
                "created": 1719224301
              }
            ]
          },
          {
            "author": "commentspanda",
            "body": "My only comment is that I think you only have two pairs of pants and presumably they are both for work. Would you want something to be social in? Or do you consider the chinos sufficient for that? Or is that what the navy blue shorts are for? \n\nMy hubby would take two pairs of “work pants” to rotate plus “social pants” like a pair of jeans. Then the running shorts for exercise.",
            "score": 5,
            "created": 1719147153,
            "replies": [
              {
                "author": "Odd-Guitar-7836",
                "body": "I usually wear chinos at work and play at home so feel comfortable rotating them for both situations. I was uncertain on the shorts - only included them for day’s off in hot weather. May follow your advice and drop them for a light pair of pants for extra versatility.",
                "score": 1,
                "created": 1719223421
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1719145062,
            "replies": [
              {
                "author": "halzen",
                "body": "Looks like a Kathmandu Classic Clear Cell and a Cotopaxi Cubos.",
                "score": 2,
                "created": 1719149990
              }
            ]
          },
          {
            "author": "Odd-Guitar-7836",
            "body": "Context comment: 3 week one bag business trip. Looking for advice to refine packing list so as not to miss anything important/take anything unnecessary.",
            "score": 3,
            "created": 1719128341,
            "replies": []
          },
          {
            "author": "Ok_Independent_943",
            "body": "What part of Canada are you going to?  Because if it’s in Ontario, it will be hotter than 20 in July.",
            "score": 3,
            "created": 1719155154,
            "replies": [
              {
                "author": "alibythesea",
                "body": "I’m in Halifax, Nova Scotia, and you can’t trust the old average temperature ranges. We just got out of the heat dome, and it was 37C on my back deck just a few days ago. Records were falling like drunk raccoons. \n\nIn July we now often hit the 25-30C range.",
                "score": 2,
                "created": 1719204177
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/qb93ye06o98d1.jpg?width=2544&format=pjpg&auto=webp&s=45374a87d5de6f44b3221d847705ac5c4b6c62e2",
      "thread": {
        "title": "3 weeks business travel with Heimplanet 34",
        "url": "https://www.reddit.com/r/onebag/comments/1dmg009/3_weeks_business_travel_with_heimplanet_34/",
        "selftext": "Caught the one bag bug with a 3 week holiday last year. Trying to to do the same this year for a business trip. I have a conference on the US east coast in July followed by two weeks of meetings in the same area and Canada. Looks like it’ll be warm in the US (~30c) and coolish in Canada (~20-24c). \n\nPlan is to take everything in a Heimplanet 34L transit. Current packing list is:\n\nWearing:\n- navy blue blazer/jacket\n- black Arcteryx jumper\n- black button up shirt\n- grey Kuhl trousers\n- merino socks\n- On running shoes (bulkiest shoe I’m taking - plan on running four days a week so wanted comfortable shoes)\n\nIn the big bag:\n- khaki Patagonia chinos\n- navy blue button up shirt\n- light blue button up shirt\n- navy Lululemon polo\n- dark grey Lululemon polo\n- grey tshirt\n- running shirt\n- running shorts \n- navy blue shorts\n- two pairs running/shorts socks\n- two pairs socks (merino)\n- four pairs underwear\n- black Vivobarefoot boots\n- beanie\n- cap\n\nToiletries:\n- toothbrush\n- toothpaste\n- floss\n- deodorant\n- razor\n- sunscreen/moisturiser\n\nElectronics\n- laptop (needed for work)\n- Supernote (meeting notes and ebooks on the flights)\n- phone \n- Bluetooth headphones\n- USB charger and cables\n\nI should be able to do laundry every five days and rotate these clothes to have a selection of outfits. Meetings/evenings will be business casual so shouldn’t need a suit. I can fit all of the above with a small amount of room for souvenirs in the backpack. With layering I should be good for the warmer and cooler climates. \n\nAppreciate feedback on anything obvious I’ve missed or anything that might not be needed. \n\n",
        "author": "Odd-Guitar-7836",
        "score": 75,
        "numComments": 29,
        "created": 1719124640,
        "comments": [
          {
            "author": "akavth",
            "body": "Very cool. I think you and I are in two very different businesses!",
            "score": 13,
            "created": 1719147228,
            "replies": [
              {
                "author": "Odd-Guitar-7836",
                "body": "It’s nice not needing to suit up and getting away with smart casual most of the time.",
                "score": 1,
                "created": 1719224301
              }
            ]
          },
          {
            "author": "commentspanda",
            "body": "My only comment is that I think you only have two pairs of pants and presumably they are both for work. Would you want something to be social in? Or do you consider the chinos sufficient for that? Or is that what the navy blue shorts are for? \n\nMy hubby would take two pairs of “work pants” to rotate plus “social pants” like a pair of jeans. Then the running shorts for exercise.",
            "score": 5,
            "created": 1719147153,
            "replies": [
              {
                "author": "Odd-Guitar-7836",
                "body": "I usually wear chinos at work and play at home so feel comfortable rotating them for both situations. I was uncertain on the shorts - only included them for day’s off in hot weather. May follow your advice and drop them for a light pair of pants for extra versatility.",
                "score": 1,
                "created": 1719223421
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 5,
            "created": 1719145062,
            "replies": [
              {
                "author": "halzen",
                "body": "Looks like a Kathmandu Classic Clear Cell and a Cotopaxi Cubos.",
                "score": 2,
                "created": 1719149990
              }
            ]
          },
          {
            "author": "Odd-Guitar-7836",
            "body": "Context comment: 3 week one bag business trip. Looking for advice to refine packing list so as not to miss anything important/take anything unnecessary.",
            "score": 3,
            "created": 1719128341,
            "replies": []
          },
          {
            "author": "Ok_Independent_943",
            "body": "What part of Canada are you going to?  Because if it’s in Ontario, it will be hotter than 20 in July.",
            "score": 3,
            "created": 1719155154,
            "replies": [
              {
                "author": "alibythesea",
                "body": "I’m in Halifax, Nova Scotia, and you can’t trust the old average temperature ranges. We just got out of the heat dome, and it was 37C on my back deck just a few days ago. Records were falling like drunk raccoons. \n\nIn July we now often hit the 25-30C range.",
                "score": 2,
                "created": 1719204177
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/69u63b3aogyc1.jpg?width=3024&format=pjpg&auto=webp&s=ebaa4e819680447b32256a5f732c2cc8eecdb29d",
      "thread": {
        "title": "HEIMPLANET Transit Line Sling Pocket.",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1ck8cxx/heimplanet_transit_line_sling_pocket/",
        "selftext": "So I purchased the Heimplanet Transit Line Sling Pocket straight from Heimplanet as I wanted the black and Amazon only had the castle rock colour. \n\nAfter owning the the Herschel Fourteen Sling I wanted something bigger and nicer , did a lot of research on all the sling bags and ended up buying the Tomtoc Explorer 4L T21 very nice bag but it was too big to daily for me personally. \n\nSo I ended up with the Heimplanet Transit Line Sling Pocket , and this thing perfect size wise , it’s really nice quality! , love the organization in the main pocket and I love the straps are removable plan on ordering some ATD or Dsptch straps which have fidlock releases. \n\nMy only nitpicks with this bag are \n\n1. The logo on the front is kinda cheap and don’t see it looking nice after some wear and tear. \n\n2. The front Pocket was advertised as scratch free but after inspecting it I’m not sure I’d trust putting designer glasses in it as it feels like it might leave scratches. \n\nThis bag will def be my daily bag for a long time!",
        "author": "Qu1ckset",
        "score": 10,
        "numComments": 5,
        "created": 1714850945,
        "comments": [
          {
            "author": "Crazeeeyez",
            "body": "Thanks for the inside pics!  Looks like a pretty nice sling. Is that your usual carry?",
            "score": 1,
            "created": 1714855620,
            "replies": [
              {
                "author": "Qu1ckset",
                "body": " Most of it , sometimes maybe a knife , phone and or retro console handheld added as well.",
                "score": 1,
                "created": 1714859845
              }
            ]
          },
          {
            "author": "burgiebeer",
            "body": "I love my Transit 28L backpack. I’ve been thinking about the sling. Thanks for the writeup",
            "score": 1,
            "created": 1714876773,
            "replies": []
          },
          {
            "author": "therealgumster",
            "body": "Yes, with that label I think I’d be returning it; I do not like serving as a company billboard!",
            "score": 0,
            "created": 1714869768,
            "replies": [
              {
                "author": "Rainlex",
                "body": "*except it's a Apple product, I guess.",
                "score": 1,
                "created": 1729448471
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/3qc5ca3aogyc1.jpg?width=3024&format=pjpg&auto=webp&s=94b2a25d10a42c6eb118dd00b67765f7a0cd0742",
      "thread": {
        "title": "HEIMPLANET Transit Line Sling Pocket.",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1ck8cxx/heimplanet_transit_line_sling_pocket/",
        "selftext": "So I purchased the Heimplanet Transit Line Sling Pocket straight from Heimplanet as I wanted the black and Amazon only had the castle rock colour. \n\nAfter owning the the Herschel Fourteen Sling I wanted something bigger and nicer , did a lot of research on all the sling bags and ended up buying the Tomtoc Explorer 4L T21 very nice bag but it was too big to daily for me personally. \n\nSo I ended up with the Heimplanet Transit Line Sling Pocket , and this thing perfect size wise , it’s really nice quality! , love the organization in the main pocket and I love the straps are removable plan on ordering some ATD or Dsptch straps which have fidlock releases. \n\nMy only nitpicks with this bag are \n\n1. The logo on the front is kinda cheap and don’t see it looking nice after some wear and tear. \n\n2. The front Pocket was advertised as scratch free but after inspecting it I’m not sure I’d trust putting designer glasses in it as it feels like it might leave scratches. \n\nThis bag will def be my daily bag for a long time!",
        "author": "Qu1ckset",
        "score": 10,
        "numComments": 5,
        "created": 1714850945,
        "comments": [
          {
            "author": "Crazeeeyez",
            "body": "Thanks for the inside pics!  Looks like a pretty nice sling. Is that your usual carry?",
            "score": 1,
            "created": 1714855620,
            "replies": [
              {
                "author": "Qu1ckset",
                "body": " Most of it , sometimes maybe a knife , phone and or retro console handheld added as well.",
                "score": 1,
                "created": 1714859845
              }
            ]
          },
          {
            "author": "burgiebeer",
            "body": "I love my Transit 28L backpack. I’ve been thinking about the sling. Thanks for the writeup",
            "score": 1,
            "created": 1714876773,
            "replies": []
          },
          {
            "author": "therealgumster",
            "body": "Yes, with that label I think I’d be returning it; I do not like serving as a company billboard!",
            "score": 0,
            "created": 1714869768,
            "replies": [
              {
                "author": "Rainlex",
                "body": "*except it's a Apple product, I guess.",
                "score": 1,
                "created": 1729448471
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/nbtvoa3aogyc1.jpg?width=3024&format=pjpg&auto=webp&s=4547595fde0f4facbaceff81f8d1137df9012f39",
      "thread": {
        "title": "HEIMPLANET Transit Line Sling Pocket.",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1ck8cxx/heimplanet_transit_line_sling_pocket/",
        "selftext": "So I purchased the Heimplanet Transit Line Sling Pocket straight from Heimplanet as I wanted the black and Amazon only had the castle rock colour. \n\nAfter owning the the Herschel Fourteen Sling I wanted something bigger and nicer , did a lot of research on all the sling bags and ended up buying the Tomtoc Explorer 4L T21 very nice bag but it was too big to daily for me personally. \n\nSo I ended up with the Heimplanet Transit Line Sling Pocket , and this thing perfect size wise , it’s really nice quality! , love the organization in the main pocket and I love the straps are removable plan on ordering some ATD or Dsptch straps which have fidlock releases. \n\nMy only nitpicks with this bag are \n\n1. The logo on the front is kinda cheap and don’t see it looking nice after some wear and tear. \n\n2. The front Pocket was advertised as scratch free but after inspecting it I’m not sure I’d trust putting designer glasses in it as it feels like it might leave scratches. \n\nThis bag will def be my daily bag for a long time!",
        "author": "Qu1ckset",
        "score": 10,
        "numComments": 5,
        "created": 1714850945,
        "comments": [
          {
            "author": "Crazeeeyez",
            "body": "Thanks for the inside pics!  Looks like a pretty nice sling. Is that your usual carry?",
            "score": 1,
            "created": 1714855620,
            "replies": [
              {
                "author": "Qu1ckset",
                "body": " Most of it , sometimes maybe a knife , phone and or retro console handheld added as well.",
                "score": 1,
                "created": 1714859845
              }
            ]
          },
          {
            "author": "burgiebeer",
            "body": "I love my Transit 28L backpack. I’ve been thinking about the sling. Thanks for the writeup",
            "score": 1,
            "created": 1714876773,
            "replies": []
          },
          {
            "author": "therealgumster",
            "body": "Yes, with that label I think I’d be returning it; I do not like serving as a company billboard!",
            "score": 0,
            "created": 1714869768,
            "replies": [
              {
                "author": "Rainlex",
                "body": "*except it's a Apple product, I guess.",
                "score": 1,
                "created": 1729448471
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/54a5ga3aogyc1.jpg?width=4032&format=pjpg&auto=webp&s=384ded6524ec74c3ecd013f2f236c2d65b49267f",
      "thread": {
        "title": "HEIMPLANET Transit Line Sling Pocket.",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1ck8cxx/heimplanet_transit_line_sling_pocket/",
        "selftext": "So I purchased the Heimplanet Transit Line Sling Pocket straight from Heimplanet as I wanted the black and Amazon only had the castle rock colour. \n\nAfter owning the the Herschel Fourteen Sling I wanted something bigger and nicer , did a lot of research on all the sling bags and ended up buying the Tomtoc Explorer 4L T21 very nice bag but it was too big to daily for me personally. \n\nSo I ended up with the Heimplanet Transit Line Sling Pocket , and this thing perfect size wise , it’s really nice quality! , love the organization in the main pocket and I love the straps are removable plan on ordering some ATD or Dsptch straps which have fidlock releases. \n\nMy only nitpicks with this bag are \n\n1. The logo on the front is kinda cheap and don’t see it looking nice after some wear and tear. \n\n2. The front Pocket was advertised as scratch free but after inspecting it I’m not sure I’d trust putting designer glasses in it as it feels like it might leave scratches. \n\nThis bag will def be my daily bag for a long time!",
        "author": "Qu1ckset",
        "score": 10,
        "numComments": 5,
        "created": 1714850945,
        "comments": [
          {
            "author": "Crazeeeyez",
            "body": "Thanks for the inside pics!  Looks like a pretty nice sling. Is that your usual carry?",
            "score": 1,
            "created": 1714855620,
            "replies": [
              {
                "author": "Qu1ckset",
                "body": " Most of it , sometimes maybe a knife , phone and or retro console handheld added as well.",
                "score": 1,
                "created": 1714859845
              }
            ]
          },
          {
            "author": "burgiebeer",
            "body": "I love my Transit 28L backpack. I’ve been thinking about the sling. Thanks for the writeup",
            "score": 1,
            "created": 1714876773,
            "replies": []
          },
          {
            "author": "therealgumster",
            "body": "Yes, with that label I think I’d be returning it; I do not like serving as a company billboard!",
            "score": 0,
            "created": 1714869768,
            "replies": [
              {
                "author": "Rainlex",
                "body": "*except it's a Apple product, I guess.",
                "score": 1,
                "created": 1729448471
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/m4tsn4waka461.jpg?width=4032&format=pjpg&auto=webp&s=bd1f935d64b241706b573e3372d6a8999bbc23e6",
      "thread": {
        "title": "Transits? Heimplanet vs Bellroy 28L showdown",
        "url": "https://www.reddit.com/r/onebag/comments/ka8ymk/transits_heimplanet_vs_bellroy_28l_showdown/",
        "selftext": "",
        "author": "BandaBassotti",
        "score": 20,
        "numComments": 32,
        "created": 1607576344,
        "comments": [
          {
            "author": "[deleted]",
            "body": "[removed]",
            "score": 6,
            "created": 1608001106,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "Yeah man.  I just sold the Bellroy and am already regretting it.  Oh well, onto the next one...",
                "score": 2,
                "created": 1608002810
              }
            ]
          },
          {
            "author": "BandaBassotti",
            "body": "So, after owning the Bellroy (but not traveling this year) the itch for a new bag got to me and I picked up the Heimplanet Transit 28L.  \n\nI liked the 34L version of this bag last year, but never pulled the trigger.  Now I wonder if I should have.  \n\nThe Bellroy has been discussed at length.  It’s a very well thought out backpack with only a few nitpicks.  The best of it for me is that even at 28L, it feels like I could use it as a one bag in a pinch.  The cavernous inside space allows great organization with packing cubes, and most of the other pockets and storage are well thought out, if extremely simple.  \n\nThe Heimplanet is a reverse clamshell.  The back opening is awesome and super well organized with the right pockets and space for laptop and tablet.  However, it sure feels small for the 28L it claims.  Part of that is the interior main space and the way it opens up. \n\nThe front pockets are well organized, but intrude in the main area space when full.  Also, you don’t have the small cellphone pocket that is at the top of the Bellroy. \n\nUltimately, I like the Heimplanet, and could use it as an EDC with limited extended travel. I can see putting my Dopp kit, one medium packing cube and my electronics in there.   I don’t think you could carry an extra set of shoes in there. Likely one change of clothes and a small pocket camera.",
            "score": 3,
            "created": 1607576903,
            "replies": [
              {
                "author": "Teleporter55",
                "body": "Which do you prefer for daily functions?",
                "score": 1,
                "created": 1607612305
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "I have the 34L Transit Line Travel pack from their kickstarter campaign. And I love it one of the best bags I have in fact, especially when I was able to get it onboard a flight as a \"personal item\".\n\nThe coolest feature for me is the internal divider can be rolled down and stored in the pocket at the bottom, effectively making it one massive compartment. Unsure if this feature is in the 28L version.",
            "score": 3,
            "created": 1607644208,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "It isn’t.  I just ordered the 34L for that reason",
                "score": 3,
                "created": 1607645427
              }
            ]
          },
          {
            "author": "qw3po",
            "body": "Have you seen the new Bellroy Transit Workpack? What are your thoughts about it relative to the 28L and the Heimplanet?",
            "score": 2,
            "created": 1607836495,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "Looking at it, I think I’d keep the 28L Heimplanet as I think it can double as a smaller travel bag and EDC, while that work pack won’t be able to.",
                "score": 2,
                "created": 1607838838
              }
            ]
          },
          {
            "author": "CharsiCuba",
            "body": "I’m currently trying to decide between the two. How much bigger is the bellroy compared to the heimplanet? Is it a noticeable difference?",
            "score": 2,
            "created": 1685062072,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "The Bellroy will hold a lot more due to the lack of compartments inside. I’m terms of outer dimensions they’re pretty close",
                "score": 1,
                "created": 1685062909
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/va5s74waka461.jpg?width=3024&format=pjpg&auto=webp&s=e07ef46b57b7757dfe677699ba5827d728b1b93d",
      "thread": {
        "title": "Transits? Heimplanet vs Bellroy 28L showdown",
        "url": "https://www.reddit.com/r/onebag/comments/ka8ymk/transits_heimplanet_vs_bellroy_28l_showdown/",
        "selftext": "",
        "author": "BandaBassotti",
        "score": 20,
        "numComments": 32,
        "created": 1607576344,
        "comments": [
          {
            "author": "[deleted]",
            "body": "[removed]",
            "score": 6,
            "created": 1608001106,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "Yeah man.  I just sold the Bellroy and am already regretting it.  Oh well, onto the next one...",
                "score": 2,
                "created": 1608002810
              }
            ]
          },
          {
            "author": "BandaBassotti",
            "body": "So, after owning the Bellroy (but not traveling this year) the itch for a new bag got to me and I picked up the Heimplanet Transit 28L.  \n\nI liked the 34L version of this bag last year, but never pulled the trigger.  Now I wonder if I should have.  \n\nThe Bellroy has been discussed at length.  It’s a very well thought out backpack with only a few nitpicks.  The best of it for me is that even at 28L, it feels like I could use it as a one bag in a pinch.  The cavernous inside space allows great organization with packing cubes, and most of the other pockets and storage are well thought out, if extremely simple.  \n\nThe Heimplanet is a reverse clamshell.  The back opening is awesome and super well organized with the right pockets and space for laptop and tablet.  However, it sure feels small for the 28L it claims.  Part of that is the interior main space and the way it opens up. \n\nThe front pockets are well organized, but intrude in the main area space when full.  Also, you don’t have the small cellphone pocket that is at the top of the Bellroy. \n\nUltimately, I like the Heimplanet, and could use it as an EDC with limited extended travel. I can see putting my Dopp kit, one medium packing cube and my electronics in there.   I don’t think you could carry an extra set of shoes in there. Likely one change of clothes and a small pocket camera.",
            "score": 3,
            "created": 1607576903,
            "replies": [
              {
                "author": "Teleporter55",
                "body": "Which do you prefer for daily functions?",
                "score": 1,
                "created": 1607612305
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "I have the 34L Transit Line Travel pack from their kickstarter campaign. And I love it one of the best bags I have in fact, especially when I was able to get it onboard a flight as a \"personal item\".\n\nThe coolest feature for me is the internal divider can be rolled down and stored in the pocket at the bottom, effectively making it one massive compartment. Unsure if this feature is in the 28L version.",
            "score": 3,
            "created": 1607644208,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "It isn’t.  I just ordered the 34L for that reason",
                "score": 3,
                "created": 1607645427
              }
            ]
          },
          {
            "author": "qw3po",
            "body": "Have you seen the new Bellroy Transit Workpack? What are your thoughts about it relative to the 28L and the Heimplanet?",
            "score": 2,
            "created": 1607836495,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "Looking at it, I think I’d keep the 28L Heimplanet as I think it can double as a smaller travel bag and EDC, while that work pack won’t be able to.",
                "score": 2,
                "created": 1607838838
              }
            ]
          },
          {
            "author": "CharsiCuba",
            "body": "I’m currently trying to decide between the two. How much bigger is the bellroy compared to the heimplanet? Is it a noticeable difference?",
            "score": 2,
            "created": 1685062072,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "The Bellroy will hold a lot more due to the lack of compartments inside. I’m terms of outer dimensions they’re pretty close",
                "score": 1,
                "created": 1685062909
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/n5fpe4waka461.jpg?width=4032&format=pjpg&auto=webp&s=8aee09c3d752de97a5a973d5829ffd60cf99b61e",
      "thread": {
        "title": "Transits? Heimplanet vs Bellroy 28L showdown",
        "url": "https://www.reddit.com/r/onebag/comments/ka8ymk/transits_heimplanet_vs_bellroy_28l_showdown/",
        "selftext": "",
        "author": "BandaBassotti",
        "score": 20,
        "numComments": 32,
        "created": 1607576344,
        "comments": [
          {
            "author": "[deleted]",
            "body": "[removed]",
            "score": 6,
            "created": 1608001106,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "Yeah man.  I just sold the Bellroy and am already regretting it.  Oh well, onto the next one...",
                "score": 2,
                "created": 1608002810
              }
            ]
          },
          {
            "author": "BandaBassotti",
            "body": "So, after owning the Bellroy (but not traveling this year) the itch for a new bag got to me and I picked up the Heimplanet Transit 28L.  \n\nI liked the 34L version of this bag last year, but never pulled the trigger.  Now I wonder if I should have.  \n\nThe Bellroy has been discussed at length.  It’s a very well thought out backpack with only a few nitpicks.  The best of it for me is that even at 28L, it feels like I could use it as a one bag in a pinch.  The cavernous inside space allows great organization with packing cubes, and most of the other pockets and storage are well thought out, if extremely simple.  \n\nThe Heimplanet is a reverse clamshell.  The back opening is awesome and super well organized with the right pockets and space for laptop and tablet.  However, it sure feels small for the 28L it claims.  Part of that is the interior main space and the way it opens up. \n\nThe front pockets are well organized, but intrude in the main area space when full.  Also, you don’t have the small cellphone pocket that is at the top of the Bellroy. \n\nUltimately, I like the Heimplanet, and could use it as an EDC with limited extended travel. I can see putting my Dopp kit, one medium packing cube and my electronics in there.   I don’t think you could carry an extra set of shoes in there. Likely one change of clothes and a small pocket camera.",
            "score": 3,
            "created": 1607576903,
            "replies": [
              {
                "author": "Teleporter55",
                "body": "Which do you prefer for daily functions?",
                "score": 1,
                "created": 1607612305
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "I have the 34L Transit Line Travel pack from their kickstarter campaign. And I love it one of the best bags I have in fact, especially when I was able to get it onboard a flight as a \"personal item\".\n\nThe coolest feature for me is the internal divider can be rolled down and stored in the pocket at the bottom, effectively making it one massive compartment. Unsure if this feature is in the 28L version.",
            "score": 3,
            "created": 1607644208,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "It isn’t.  I just ordered the 34L for that reason",
                "score": 3,
                "created": 1607645427
              }
            ]
          },
          {
            "author": "qw3po",
            "body": "Have you seen the new Bellroy Transit Workpack? What are your thoughts about it relative to the 28L and the Heimplanet?",
            "score": 2,
            "created": 1607836495,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "Looking at it, I think I’d keep the 28L Heimplanet as I think it can double as a smaller travel bag and EDC, while that work pack won’t be able to.",
                "score": 2,
                "created": 1607838838
              }
            ]
          },
          {
            "author": "CharsiCuba",
            "body": "I’m currently trying to decide between the two. How much bigger is the bellroy compared to the heimplanet? Is it a noticeable difference?",
            "score": 2,
            "created": 1685062072,
            "replies": [
              {
                "author": "BandaBassotti",
                "body": "The Bellroy will hold a lot more due to the lack of compartments inside. I’m terms of outer dimensions they’re pretty close",
                "score": 1,
                "created": 1685062909
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/zv1s2p4e107d1.png?width=1440&format=png&auto=webp&s=e6e4f42c9bcf6a37bd3a80bc5c8d8f0c8fbedbe0",
      "thread": {
        "title": "CTB20",
        "url": "https://www.reddit.com/r/EVERGOODS/comments/1dhhetd/ctb20/",
        "selftext": "oh yeah this one is the perfect one, replacing my 26 for sure. did the wrapping and pulls myself.",
        "author": "TayobtLG23",
        "score": 90,
        "numComments": 36,
        "created": 1718572168,
        "comments": [
          {
            "author": "leothethird",
            "body": "Nicely done - color of the paracord reminds me of Boba Fett!",
            "score": 9,
            "created": 1718572995,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "indeed, idk how to upload pics to comments but ill add a closeup to the post\n\nedit: nvm idk how to do that either",
                "score": 7,
                "created": 1718573237
              }
            ]
          },
          {
            "author": "mellamojoshua",
            "body": "Do you feel like the space dedicated to a laptop was well utilized…neither too little or too much?",
            "score": 4,
            "created": 1718572653,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "I use a 13\" macbook so for me its almost always fine, in my ctb26 which I used only for travel the secondary laptop slot was used for carrying flat items like ziplock and folded trash bags. I guess yeah for me the laptop space could be slimmer but I appreciate that it is separate and not like my plc or chz which I would never travel with if Im bring a laptop",
                "score": 7,
                "created": 1718572820
              },
              {
                "author": "[deleted]",
                "body": "The issue with the ctb series is the low quality 420d used to make it. It's only good point is that it's waterproof but it suffers from abrasion easily and develops fur balls. Wish they upgrade to higher quality materials like 840d or 1680 ballistic nylon",
                "score": 2,
                "created": 1738845969
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "tan mysterious imagine doll pocket deer waiting coordinated tie silky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
            "score": 4,
            "created": 1718583831,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "Im not sure what its called, but I will be posting a guide tomorrow :)",
                "score": 3,
                "created": 1718589977
              }
            ]
          },
          {
            "author": "GuerrillaApe",
            "body": "Awesome zipper pulls.  Do you have a guide on how to make them?",
            "score": 3,
            "created": 1718572900,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "Im not sure if theres a name for this style but I just made a diamond knot with a loop of about 7 inches of circumference then intertwined the remaining length, maybe I post a step by step guide or something if people are interested",
                "score": 14,
                "created": 1718573055
              }
            ]
          },
          {
            "author": "SkyeMist",
            "body": " Love the paracord additions! Can the sides fit a Nalgene bottle? Also, would you be able to fit both your laptop and an ipad in the laptop compartment?",
            "score": 3,
            "created": 1718575945,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "I dont own a nalgene but my 21oz hydroflask fits perfectly, I could see you fitting a slightly wider bottle but not sure how toght itll be.\n\nwith laptop, it will depend what kind of laptop you have, I think for sure you can fit a macbook pro 16\" and ipad pro, more than that might be too tight",
                "score": 3,
                "created": 1718577397
              },
              {
                "author": "Competitive_Set_9104",
                "body": "Not OP, but I can fit my 16\" laptop and iPad Pro 11\" in the laptop compartment. I don't have a Nalgene, but I'm able to fit my 32 oz Owala Freesip bottle as well. Notably it's tougher to fit on the laptop compartment zipper side when I have items in there so I put it on the other water bottle holder.",
                "score": 3,
                "created": 1718588214
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/hrh619ud107d1.png?width=1440&format=png&auto=webp&s=22cd301564503d76c5e3e774d5f285ede8fc91e2",
      "thread": {
        "title": "CTB20",
        "url": "https://www.reddit.com/r/EVERGOODS/comments/1dhhetd/ctb20/",
        "selftext": "oh yeah this one is the perfect one, replacing my 26 for sure. did the wrapping and pulls myself.",
        "author": "TayobtLG23",
        "score": 90,
        "numComments": 36,
        "created": 1718572168,
        "comments": [
          {
            "author": "leothethird",
            "body": "Nicely done - color of the paracord reminds me of Boba Fett!",
            "score": 9,
            "created": 1718572995,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "indeed, idk how to upload pics to comments but ill add a closeup to the post\n\nedit: nvm idk how to do that either",
                "score": 7,
                "created": 1718573237
              }
            ]
          },
          {
            "author": "mellamojoshua",
            "body": "Do you feel like the space dedicated to a laptop was well utilized…neither too little or too much?",
            "score": 4,
            "created": 1718572653,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "I use a 13\" macbook so for me its almost always fine, in my ctb26 which I used only for travel the secondary laptop slot was used for carrying flat items like ziplock and folded trash bags. I guess yeah for me the laptop space could be slimmer but I appreciate that it is separate and not like my plc or chz which I would never travel with if Im bring a laptop",
                "score": 7,
                "created": 1718572820
              },
              {
                "author": "[deleted]",
                "body": "The issue with the ctb series is the low quality 420d used to make it. It's only good point is that it's waterproof but it suffers from abrasion easily and develops fur balls. Wish they upgrade to higher quality materials like 840d or 1680 ballistic nylon",
                "score": 2,
                "created": 1738845969
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "tan mysterious imagine doll pocket deer waiting coordinated tie silky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
            "score": 4,
            "created": 1718583831,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "Im not sure what its called, but I will be posting a guide tomorrow :)",
                "score": 3,
                "created": 1718589977
              }
            ]
          },
          {
            "author": "GuerrillaApe",
            "body": "Awesome zipper pulls.  Do you have a guide on how to make them?",
            "score": 3,
            "created": 1718572900,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "Im not sure if theres a name for this style but I just made a diamond knot with a loop of about 7 inches of circumference then intertwined the remaining length, maybe I post a step by step guide or something if people are interested",
                "score": 14,
                "created": 1718573055
              }
            ]
          },
          {
            "author": "SkyeMist",
            "body": " Love the paracord additions! Can the sides fit a Nalgene bottle? Also, would you be able to fit both your laptop and an ipad in the laptop compartment?",
            "score": 3,
            "created": 1718575945,
            "replies": [
              {
                "author": "TayobtLG23",
                "body": "I dont own a nalgene but my 21oz hydroflask fits perfectly, I could see you fitting a slightly wider bottle but not sure how toght itll be.\n\nwith laptop, it will depend what kind of laptop you have, I think for sure you can fit a macbook pro 16\" and ipad pro, more than that might be too tight",
                "score": 3,
                "created": 1718577397
              },
              {
                "author": "Competitive_Set_9104",
                "body": "Not OP, but I can fit my 16\" laptop and iPad Pro 11\" in the laptop compartment. I don't have a Nalgene, but I'm able to fit my 32 oz Owala Freesip bottle as well. Notably it's tougher to fit on the laptop compartment zipper side when I have items in there so I put it on the other water bottle holder.",
                "score": 3,
                "created": 1718588214
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/vrl8b3xndrn81.jpg?width=1080&crop=smart&auto=webp&s=cdf21d7c7393b34943956ac6d87a06641700722a",
      "thread": {
        "title": "Heimplanet's Commuter Pack! First impressions in comments.",
        "url": "https://www.reddit.com/r/backpacks/comments/tfjmi6/heimplanets_commuter_pack_first_impressions_in/",
        "selftext": "",
        "author": "SaltyMargaritas",
        "score": 77,
        "numComments": 14,
        "created": 1647442895,
        "comments": [
          {
            "author": "SaltyMargaritas",
            "body": "(By the way, the roll-top in my photo looks really uneven because I have a long roll of tinfoil in the bag!)\n\n[Heimplanet's Commuter Pack](https://en.heimplanet.com/products/taschen-carry_essentials-commuter-pack) is an all-black roll-top backpack designed for casual everyday use. It has a volume of 18L which is expandable to 22L thanks to its roll-top, and it is made of Heimplanet's own [DYECOSHELL fabric](https://en.heimplanet.com/blogs/designraum/dyecoshell%E2%84%A2). In addition to the roll-top opening, it also has a medium-size front pocket and a small zippered side pocket.\n\nThis is my first roll-top backpack. I have always been intimidated by roll-top backpacks because they just seemed frustrating to use on a daily basis.\n\nNow you might ask, \"But SaltyMargaritas, what was it about this particular roll-top that told you to give it a chance?\". Well, the Commuter Pack has a long vertical side zipper that allows access to the main compartment, so I don't need to open the roll-top every time I need to get something from the main compartment. I also dig that the main compartment has light grey interior lining that improves visibility.\n\nHowever, the internal laptop sleeve can be accessed only through the top, which isn't a hassle for me personally. Overall, I have to say that this particular bag's roll-top is pretty easy to use - I like the nice aluminium G-hook and magnetic closure that the opening has. The opening snaps shut magnetically, you roll twice and then secure the roll-top with the G-hook. Using the roll-top has definitely been easier than I imagined.\n\nThe most unique aspect of this backpack is the \"hovering\" front pocket, which means that there is free empty space between the front pocket and the backpack. This allows you to get creative and slide something like [a jacket](https://youtu.be/TFHC-_JUGNU?t=98) or [bike lock](https://cdn.shopify.com/s/files/1/0533/4738/5504/products/Heimplanet-Commuter-Pack-dark-grey-2.jpg?v=1646229074) through there. It also means you can fill out the front pocket without losing any space in the main compartment.\n\nHowever, it is worth pointing out that the front pocket isn't so spacious that you can fit a several tech devices in it. So if you're a person who carries not just your laptop, but also a Kindle, Nintendo Switch and an iPad with you, for example, you just won't have enough organization for all these devices and some of them would just have to go in the main compartment.\n\nIn the smaller side pocket I was able to fit a small flashlight, my Victorinox and my small Leatherman multi-tool. This pocket is meant for something like keys or AirPods - small items that you want to access quickly without taking the pack off.\n\nThis is also not the pack for you if you want lots of ventilation on the back panel. It has a really rigid back panel that can turn your back into a swamp during a hot summer, however I personally like a sturdy back panel when I ride my e-scooter.\n\nI really dig the dope-dyed DYECOSHELL fabric. It's really soft but also feels strong. I am a little concerned about the flimsy straps which get really narrow where they connect to the pack, and don't seem enforced enough. I fear that they might start tearing at some point? Who knows.\n\nI really love the sternum strap that they sell separately as an accessory. It's magnetic and really nice to use. However, it's sad that I could only buy the sternum strap together with the hip belt, which I don't even need, and it cost 30€, which is a little steep for two additional straps in my opinion.\n\nOverall, I quite like the bag! The roll-top is actually surprisingly convenient, the side access is very useful, the hovering front pocket is an unique touch, but it's a relatively simple pack. Without my big tech pouch that holds my charger, power bank and other tech items, and just goes in the main compartment, I'd probably want more quick access pockets. The Commuter Pack also doesn't have a water bottle pocket, which I know is a dealbreaker for some, but I don't carry a bottle all the time and if I do, I can just keep it in the main compartment and get it through the side opening.\n\nIf you have any questions I'm happy to answer.\n\n&amp;#x200B;\n\n**Pros**\n\n* Great bag for a roll-top novice because of convenient side access\n* Grey lining adds some visibility to what could be just a big black hole\n* Laptop sleeve is suspended and has a nice fleece lining\n* Hovering front pocket can hold a jacket or bike lock\n* Very well-constructed\n\n&amp;#x200B;\n\n**Cons / things to consider**\n\n* Not enough ventilation on the back panel\n* Straps feel a little basic and flimsy (but not uncomfortable)\n* The front pocket is designed just for basic stuff\n* No meaningful way to carry a bottle, you just have to leave it in the main compartment where it can tip over",
            "score": 15,
            "created": 1647443420,
            "replies": [
              {
                "author": "Wonderful-Salt-48",
                "body": "Thanks for the review!   \nVisually, this bag looks a lot like my Sandqvist [Bernt](https://www.sandqvist.com/en/p/bernt-black) \\- black rolltop with front pocket, except the Bernt has an external laptop pocket (access from a side zipper on the back, a feature I really like) and two side compartments for bottles.   \nWhat I don't like about the Bernt: front pocket is small and difficult to access, would like another internal zippered pocket or some kind of organization. Have not used it in summer yet but I'm sure ventilation wouldn't be great either.  \nLooks like you can't win in every single aspect, but happy to see similar options!",
                "score": 6,
                "created": 1647445892
              }
            ]
          },
          {
            "author": "Jungal10",
            "body": "It looks much better than in their website.\nCool stuff",
            "score": 3,
            "created": 1647448822,
            "replies": []
          },
          {
            "author": "balingkesana",
            "body": "Bag looks awesome but I don't see myself using a rolltop bag haha. Having used the backpack, do you maybe have any thoughts on their [24l Transit Line Daypack](https://en.heimplanet.com/products/transit-line-daypack-24l-black) ?",
            "score": 3,
            "created": 1647464877,
            "replies": []
          },
          {
            "author": "leothelion634",
            "body": "Looks exactly like my ikea backpack",
            "score": 3,
            "created": 1647517272,
            "replies": []
          },
          {
            "author": "[deleted]",
            "body": "I honestly don't get the bias against rolltops. I can get into my Millican Smith in half the time I can get any of my GoRuck bags open. and it takes the same time to close it up. There are no zippers that break (well, one for the laptop), no plastic buckles\n\nI also find top loaders to be much better grocery bags",
            "score": 3,
            "created": 1647522466,
            "replies": [
              {
                "author": "SaltyMargaritas",
                "body": "Agreed, it's much less cumbersome than I'd been led to believe!",
                "score": 2,
                "created": 1647524633
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/4ye3v6vyrfoe1.jpeg?width=1080&crop=smart&auto=webp&s=a109d6012f939116eeacdb887265b79ec12654d2",
      "thread": {
        "title": "Bellroy lite travel pack or other recommendations?",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1ja933o/bellroy_lite_travel_pack_or_other_recommendations/",
        "selftext": "Hi, I am wondering of changing my “businesses” travel bag.  Today have an old DB hugger 25L and I have the space I need for my stuff but the organization I terrible.  I think the 30 liter is big enough for all of this I live I Scandinavia so at winter I need some thicker clothes. \n\nMy packing list usually have \n\n-clothes for 2 days\n- MacBook Pro 13” \n- iPad Pro 11” \n- bellroy desk caddy or venture pouch\n- 1 liter osprey tsa approved toiletry kit \n- uncle straps edc travel case \n- gym clothes \n",
        "author": "CommercialUnusual921",
        "score": 7,
        "numComments": 12,
        "created": 1741862654,
        "comments": [
          {
            "author": "elendil_99",
            "body": "I had many issues with Bellroy. From the famous strap slippage issue to magnets coming out and loops or fabric tearing. I owned a total of 5 backpacks. Post sale is quite bad and they never solves your problem, they will always say that you may had done something wrong. I sold most of them and am still trying to get rid of the rest. Many others here had issues as well. \n\nI'd look into Cotopaxi 30L or the Osprey daylite 26+6. If weight doesnt concerns you, you have the evergoods ctb, peak design and the Aer travel pack.",
            "score": 7,
            "created": 1741863505,
            "replies": [
              {
                "author": "CommercialUnusual921",
                "body": "The reason why I asked is that I have heard rumors about the bad customer support.\n\nI think the  cotopaxi is the option other I like the hinge like opening so that I have a better control over my gear. I have an older osprey fairpoint that I use for longer travels.",
                "score": 1,
                "created": 1741903805
              }
            ]
          },
          {
            "author": "areyoualocal",
            "body": "Sit tight, in the next few days they're releasing a Transit Travel Pack Pro that might also be suitable.",
            "score": 2,
            "created": 1741867984,
            "replies": [
              {
                "author": "lollipop3653",
                "body": "how do you know this? are there leaks?",
                "score": 2,
                "created": 1741890258
              }
            ]
          },
          {
            "author": "SeattleHikeBike",
            "body": "Popular travel bag comparison spreadsheet from /u/-Nepherim :\nhttps://docs.google.com/spreadsheets/d/1fSt_sO1s7moXPHbxBCD3JIKPa8QIZxtKWYUjD6ElZ-c",
            "score": 2,
            "created": 1741872407,
            "replies": []
          },
          {
            "author": "CosmosBE",
            "body": "Since you're in Europe you could be interested in Heimplanet? The transit line is made for travel. It's great quality and design.",
            "score": 1,
            "created": 1741865145,
            "replies": [
              {
                "author": "CommercialUnusual921",
                "body": "I am more in the market for a hinge or book  style opening but I like the heimplanet for edc carry",
                "score": 1,
                "created": 1741903913
              }
            ]
          }
        ]
      }
    }
  ]
}