{
  "name": "Lowe Alpine AirZone Trail 35",
  "imageThreads": [
    {
      "image": "https://preview.redd.it/l6f6k2hbppgd1.jpeg?width=1080&crop=smart&auto=webp&s=a5866c5be6cf119c4850d6c78cc856fbd9e3a2f3",
      "thread": {
        "title": "Lowe Alpine Yacuri 65L ",
        "url": "https://www.reddit.com/r/wildcampingintheuk/comments/1ek5wbx/lowe_alpine_yacuri_65l/",
        "selftext": "hiya guys just picked up this lowe alpine yacuri 65l reduced from 240 to 170 after being put on to lowe alpine by an old friend of mine anyone got any reviews or experience with lowe alpine as a brand heard good things but never got anything before! ",
        "author": "NomadicWandererr",
        "score": 3,
        "numComments": 7,
        "created": 1722805517,
        "comments": [
          {
            "author": "Cooper8t",
            "body": "I have the (newest model) Lowe Alpine Cerro Torre 65-85L. Thing is an absolute beast. Very comfortable (even though it weighs in at 2.9kg), tonnes of space for a week away in winter and the thing is bulletproof/strong.\n\nAlso bought the Lowe Alpine AirZone Trail 35L for lightweight weekend trips in the warmer months. Been great.\n\nLowe Alpine is one of those brands, even before RAB bought them out which is reliably good quality. Some people swear by Osprey, but each to their own.",
            "score": 2,
            "created": 1722808059,
            "replies": [
              {
                "author": "NomadicWandererr",
                "body": "just looked up the cerro torre and it does look like a real good bit of kit, espically for those hardy winter outings, yeah i think im gonna see how i get on then maybe upgrade my day pack to one of the smaller lowe alpine ones, yeah that was my friends main point that they have always been proper quality stuff 👍",
                "score": 2,
                "created": 1722810758
              }
            ]
          },
          {
            "author": "Choice-Demand-3884",
            "body": "My Lowe Alpine 25 litre daypack is absolutely bombproof. It must be 28-30 years old.  Passed it on to my dad to carry his art materials. I'd have bought another but got a killer deal on an Osprey Hikelite.",
            "score": 2,
            "created": 1722818014,
            "replies": [
              {
                "author": "NomadicWandererr",
                "body": "yeah i’ve heard they last for years, part of the reason i wanted to give one a try 👌",
                "score": 1,
                "created": 1722892922
              }
            ]
          },
          {
            "author": "SEVENFIGHTERSUSER",
            "body": "Some impressions? Is it a true 65liters or like many modern backpack is too poorly deep and not allow to store big objects?",
            "score": 1,
            "created": 1739398118,
            "replies": [
              {
                "author": "NomadicWandererr",
                "body": "it’s smaller than 65 but i still make it work",
                "score": 1,
                "created": 1739465285
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/i8fq295arn7e1.jpeg?width=1080&crop=smart&auto=webp&s=53dfe9b554adc544833ba1bdd7443eb5d274d438",
      "thread": {
        "title": "Be honest, how many bags does everyone have? ",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/1hh9f7b/be_honest_how_many_bags_does_everyone_have/?tl=es-es",
        "selftext": "And do you guys store your bags? How many of you guys have too many bags to do this with 😂? Luckily i’ve only got these 3, unless you count the plate carrier from goruck i use for rucking and calisthenics. \n\nLeft to right; GR1 21L 1000D, GRXC2 21L, and Mission Workshop Carryology Collaboration. \n\nIf i could only keep one it would be my Samurai bag, as it’s my favorite. ",
        "author": "nszajk",
        "score": 244,
        "numComments": 246,
        "created": 1734549863,
        "comments": [
          {
            "author": "hungaryhungaryhippoo",
            "body": "nice try! i can spot a fake post from my wife a mile away!",
            "score": 214,
            "created": 1734550356,
            "replies": [
              {
                "author": "hungaryhungaryhippoo",
                "body": "but probably somewhere around 20",
                "score": 46,
                "created": 1734550426
              },
              {
                "author": "lostbluecobra",
                "body": "\"It's ok honey, I only have 2 and I got them on a special sale for $1 each!\"",
                "score": 16,
                "created": 1734560109
              }
            ]
          },
          {
            "author": "shanethomas28",
            "body": "Including bags stuffed in a closet because I’ve deemed them useless or all bags?",
            "score": 57,
            "created": 1734550714,
            "replies": [
              {
                "author": "smallverysmall",
                "body": "This hurts. But still love it.",
                "score": 13,
                "created": 1734551319
              },
              {
                "author": "sffunfun",
                "body": "I have an entire closet dedicated to backpacks. Gave a bunch away. Still left with an entire closet dedicated to backpacks. Like we’re talking at least 15-20.",
                "score": 12,
                "created": 1734565121
              }
            ]
          },
          {
            "author": "Astrospal",
            "body": "Do slings and fanny packs count ?",
            "score": 45,
            "created": 1734550492,
            "replies": [
              {
                "author": "nanay4201",
                "body": "Asking the real questions",
                "score": 13,
                "created": 1734560407
              },
              {
                "author": "Random-Kitty",
                "body": "This isn’t a backpack exclusive space. We have to enjoy all the bags.",
                "score": 13,
                "created": 1734563639
              }
            ]
          },
          {
            "author": "Top-Criticism-3172",
            "body": "Fifth Amendment\n\nNo person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a Grand Jury, except in cases arising in the land or naval forces, or in the Militia, when in actual service in time of War or public danger; nor shall any person be subject for the same offence to be twice put in jeopardy of life or limb; nor shall be compelled in any criminal case to be a witness against himself, nor be deprived of life, liberty, or property, without due process of law; nor shall private property be taken for public use, without just compensation.",
            "score": 37,
            "created": 1734553081,
            "replies": []
          },
          {
            "author": "zuiu010",
            "body": "My wife probably reads this sub, so I’ll say 1.",
            "score": 23,
            "created": 1734550441,
            "replies": [
              {
                "author": "[deleted]",
                "body": "I've been given the ultimatum, The bags go, or  I go. My dilemma is that I can't take them *all* with me!",
                "score": 6,
                "created": 1734555502
              }
            ]
          }
        ]
      }
    }
  ]
}