{
  "name": "Sandqvist Bernt",
  "imageThreads": [
    {
      "image": "https://preview.redd.it/vrl8b3xndrn81.jpg?width=1080&crop=smart&auto=webp&s=cdf21d7c7393b34943956ac6d87a06641700722a",
      "thread": {
        "title": "Heimplanet's Commuter Pack! First impressions in comments.",
        "url": "https://www.reddit.com/r/backpacks/comments/tfjmi6/heimplanets_commuter_pack_first_impressions_in/",
        "selftext": "",
        "author": "SaltyMargaritas",
        "score": 79,
        "numComments": 14,
        "created": 1647442895,
        "comments": [
          {
            "author": "SaltyMargaritas",
            "body": "(By the way, the roll-top in my photo looks really uneven because I have a long roll of tinfoil in the bag!)\n\n[Heimplanet's Commuter Pack](https://en.heimplanet.com/products/taschen-carry_essentials-commuter-pack) is an all-black roll-top backpack designed for casual everyday use. It has a volume of 18L which is expandable to 22L thanks to its roll-top, and it is made of Heimplanet's own [DYECOSHELL fabric](https://en.heimplanet.com/blogs/designraum/dyecoshell%E2%84%A2). In addition to the roll-top opening, it also has a medium-size front pocket and a small zippered side pocket.\n\nThis is my first roll-top backpack. I have always been intimidated by roll-top backpacks because they just seemed frustrating to use on a daily basis.\n\nNow you might ask, \"But SaltyMargaritas, what was it about this particular roll-top that told you to give it a chance?\". Well, the Commuter Pack has a long vertical side zipper that allows access to the main compartment, so I don't need to open the roll-top every time I need to get something from the main compartment. I also dig that the main compartment has light grey interior lining that improves visibility.\n\nHowever, the internal laptop sleeve can be accessed only through the top, which isn't a hassle for me personally. Overall, I have to say that this particular bag's roll-top is pretty easy to use - I like the nice aluminium G-hook and magnetic closure that the opening has. The opening snaps shut magnetically, you roll twice and then secure the roll-top with the G-hook. Using the roll-top has definitely been easier than I imagined.\n\nThe most unique aspect of this backpack is the \"hovering\" front pocket, which means that there is free empty space between the front pocket and the backpack. This allows you to get creative and slide something like [a jacket](https://youtu.be/TFHC-_JUGNU?t=98) or [bike lock](https://cdn.shopify.com/s/files/1/0533/4738/5504/products/Heimplanet-Commuter-Pack-dark-grey-2.jpg?v=1646229074) through there. It also means you can fill out the front pocket without losing any space in the main compartment.\n\nHowever, it is worth pointing out that the front pocket isn't so spacious that you can fit a several tech devices in it. So if you're a person who carries not just your laptop, but also a Kindle, Nintendo Switch and an iPad with you, for example, you just won't have enough organization for all these devices and some of them would just have to go in the main compartment.\n\nIn the smaller side pocket I was able to fit a small flashlight, my Victorinox and my small Leatherman multi-tool. This pocket is meant for something like keys or AirPods - small items that you want to access quickly without taking the pack off.\n\nThis is also not the pack for you if you want lots of ventilation on the back panel. It has a really rigid back panel that can turn your back into a swamp during a hot summer, however I personally like a sturdy back panel when I ride my e-scooter.\n\nI really dig the dope-dyed DYECOSHELL fabric. It's really soft but also feels strong. I am a little concerned about the flimsy straps which get really narrow where they connect to the pack, and don't seem enforced enough. I fear that they might start tearing at some point? Who knows.\n\nI really love the sternum strap that they sell separately as an accessory. It's magnetic and really nice to use. However, it's sad that I could only buy the sternum strap together with the hip belt, which I don't even need, and it cost 30€, which is a little steep for two additional straps in my opinion.\n\nOverall, I quite like the bag! The roll-top is actually surprisingly convenient, the side access is very useful, the hovering front pocket is an unique touch, but it's a relatively simple pack. Without my big tech pouch that holds my charger, power bank and other tech items, and just goes in the main compartment, I'd probably want more quick access pockets. The Commuter Pack also doesn't have a water bottle pocket, which I know is a dealbreaker for some, but I don't carry a bottle all the time and if I do, I can just keep it in the main compartment and get it through the side opening.\n\nIf you have any questions I'm happy to answer.\n\n&amp;#x200B;\n\n**Pros**\n\n* Great bag for a roll-top novice because of convenient side access\n* Grey lining adds some visibility to what could be just a big black hole\n* Laptop sleeve is suspended and has a nice fleece lining\n* Hovering front pocket can hold a jacket or bike lock\n* Very well-constructed\n\n&amp;#x200B;\n\n**Cons / things to consider**\n\n* Not enough ventilation on the back panel\n* Straps feel a little basic and flimsy (but not uncomfortable)\n* The front pocket is designed just for basic stuff\n* No meaningful way to carry a bottle, you just have to leave it in the main compartment where it can tip over",
            "score": 15,
            "created": 1647443420,
            "replies": [
              {
                "author": "Wonderful-Salt-48",
                "body": "Thanks for the review!   \nVisually, this bag looks a lot like my Sandqvist [Bernt](https://www.sandqvist.com/en/p/bernt-black) \\- black rolltop with front pocket, except the Bernt has an external laptop pocket (access from a side zipper on the back, a feature I really like) and two side compartments for bottles.   \nWhat I don't like about the Bernt: front pocket is small and difficult to access, would like another internal zippered pocket or some kind of organization. Have not used it in summer yet but I'm sure ventilation wouldn't be great either.  \nLooks like you can't win in every single aspect, but happy to see similar options!",
                "score": 5,
                "created": 1647445892
              }
            ]
          },
          {
            "author": "Jungal10",
            "body": "It looks much better than in their website.\nCool stuff",
            "score": 3,
            "created": 1647448822,
            "replies": []
          },
          {
            "author": "balingkesana",
            "body": "Bag looks awesome but I don't see myself using a rolltop bag haha. Having used the backpack, do you maybe have any thoughts on their [24l Transit Line Daypack](https://en.heimplanet.com/products/transit-line-daypack-24l-black) ?",
            "score": 3,
            "created": 1647464877,
            "replies": []
          },
          {
            "author": "leothelion634",
            "body": "Looks exactly like my ikea backpack",
            "score": 3,
            "created": 1647517272,
            "replies": []
          },
          {
            "author": "[deleted]",
            "body": "I honestly don't get the bias against rolltops. I can get into my Millican Smith in half the time I can get any of my GoRuck bags open. and it takes the same time to close it up. There are no zippers that break (well, one for the laptop), no plastic buckles\n\nI also find top loaders to be much better grocery bags",
            "score": 3,
            "created": 1647522466,
            "replies": [
              {
                "author": "SaltyMargaritas",
                "body": "Agreed, it's much less cumbersome than I'd been led to believe!",
                "score": 2,
                "created": 1647524633
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/947wot4yfuz81.jpg?width=1080&crop=smart&auto=webp&s=544dd8829ef1c9182c46724418c58707fda43359",
      "thread": {
        "title": "Can anyone help me, what back pack this is?",
        "url": "https://www.reddit.com/r/backpacks/comments/uqwjvw/can_anyone_help_me_what_back_pack_this_is/",
        "selftext": "",
        "author": "maestro4ev",
        "score": 9,
        "numComments": 1,
        "created": 1652709365,
        "comments": [
          {
            "author": "HentaiConnoisseur12",
            "body": "That looks like the Sandqvist Bernt\n\nhttps://www.sandqvist.co.uk/p/bernt-black",
            "score": 3,
            "created": 1652711008,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/zkqqg0ei7sdb1.jpg?width=960&crop=smart&auto=webp&s=6e3fa37d2ddc92f0aab66fc693ead3b9b5294349",
      "thread": {
        "title": "Looking for recommendation. Sandqvist Ruben 2.0 : yes or no ?",
        "url": "https://www.reddit.com/r/backpacks/comments/157qos3/looking_for_recommendation_sandqvist_ruben_20_yes/",
        "selftext": "Thinking of buying a Sandqvist Ruben 2.0. Is it any good ?",
        "author": "crasxtro",
        "score": 9,
        "numComments": 3,
        "created": 1690147245,
        "comments": [
          {
            "author": "Fee5555",
            "body": "Tried some of their backpacks in their Berlin store. They looked very expensive (which they were), but the quality was just insanely bad. It was like someone designed the backpacks just purely for looks and no one actually ever tried it out before selling.",
            "score": 3,
            "created": 1690198623,
            "replies": []
          },
          {
            "author": "optix_clear",
            "body": "Expensive- why this bag? Why Not Timbuk2 or any other roll top bag?",
            "score": 1,
            "created": 1690155728,
            "replies": []
          },
          {
            "author": "fat_river_rat",
            "body": "The Ruben sandwich should be filled with sauerkraut.",
            "score": -1,
            "created": 1690147684,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/0vrbtut78fib1.jpg?width=320&crop=smart&auto=webp&s=f6683c5915b438e9febe583bbfb21884e77971cb",
      "thread": {
        "title": "Can anyone identify this bag?",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/15siafb/can_anyone_identify_this_bag/",
        "selftext": "",
        "author": "Shakenbakers",
        "score": 3,
        "numComments": 8,
        "created": 1692169343,
        "comments": [
          {
            "author": "Shakenbakers",
            "body": "Hi all, saw this bag online the other day. I think it may be a Crumpler?\nHad two front pockets at the bottom.\nA horizontal zip above those front pockets.\nAnd then a horizontal zip at the top.\nAlso had handles like a tote pack.\nAppreciate any info!\nThanks",
            "score": 1,
            "created": 1692169349,
            "replies": []
          },
          {
            "author": "optix_clear",
            "body": "https://www.sandqvist.us/p/bernt-black\nIKEA bag \n\nhttps://www.ikea.com/us/en/p/vaerldens-backpack-black-60487927/",
            "score": 1,
            "created": 1692194459,
            "replies": [
              {
                "author": "Shakenbakers",
                "body": "I think you're right! Thanks so much :))",
                "score": 1,
                "created": 1692232054
              }
            ]
          },
          {
            "author": "Vijidalicia",
            "body": "I agree with the other commenter who said it was the IKEA bag! I own this, ask away :)",
            "score": 1,
            "created": 1692194693,
            "replies": [
              {
                "author": "Shakenbakers",
                "body": "Would be keen to hear your experiences/any gripes! Seems cheap enough I'm leaning towards grabbing one anyway",
                "score": 1,
                "created": 1692232106
              }
            ]
          }
        ]
      }
    },
    {
      "image": "https://preview.redd.it/ucqh6haa7sr81.jpg?width=1080&crop=smart&auto=webp&s=0ee0e0458cfba16af82f0abc187323122b48a5a1",
      "thread": {
        "title": "Stubble &amp; Co Rolltop Alternative? I love the backpack, specifically the laptop compartment, it's waterproofing, not crazy about its literage (only 21L) - anyone have any recommendations for alternatives? Or anyone have it and reckon it's worth it?",
        "url": "https://www.reddit.com/r/backpacks/comments/tx65rd/stubble_co_rolltop_alternative_i_love_the/",
        "selftext": "",
        "author": "TheSuperFishSalesman",
        "score": 57,
        "numComments": 28,
        "created": 1649195453,
        "comments": [
          {
            "author": "Jungal10",
            "body": "Wandrd Prvke? Comes in 11, 21, 31 and 41L",
            "score": 14,
            "created": 1649220652,
            "replies": [
              {
                "author": "Jhnn25",
                "body": "Was about to say the same, strongly sharing the looks of the prvke from the side.",
                "score": 2,
                "created": 1649226726
              },
              {
                "author": "vance2693",
                "body": "Is this primarily a camera bag? Or can i just use it as every day without ever putting a camera in it",
                "score": 1,
                "created": 1682733763
              }
            ]
          },
          {
            "author": "[deleted]",
            "body": "Millican Smith 25l is similar.",
            "score": 8,
            "created": 1649230432,
            "replies": []
          },
          {
            "author": "theninthcl0ud",
            "body": "Topo designs rover pack (tech or premium version) is a similar bag but even smaller still but different colors and different pocketing",
            "score": 4,
            "created": 1649199701,
            "replies": [
              {
                "author": "TheSuperFishSalesman",
                "body": "This also looks pretty dope, thank you!",
                "score": 3,
                "created": 1649228295
              }
            ]
          },
          {
            "author": "TheSuperFishSalesman",
            "body": "Just a little pricy for me, but want a nice backpack for work",
            "score": 2,
            "created": 1649195559,
            "replies": []
          },
          {
            "author": "StinklePink",
            "body": "Timbuk2 makes some real quality bags. I’ve had one of their side-load laptop backpacks for 15 years. Daily driver. Solid.\n\nhttps://www.timbuk2.com/collections/laptop-backpacks",
            "score": 2,
            "created": 1649246023,
            "replies": []
          }
        ]
      }
    },
    {
      "image": "https://external-preview.redd.it/cB1Hwlox6eufbWxP4tB7XajGobshZPZE33-rnDmp9fs.jpg?width=320&crop=smart&auto=webp&s=8e8118e56a19f3e12a5dc59c71487f1f26fd94de",
      "thread": {
        "title": "Roll-Top Reccomendations?",
        "url": "https://www.reddit.com/r/ManyBaggers/comments/v2kqv4/rolltop_reccomendations/",
        "selftext": "Hi, I'm looking for an everyday roll-top backpack to use for biking, commuting, and traveling. I'm sticking to a budget of $150 (ideally under $100 though), and I feel pretty strongly about the following features (but they're not *necessarily* dealbreakers), in order of importance:\n\n\\- 22-30L in size (I plan to carry groceries periodically)\n\n\\- Laptop sleeve in the main compartment\n\n\\- At least one water bottle side-sleeve, 2 is preferable\n\n\\- At least one front pocket/compartment that isn't part of the main compartment\n\n\\- Easy zipper access to the laptop sleeve from the back/side\n\nThe only bag I've found that meets *all* of these requirements is the [Timbuk2 Tuck](https://www.timbuk2.com/products/1029-tuck-laptop-backpack?variant=39408391127082), but I've heard the quality is questionable (plastic buckle likes to break, bottle sleeves don't stretch or hold bottles very securely, could be a bit more padded). Other options that come close are:\n\n- [Osprey Arcane Roll Top](https://www.osprey.com/us/en/product/osprey-arcane-roll-top-ARCANRLTOPF20.html) - Not the biggest fan of its aethetics, not sure why though.\n\n- [Roark Passenger Bag](https://roark.com/products/day-trip-passenger-27l-mens-bags-ra208-black?variant=39419076542535)-- Would prefer if the buckles clipped down to the side instead of to each other, maybe they do actually? Otherwise it seems pretty sweet.\n\n- [Stubble &amp; Co The Roll Top](https://www.stubbleandco.com/collections/all-products/products/the-roll-top?variant=40445040230586) - I know literally nothing about this brand, seems quite nice though.\n\nOther reccomendations would be great or, if you've used one of these bags, some insight into what you like/dislike about them.",
        "author": "ThisGuyHyucks",
        "score": 15,
        "numComments": 25,
        "created": 1654100357,
        "comments": [
          {
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 3,
            "created": 1654103767,
            "replies": [
              {
                "author": "ThisGuyHyucks",
                "body": "Yeah that bag actually looks super functional and like a really good option. The only thing is that I think it looks maybe just a tad too rugged, I wanted something that looks just a little more modern/urban. But it's definitely on my radar now, if I can't find what else I'm looking for then I'll probably go for it. Don't hold your bag for me, but I appreciate it!\n\nEdit: What do you like/dislike about it? What do you use it for?",
                "score": 1,
                "created": 1654108339
              }
            ]
          },
          {
            "author": "bikingguy1",
            "body": "Modern Dayfarer Backpack seems like it may work\n\nhttps://moderndayfarer.com/products/dayfarer",
            "score": 2,
            "created": 1654107023,
            "replies": [
              {
                "author": "ThisGuyHyucks",
                "body": "Hey thanks for the suggestion! I actually feel strongly about it being a roll-top, that's kind of a dealbreaker for me. But that's a good find nonetheless.",
                "score": 1,
                "created": 1654107467
              }
            ]
          },
          {
            "author": "Klutzy-Abrocoma-1222",
            "body": "Hey what bag did you end up going with?\nI was going through the same search process and I ended up getting the stubble and Co for 135€. I'm waiting to receive them",
            "score": 2,
            "created": 1696516065,
            "replies": [
              {
                "author": "yobishthatsmonica",
                "body": "Same for as well. I'm contemplating between the Stubble &amp; Co or the [TomToc Navigator T61](https://www.tomtoc.com/products/navigator-t61-rolltop-backpack-23l?variant=43859975536870) as this was a bit more durable (at least from visual appearance) and cheaper!",
                "score": 2,
                "created": 1699251206
              },
              {
                "author": "Ccwaterboy71",
                "body": "How to do you like the stubble and co pack?\nMy girlfriend is interested in buying one",
                "score": 1,
                "created": 1738374067
              }
            ]
          },
          {
            "author": "Wonderful-Salt-48",
            "body": "Heimplanet Commuter\n\nSandqvist Bernt (have used for ~6 months, front pocket accessibility is annoying but overall happy with the bag)\n\nEdit:spacing",
            "score": 1,
            "created": 1654103247,
            "replies": [
              {
                "author": "ThisGuyHyucks",
                "body": "The Bernt actually looks like it has pretty much everything I want + some extra things I'm a huge fan of (love the compression straps), and it's beautiful too. This is at the top of my list now! What do you like/dislike about it? What do you mainly use it for? Why is the front pocket annoying to you?",
                "score": 2,
                "created": 1654108992
              }
            ]
          },
          {
            "author": "thedoogbruh",
            "body": "Chrome bags are currently 25% off and they have all those features, except for the side/back zippered laptop sleeve.\n\nMy bravo 2 has an external laptop compartment though that is super secure and accessible.",
            "score": 1,
            "created": 1654103650,
            "replies": [
              {
                "author": "ThisGuyHyucks",
                "body": "I was actually looking at their sale items, the only bag that was on my radar from them was the Urban Ex 2.0 but that's not on sale. In fact, the only bag I see that's on sale is the Urban Ex 1.0 and I can't really find much info about it. I'm not seeing a front pocket or bottle sleeve though :/",
                "score": 1,
                "created": 1654108429
              }
            ]
          }
        ]
      }
    }
  ]
}